main.floors.MT1=
{
    "floorId": "MT1",
    "title": "马奇诺防线",
    "name": "马奇诺防线",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:cri",
            "value": "false"
        },
        {
            "type": "setValue",
            "name": "item:I600",
            "operator": "+=",
            "value": "1"
        },
        {
            "type": "setValue",
            "name": "flag:hitice",
            "value": "true"
        },
        {
            "type": "setValue",
            "name": "flag:lighton",
            "value": "true"
        },
        {
            "type": "setValue",
            "name": "item:I335",
            "operator": "+=",
            "value": "1"
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setValue",
            "name": "flag:stage",
            "value": "1"
        },
        "\r[yellow]Mission 1 马奇诺防线",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[盟军指挥官,hero]我们几乎没费多大力气就剿灭了全部试图进攻防线的敌军，现在只剩外围的这些散兵游勇了。",
        "\t[盟军指挥官,hero]防御工事的炮火射程够不到这里，但就算没有炮火支援，以我军现在的实力，消灭他们不成问题。",
        "\t[盟军指挥官,hero]开始进攻！",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档页面。",
        {
            "type": "callSave"
        },
        "\t[系统提示]1号商店已开启",
        {
            "type": "openShop",
            "id": "shop1"
        },
        "\t[任务目标]⭐通过当前区域\n⭐摧毁所有敌方坦克\n⭐全歼敌军",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]特别说明：本塔允许负伤，后期提升后勤值去打弱怪会有不错的回血效果！",
        {
            "type": "callBook"
        },
        {
            "type": "setValue",
            "name": "flag:第一关通关",
            "value": "0"
        },
        {
            "type": "setTask",
            "name": "第一关任务1",
            "n": 1,
            "text": "通过当前区域",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "第一关通关",
                    "operator": "=",
                    "text": "通过当前区域",
                    "count": "1"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第一关任务2",
            "n": 4,
            "text": "摧毁所有敌方坦克",
            "info": [
                {
                    "type": "checkEnemyType",
                    "checkEnemyType": "轻坦",
                    "floorId": [
                        "MT1",
                        "MT2",
                        "MT3",
                        "MT4",
                        "MT5"
                    ],
                    "operator": "<=",
                    "text": "剩余轻坦",
                    "count": 0
                },
                {
                    "type": "checkEnemyType",
                    "checkEnemyType": "中坦",
                    "floorId": [
                        "MT1",
                        "MT2",
                        "MT3",
                        "MT4",
                        "MT5"
                    ],
                    "operator": "<=",
                    "text": "剩余中坦",
                    "count": 0
                },
                {
                    "type": "checkEnemyType",
                    "checkEnemyType": "重坦",
                    "floorId": [
                        "MT1",
                        "MT2",
                        "MT3",
                        "MT4",
                        "MT5"
                    ],
                    "operator": "<=",
                    "text": "剩余重坦",
                    "count": 0
                },
                {
                    "type": "checkEnemyType",
                    "checkEnemyType": "坦歼",
                    "floorId": [
                        "MT1",
                        "MT2",
                        "MT3",
                        "MT4",
                        "MT5"
                    ],
                    "operator": "<=",
                    "text": "剩余坦歼",
                    "count": 0
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第一关任务3",
            "n": 1,
            "text": "全歼敌军",
            "info": [
                {
                    "type": "killAll",
                    "floorId": [
                        "MT1",
                        "MT2",
                        "MT3",
                        "MT4",
                        "MT5"
                    ],
                    "text": "剩余敌人"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,5": [
            {
                "type": "choices",
                "text": "想要了解什么？",
                "choices": [
                    {
                        "text": "作品简介及世界观",
                        "action": [
                            "本塔是铁血战将系列的第三部，均改编自二战真实历史。第一作“雄鹰展翅”的背景为美日之间的太平洋海战，第二作“赤色荣光”背景为苏德战场，本作的背景则是西线以及北非战场。",
                            "而玩家操控的主角并非是某个真实的历史人物。他会迅速辗转于各大战场，出现在任何需要他的地方，他甚至没有固定的国籍，总之就是个带你走完二战的虚拟人物，实战不理解也没关系，把敌人都扬了就行。",
                            "本塔同样会有关于敌我双方各种装备的信息介绍，与前作同样会在木牌和商店中出现。",
                            "但由于我们的主要敌人——德国，绝大多数武器装备都已经在前作中出现过，所以已出现过的敌人不会有木牌介绍。",
                            "本塔没有分支结局，只需要通关即可。"
                        ]
                    },
                    {
                        "text": "计分方式（重要）",
                        "color": [
                            255,
                            0,
                            0,
                            1
                        ],
                        "action": [
                            "大多数关卡都有3个任务。通过当前区域时，每完成一个任务，就会获得一颗星⭐（通关时至少能获得1个）。最终结算分数时，每颗星计100分。",
                            "简而言之，最终得分就取决于你完成了多少个任务。所有区域全部达成三星通关即为最高分。"
                        ]
                    },
                    {
                        "text": "关于难度",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": [
                            "一般情况下，如果任务中没要求必须全歼敌军的话，就没必要清怪，后面不会卡金经的。但，也不能一点都不清，哪怕残血进下一区也得把怪尽可能的清一下，要不然作者也不敢保证后面一定不卡。",
                            "难度方面不用担心，这个作者从来不会造难度过大的塔（因为作者自身水平太菜）。地狱难度除外，那个作者自己打不过，找大佬测的。"
                        ]
                    },
                    {
                        "text": "怪物手册以及临界显示（重要）",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": [
                            "怪物手册经过特殊改造，第一行固定为生命、金币和经验，第三行固定为攻击、空袭和回合数",
                            "第二行则根据敌人类型而显示不同的数值：陆军显示穿甲和装甲，海军和空军显示鱼雷管和雷击。",
                            "本作中临界系统无法正常运行，已替换为回合数。因此，地图上的敌人显伤上面的数字不是临界，而是战斗的回合数。需要特别注意。"
                        ]
                    },
                    {
                        "text": "完结版更新内容（重要）",
                        "color": [
                            0,
                            255,
                            0,
                            1
                        ],
                        "action": [
                            "1.在广大玩家的强烈要求下，作者尝试做回临界系统。重做的临界系统并不完美，极个别情况下并不能准确计算出临界，而且对玩家的设备性能略有挑战。玩家手动开启临界显示后，怪物显伤上方将额外显示一行临界值（顺序为：最上面临界，中间回合数，最下面显伤）。如果对自己的设备有自信的玩家可以尝试开启临界显示，设备不行还硬开的玩家，死机了可别怪我没提醒你哦！",
                            "2.新增一项道具，用于提示本区域的任务要求。忘记任务目标时可以翻背包使用道具查看，不必再读档回去了。",
                            "3.优化准备区域NPC切装界面，只会显示当前已有装备，当前没有的或是本区域禁用的装备不会再以灰色条目显示出来（试用装备除外）。如果你买完装备发现NPC那边没有相应条目，说明是本区域禁用装备。",
                            "4.降低chapter5之前部分关卡的难度（包括：榴弹炮的领域伤害降低90%等）并修复已知bug。",
                            "5.新增“改造”机制，部分旧装备可用于改造成同系列新装备（例如：持有飓风1型的情况下，购买飓风2型时可以用原有的飓风1型改造购买飓风2型，按飓风1型价格的80%进行降价）",
                            "6.主角在北冰洋战斗时，浮冰不再是摆设，撞到后会有一点伤害，可以关闭这一设定（默认开启）。",
                            "7.一位一直在b站支持我的粉丝希望我把ta做进游戏，作为宠粉up主我满足了ta（我真善良），ta将以一位NPC的身份，负责在部分区域给予玩家一些小提示，以帮助玩家度过难关。",
                            "8.在额外设置道具里可以选择是否开启自动拾取。自动拾取的物品不包括血瓶。但自动拾取功能似乎有很大问题，清完怪的时候可以开一下检测有没有漏能力，其他时候建议关着。",
                            "9.在额外设置里可以选择是否开启某些额外功能，例如开关宝石特效、打怪后的特殊音效等（主要是斯图卡之类的敌人确实有点吵）。",
                            "10.特定地点会出现旧装备退役点，可以出售不需要的装备。普通装备可按原价的60%进行回收，但如果该装备可以进行改造升级，则只能按40%价格回收。",
                            "11.楼传现在可以不在楼梯边使用。后期还会有对称飞技能和岔路口之类的，所以你懂的。"
                        ]
                    },
                    {
                        "text": "作者的话",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": [
                            "根据本作最初的设计，海陆空三种敌人以及装备会分别具有不同的战斗方式以及属性名称，因此新增的属性值甚至有十多种。后来作者也觉得这样设计实在过于复杂，决定牺牲游戏的真实性来简化游戏难度（尽管现在也很复杂）。",
                            "本作暂不支持手机端的原因也很简单——实在太麻烦了，光pc端ui的重新设计就费了老大功夫，手机就更困难了。因此作者只能忍痛决定放弃手机端，对此向各位没时间玩电脑的学生党以及上班族深表歉意（真实原因：懒、忙）",
                            "战斗系统原本打算采用新新2一样的战斗方式，引入气息系统等等，后来作罢了。原因有两个，一个是做不到，另一个是……手残作者自己都玩不来那种战斗方式。",
                            "最后祝游戏愉快"
                        ]
                    },
                    {
                        "text": "取消",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": []
                    }
                ]
            }
        ],
        "2,9": [
            "注：本塔接近零成本制作，所用素材没一个是原创，如有侵权即刻删除。音频、图片等素材来源（借物表）如下：",
            "bgm来源：三国志曹操传、永远的七日之都、双星物语、林德拉克计划、碧蓝航线、War on the Sea、钢铁雄心、冰封前线系列、战争雷霆、坦克世界、将军的荣耀系列、空中冲突太平洋航母、欧洲空战英雄、FarthestEnd、Conquest of Paradise、Exodus",
            "音效来源：War in the Pacific(WITP)、猎杀潜航、偷袭珍珠港、太平洋风暴、空中冲突太平洋航母、KARDS、还有从各种魔塔里面借的",
            "图片来源：War in the Pacific(WITP)、百度、知乎等"
        ],
        "1,8": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]你好！咱是完结版新加的NPC，负责在适当的时候给出一点提示。现在的话，咱建议去看一下上面的木牌哦！"
        ]
    },
    "changeFloor": {
        "14,7": {
            "floorId": "MT2",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "4,7": [
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]再次提示：如果是第一次游玩完结版玩家，建议看一下牌子里的完结版更新内容。",
            {
                "type": "if",
                "condition": "(flag:hard===1)",
                "true": [
                    "\t[系统提示]检测到当前为“神剧难度”，获得40%全塔战斗减伤道具、20黄5蓝。祝游戏愉快！",
                    {
                        "type": "setValue",
                        "name": "item:yellowKey",
                        "operator": "+=",
                        "value": "20"
                    },
                    {
                        "type": "setValue",
                        "name": "item:blueKey",
                        "operator": "+=",
                        "value": "5"
                    },
                    {
                        "type": "setValue",
                        "name": "item:hard1",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(flag:hard===2)",
                "true": [
                    "\t[系统提示]检测到当前为“街机难度”，获得20%全塔战斗减伤道具、10黄2蓝。祝游戏愉快！",
                    {
                        "type": "setValue",
                        "name": "item:yellowKey",
                        "operator": "+=",
                        "value": "10"
                    },
                    {
                        "type": "setValue",
                        "name": "item:blueKey",
                        "operator": "+=",
                        "value": "2"
                    },
                    {
                        "type": "setValue",
                        "name": "item:hard2",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(flag:hard===3)",
                "true": [
                    "\t[系统提示]检测到当前为“历史难度”，无福利。祝游戏愉快！"
                ]
            },
            {
                "type": "if",
                "condition": "(flag:hard===4)",
                "true": [
                    "\t[系统提示]检测到当前为“炼狱难度”，主角受到的战斗伤害增加10%",
                    {
                        "type": "setValue",
                        "name": "item:hard4",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 27,10015,202, 81, 21,201,202, 27, 29, 31,10015, 32,250, 22, 21],
    [ 27,10015, 27,10015, 28,10015,10015,10015, 81,10015,10015,10015,202,10015, 21],
    [ 27,10015, 27,10015,202,10015,  0,201,  0, 21,10015, 30,  0,10015,10015],
    [202, 82,202, 81, 31,  0, 31,10015,201,  0, 81,  0, 28, 81,250],
    [10015,10015,10015,10015,10015,201,10015,10015, 29,10015, 21,10015,201,10015, 28],
    [ 21, 21,129, 32,10015, 27,  0,250, 32,10015,201,10015, 31,10015, 31],
    [ 22,  0,  0, 32,10015,10015,202,10015, 32,10015,  0, 29,  0,10015,10015],
    [  0,  0,  0,  0, 86,201, 28,10015,10015,10015,202,10015, 82,201, 94],
    [ 22,601,  0, 32,10015,  0,202,10015, 31,  0, 29, 32,10015,10015,10015],
    [ 21, 21,129, 32,10015,10015,  0, 81,  0,203,10015,10015,  0,203, 29],
    [10015,10015,10015,10015,10015,  0, 27,10015,10015,  0, 21, 81,  0,10015, 22],
    [ 30, 30,10015, 21,10015,201,10015, 22,10015,244,10015,10015,217, 30,10015],
    [ 21, 21,10015, 27,  0,  0,10015, 30,10015, 27, 81,203,10015, 29,10015],
    [ 29, 29,10015,201,201,10015,10015,217,10015, 21,10015,202,10015, 27, 27],
    [345,201, 81,  0, 30,  0, 81,202,10015, 29,10015, 21, 27,10015,10015]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,20019,  0,  0,  0,20011,  0,  0,20010],
    [20019,  0,  0,20011,  0,  0,  0,  0,  0,  0,  0,  0,  0,20019,  0],
    [  0,20010,  0,  0,20019,  0,20011,  0,  0,  0,  0,  0,20011,  0,  0],
    [  0,  0,  0,  0,  0,  0,20010,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20019,20019,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,20011,  0,20010,  0,  0,  0],
    [  0,20011,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,20011,  0,  0,  0,20010,  0,  0,20010,  0,  0,  0,20019,  0],
    [20019,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20010,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,20010,  0,  0,  0,  0,20010,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20011,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20011,  0,  0,  0,20010,  0,  0,  0,  0,20011,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bgm": "7days4.mp3",
    "area": "陆地"
}