main.floors.MT1=
{
    "floorId": "MT1",
    "title": "马奇诺防线",
    "name": "马奇诺防线",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setValue",
            "name": "flag:stage",
            "value": "1"
        },
        {
            "type": "function",
            "async": true,
            "function": "function(){\ncore.ui.mission.mis('MISSION 1', '马奇诺防线', core.doAction);\n}"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[盟军指挥官,hero]我们几乎没费多大力气就剿灭了全部试图进攻防线的敌军，现在只剩外围的这些散兵游勇了。",
        "\t[盟军指挥官,hero]防御工事的炮火射程够不到这里，但就算没有炮火支援，以我军现在的实力，消灭他们不成问题。",
        "\t[盟军指挥官,hero]开始进攻！",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档页面。",
        {
            "type": "callSave"
        },
        "\t[系统提示]1号商店已开启",
        {
            "type": "openShop",
            "id": "shop1"
        },
        "\t[任务目标]⭐通过当前区域\n⭐摧毁所有敌方坦克\n⭐全歼敌军",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]特别说明：本塔允许负伤，后期提升后勤值去打弱怪会有不错的回血效果！",
        {
            "type": "callBook"
        },
        {
            "type": "setValue",
            "name": "flag:第一关通关",
            "value": "0"
        },
        {
            "type": "setTask",
            "name": "第一关任务1",
            "n": 1,
            "text": "通过当前区域",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "第一关通关",
                    "operator": "=",
                    "text": "抵达终点",
                    "count": "1"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第一关任务2",
            "n": 1,
            "text": "摧毁所有敌方坦克",
            "info": [
                {
                    "type": "checkEnemyType",
                    "checkEnemyType": "轻坦",
                    "floorId": [
                        "MT1",
                        "MT2",
                        "MT3",
                        "MT4",
                        "MT5"
                    ],
                    "operator": "<=",
                    "text": "剩余坦克数量",
                    "count": 0
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第一关任务3",
            "n": 1,
            "text": "全歼敌军",
            "info": [
                {
                    "type": "killAll",
                    "floorId": [
                        "MT1",
                        "MT2",
                        "MT3",
                        "MT4",
                        "MT5"
                    ],
                    "text": "剩余敌人数量"
                }
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "teach1.png",
            "sloc": [
                0,
                0,
                null
            ],
            "loc": [
                20,
                102,
                440,
                275
            ],
            "opacity": 1,
            "time": 500
        },
        {
            "type": "wait"
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,5": [
            {
                "type": "choices",
                "text": "想要了解什么？",
                "choices": [
                    {
                        "text": "作品简介及世界观",
                        "action": [
                            "本塔是铁血战将系列的第三部，均改编自二战真实历史。第一作“雄鹰展翅”的背景为美日之间的太平洋海战，第二作“赤色荣光”背景为苏德战场，本作的背景则是西线以及北非战场。",
                            "而玩家操控的主角并非是某个真实的历史人物。他会迅速辗转于各大战场，出现在任何需要他的地方，他甚至没有固定的国籍，总之就是个带你走完二战的虚拟人物，实在不理解也没关系，把敌人都扬了就行。",
                            "本塔同样会有关于敌我双方各种装备的信息介绍，与前作同样会在木牌和商店中出现。",
                            "但由于我们的主要敌人——德国，绝大多数武器装备都已经在前作中出现过，所以已出现过的敌人不会有木牌介绍。",
                            "本塔没有分支结局，只需要通关即可。"
                        ]
                    },
                    {
                        "text": "计分方式（重要）",
                        "color": [
                            255,
                            0,
                            0,
                            1
                        ],
                        "action": [
                            "大多数关卡都有3个任务。通过当前区域时，每完成一个任务，就会获得一颗星⭐（通关时至少能获得1个）。最终结算分数时，每颗星计100分。",
                            "简而言之，最终得分就取决于你完成了多少个任务。所有区域全部达成三星通关即为最高分。",
                            "完结版中，点击状态栏里的星星可以查看详细任务要求以及完成进度情况。"
                        ]
                    },
                    {
                        "text": "关于难度",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": [
                            "一般情况下，如果任务中没要求必须全歼敌军的话，就没必要清怪，后面不会卡金经的。但，也不能一点都不清，哪怕残血进下一区也得把怪尽可能的清一下，要不然作者也不敢保证后面一定不卡。",
                            "难度方面不用担心，这个作者从来不会造难度过大的塔（因为作者自身水平太菜）。地狱难度已删。"
                        ]
                    },
                    {
                        "text": "怪物手册以及临界显示（重要）",
                        "color": [
                            0,
                            255,
                            0,
                            1
                        ],
                        "action": [
                            "怪物手册经过特殊改造，第一行固定为生命、金币和经验，第三行固定为攻击、空袭和回合数",
                            "第二行则根据敌人类型而显示不同的数值：陆军显示穿甲和装甲，海军和空军显示鱼雷管和雷击等。",
                            "敌人的显伤数字共有三行。其中，最上面的数字代表\r[yellow]临界\r，中间的代表\r[yellow]回合数\r，下面的是\r[yellow]伤害\r。请注意分辨。"
                        ]
                    },
                    {
                        "text": "完结版更新内容（重要）",
                        "color": [
                            0,
                            255,
                            0,
                            1
                        ],
                        "action": [
                            "1.由于测试版问题太多，于是作者对整个游戏的底层代码进行了重构。临界显示已经重新实装，卡顿问题也得到了优化（不过偶尔还是有卡顿现象，这是一个名为Major GC的程序导致，对此作者暂无解决方法，如果有代码大神知道解决方法，欢迎留言）。此外还新增了部分设定，即便是已经玩过测试版的玩家，也请不要随便跳过剧情。",
                            "2.状态栏重构，部分区域点击后是有效果的。例如：点击星星⭐可以查看任务提示和进度，点击对应的技能可以直接使用，点击“下午茶”可以使用（如果有的话）。",
                            "3.前面部分关卡的难度有改动，之前的存档就别想着用了，重开吧！",
                            "4.新增“改造”机制，部分旧装备可用于改造成同系列新装备（例如：持有飓风1型的情况下，购买飓风2型时可以选择用原有的飓风1型改造购买飓风2型，按飓风1型价格的80%进行降价）。到后面会有退役装备（出售）的地方，不需要的装备可以在那里卖了。但可改造的装备，回收价格会更低，直接卖掉会很不划算。",
                            "5.主角在北冰洋战斗时，浮冰不再是摆设，撞到后会有一点伤害，可以关闭这一设定（默认开启）。",
                            "6.在额外设置里可以选择是否开启某些额外功能，例如开关宝石特效、打怪后的特殊音效等（主要是斯图卡之类的敌人确实有点吵）。",
                            "7.楼传现在可以不在楼梯边使用。后期还会有对称飞技能和岔路口之类的，操作得当可以省道具。"
                        ]
                    },
                    {
                        "text": "取消",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": []
                    }
                ]
            }
        ],
        "2,9": [
            "注：本塔接近零成本制作，所用素材没一个是原创，如有侵权即刻删除。音频、图片等素材来源（借物表）如下：",
            "bgm来源：三国志曹操传、永远的七日之都、双星物语、林德拉克计划、碧蓝航线、War on the Sea、钢铁雄心、冰封前线系列、战争雷霆、坦克世界、将军的荣耀系列、空中冲突太平洋航母、欧洲空战英雄、FarthestEnd、Conquest of Paradise、Exodus",
            "音效来源：War in the Pacific(WITP)、猎杀潜航、偷袭珍珠港、太平洋风暴、空中冲突太平洋航母、KARDS、还有从各种魔塔里面借的",
            "图片来源：War in the Pacific(WITP)、百度、知乎等"
        ],
        "1,8": [
            {
                "type": "text",
                "text": "\t[伊吹萃香]\f[specialnpc.jpg,0,280,100,200]你好！咱是完结版新加的NPC，负责在适当的时候给出一点提示。现在的话，咱建议去看一下上面的木牌哦！",
                "pos": [
                    100,
                    330,
                    380
                ]
            }
        ]
    },
    "changeFloor": {
        "14,7": {
            "floorId": "MT2",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 27,10015,202, 81, 21,201,202, 27, 29, 31,10015, 32,250, 22, 21],
    [ 27,10015, 27,10015, 28,10015,10015,10015, 81,10015,10015,10015,202,10015, 21],
    [ 27,10015, 27,10015,202,10015,  0,201,  0, 21,10015, 30,  0,10015,10015],
    [202, 82,202, 81, 31,  0, 31,10015,201,  0, 81,  0, 28, 81,250],
    [10015,10015,10015,10015,10015,201,10015,10015, 29,10015, 21,10015,201,10015, 28],
    [ 21, 21,129, 32,10015, 27,  0,250, 32,10015,201,10015, 31,10015, 31],
    [ 22,  0,  0, 32,10015,10015,202,10015, 32,10015,  0, 29,  0,10015,10015],
    [  0,  0,  0,  0, 86,201, 28,10015,10015,10015,202,10015, 82,201, 94],
    [ 22,601,  0, 32,10015,  0,202,10015, 31,  0, 29, 32,10015,10015,10015],
    [ 21, 21,129, 32,10015,10015,  0, 81,  0,203,10015,10015,  0,203, 29],
    [10015,10015,10015,10015,10015,  0, 27,10015,10015,  0, 21, 81,  0,10015, 22],
    [ 30, 30,10015, 21,10015,201,10015, 22,10015,244,10015,10015,217, 30,10015],
    [ 21, 21,10015, 27,  0,  0,10015, 30,10015, 27, 81,203,10015, 29,10015],
    [ 29, 29,10015,201,201,10015,10015,217,10015, 21,10015,202,10015, 27, 27],
    [345,201, 81,  0, 30,  0, 81,202,10015, 29,10015, 21, 27,10015,10015]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,20019,  0,  0,  0,20011,  0,  0,20010],
    [20019,  0,  0,20011,  0,  0,  0,  0,  0,  0,  0,  0,  0,20019,  0],
    [  0,20010,  0,  0,20019,  0,20011,  0,  0,  0,  0,  0,20011,  0,  0],
    [  0,  0,  0,  0,  0,  0,20010,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20019,20019,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,20011,  0,20010,  0,  0,  0],
    [  0,20011,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,20011,  0,  0,  0,20010,  0,  0,20010,  0,  0,  0,20019,  0],
    [20019,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20010,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,20010,  0,  0,  0,  0,20010,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20011,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20011,  0,  0,  0,20010,  0,  0,  0,  0,20011,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bgm": "7days4.mp3",
    "area": "陆地"
}