main.floors.MT139=
{
    "floorId": "MT139",
    "title": "珍珠港",
    "name": "珍珠港",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "medaction1.mp3",
    "firstArrive": [
        {
            "type": "animate",
            "name": "shootair",
            "loc": [
                7,
                2
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                7,
                2
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    7,
                    2
                ]
            ],
            "remove": true,
            "time": 500
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[巡逻的SBD飞行员,N496]Son of the bitch！为什么这里会有日本飞机？求救！求救！",
        "\t[盟军指挥官,hero]似乎有友军飞机遇到麻烦了，我要不要去帮帮他们？"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,14": {
            "floorId": "MT138",
            "loc": [
                13,
                0
            ]
        },
        "0,7": {
            "floorId": "MT140",
            "loc": [
                14,
                2
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "7,1": [
            {
                "type": "setValue",
                "name": "flag:MT139tsk",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:MT139tsk===5)",
                "true": [
                    "\t[巡逻的SBD飞行员,N496]我们得救了！万分感谢！我们现在就返回企业号航空母舰去汇报情况",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                4,
                                1
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                5,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                9,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                10,
                                1
                            ]
                        ],
                        "remove": true
                    }
                ]
            }
        ],
        "5,0": [
            {
                "type": "setValue",
                "name": "flag:MT139tsk",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:MT139tsk===5)",
                "true": [
                    "\t[巡逻的SBD飞行员,N496]我们得救了！万分感谢！我们现在就返回企业号航空母舰去汇报情况",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                4,
                                1
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                5,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                9,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                10,
                                1
                            ]
                        ],
                        "remove": true
                    }
                ]
            }
        ],
        "6,3": [
            {
                "type": "setValue",
                "name": "flag:MT139tsk",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:MT139tsk===5)",
                "true": [
                    "\t[巡逻的SBD飞行员,N496]我们得救了！万分感谢！我们现在就返回企业号航空母舰去汇报情况",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                4,
                                1
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                5,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                9,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                10,
                                1
                            ]
                        ],
                        "remove": true
                    }
                ]
            }
        ],
        "8,3": [
            {
                "type": "setValue",
                "name": "flag:MT139tsk",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:MT139tsk===5)",
                "true": [
                    "\t[巡逻的SBD飞行员,N496]我们得救了！万分感谢！我们现在就返回企业号航空母舰去汇报情况",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                4,
                                1
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                5,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                9,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                10,
                                1
                            ]
                        ],
                        "remove": true
                    }
                ]
            }
        ],
        "9,0": [
            {
                "type": "setValue",
                "name": "flag:MT139tsk",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:MT139tsk===5)",
                "true": [
                    "\t[巡逻的SBD飞行员,N496]我们得救了！万分感谢！我们现在就返回企业号航空母舰去汇报情况",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                4,
                                1
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                5,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                9,
                                2
                            ]
                        ],
                        "remove": true
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                10,
                                1
                            ]
                        ],
                        "remove": true
                    }
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 21,140, 21,140,566,593,  0, 22,  0,593,566,140,525, 29,525],
    [ 21,140, 21,140,496,  0,  0,593,  0,  0,496,140,528,593,528],
    [595,140,595,140,  0,496,  0,496,  0,496,  0,140,140, 81,140],
    [  0,593,  0,140,566,  0,593,  0,593,  0,566,140,  0,  0,525],
    [140, 81,140,140,140,140,140, 86,140,140,140,140,595,574,574],
    [ 27,  0,594,  0, 33,  0, 27,528, 27,  0,  0,594,  0,574,586],
    [140,140,140,  0,140,595,140,140,140, 81,140,140,  0,574,574],
    [ 92, 21, 82,593,140, 29, 29,140, 33,  0,525,140,  0,  0,574],
    [140,140,140,  0,528,140,140,140,140,140,595,140,140,594,574],
    [528,  0,140,140,  0,594,  0,140,  0,  0,  0,  0,593,  0,525],
    [  0, 33,594, 81,528,140,  0,140,595,140,140,140, 81,140,140],
    [140,593,140,140,  0,593,  0, 81,  0,140,  0,595,  0,595,  0],
    [527,527,140,593,140,140,594,140,  0, 82, 30,140,  0,140, 30],
    [  0,140,140,  0,566,140, 27,140,  0,140, 30,140,  0,140, 30],
    [  0,594, 81,  0,566,140, 27,140,  0,140, 30,140, 93,140, 30]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16,152,152,152,152,152,152,152,152,152,152,152, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152,152, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152,152, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152,152, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152,152, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152,152, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152,152, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152,152, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152, 16, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152, 16, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152, 16, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152,152, 16, 16, 16],
    [152,152,152,152,152,152,152,152,152,152,152, 16, 16, 16, 16],
    [152,152,152,152,152,152,152,152,152, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,574],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "天空"
}