main.floors.MT136=
{
    "floorId": "MT136",
    "title": "夏威夷附近",
    "name": "夏威夷附近",
    "width": 15,
    "height": 45,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "medaction1.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 2000
        },
        {
            "type": "setViewport",
            "loc": [
                0,
                0
            ],
            "time": 5000
        },
        {
            "type": "sleep",
            "time": 2000
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "外面这是哪个部队的飞机，星期天还在训练？",
        "不管了，睡觉睡觉。",
        {
            "type": "sleep",
            "time": 1000
        },
        "我们成功潜入夏威夷海军基地，没有被敌人发现！",
        "立刻向旗舰发送暗号",
        {
            "type": "showImage",
            "code": 1,
            "image": "pearlharbor1.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\\c[40]\r[red]虎！虎！虎！",
        {
            "type": "playSound",
            "name": "airstrike.mp3"
        },
        {
            "type": "sleep",
            "time": 2000
        },
        {
            "type": "playSound",
            "name": "dogfight.mp3"
        },
        {
            "type": "playSound",
            "name": "airalarm.mp3"
        },
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "pearlharbor2.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "if",
            "condition": "(flag:pearlharbor===true)",
            "true": [
                "快打起精神！没时间了！",
                "我们遭到了敌人的空袭，这次不是演习，战争开始了！",
                "外面现在一片混乱，我们的军舰一艘接一艘的起火，机场被炸的千疮百孔。",
                "一切都已经晚了，但我们不可能什么都不做！",
                "还有一架完好无损的P40战斗机可供你使用，赶快，爬上它，飞到天上去！",
                "天上几乎没有我们的飞机，向你看到的任何飞行物开火就行！揍扁他们最好，但要以活下去为主要目标！",
                "快去吧，我们会留在地面上，用我们手头能用的武器支援你。",
                "我要去找个电台，给其他地方的友军发电报，提醒他们注意：",
                "\r[red]珍珠港遭空袭，这不是演习！",
                {
                    "type": "setValue",
                    "name": "flag:hero_backup",
                    "value": "[status:hpmax,\nstatus:hp,\nstatus:atk,\nstatus:top,\nstatus:mdef,\nstatus:mana,\nstatus:money]",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "item:hard1",
                    "value": "flag:has_hard1",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "item:hard2",
                    "value": "flag:has_hard2",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "item:hard4",
                    "value": "flag:has_hard4",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "flag:永久道具备份",
                    "value": "core.status.hero.items.constants",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "flag:消耗道具备份",
                    "value": "core.status.hero.items.tools",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "flag:装备备份",
                    "value": "core.status.hero.items.equips",
                    "norefresh": true
                },
                {
                    "type": "function",
                    "function": "function(){\ncore.status.hero.items={constants:{},tools:{},equips:{}}\n}"
                },
                {
                    "type": "setValue",
                    "name": "item:book",
                    "value": "1",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "item:fly",
                    "value": "1",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "item:wand",
                    "value": "1",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:hpmax",
                    "value": "10000",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:hp",
                    "value": "5000",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:atk",
                    "value": "15",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:top",
                    "value": "0",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:mdef",
                    "value": "100",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:mana",
                    "value": "0",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:money",
                    "value": "0",
                    "norefresh": true
                },
                {
                    "type": "disableShop",
                    "id": "shop1"
                },
                {
                    "type": "disableShop",
                    "id": "shop2"
                },
                {
                    "type": "disableShop",
                    "id": "shop3"
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT137",
                    "loc": [
                        7,
                        14
                    ],
                    "direction": "up"
                }
            ],
            "false": [
                "1941年12月7日，美国在夏威夷群岛的海军基地珍珠港，突然遭到了来自日本飞机的空袭。",
                "美军对此完全没有任何预料。一上午的时间内，整个军港变为人间炼狱。",
                "这是一次有组织有预谋的行动。攻击由日本海军6艘大型航空母舰发起，350余架飞机分两个波次，从多个方向对港口、机场和其他一些设施发起空袭。",
                "攻击造成了极大的损失。美国太平洋舰队的全部8艘战列舰都受到重创或被击沉，6艘巡洋舰和3艘驱逐舰受损伤，270余架飞机被摧毁，3400军民伤亡。日军仅损失55架飞机和几艘微型潜艇。",
                "而日方直到袭击开始一段时间以后，才向美国政府提交宣战书。",
                "珍珠港事件的发生引起了整个美国的轰动，几乎每一个美国人都愤怒地发声，他们迫切想加入战争，把炸弹扔回日本领土上。之前的几年中，国内的反战呼声还很高，但就这一个早上的工夫，反战的声音几乎没有了。",
                "罗斯福总统于次日发表演讲，并正式对日宣战。几天后，美国也对德国和意大利宣战。一直受制于规矩和民众呼声的美国政府终于得以正式加入这场世界大战。",
                "珍珠港的袭击虽然炸毁了大部分军舰和飞机，但事件发生时，美国所有的航空母舰全都不在港内，储油设施和维修设备也都完好无损。这成为了美国日后反击的资本。",
                "战争机器开始飞速运转，各种武器弹药成批运出兵工厂，发到前线和盟友的手中。只需要足够的时间，无数钢铁大军就将出现在各大战场上，为敌人送上惊吓。",
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "playSound",
                    "name": "xinxinmagic.mp3"
                },
                "\t[世界消息]\r[aqua]美国 加入 反法西斯同盟国阵营",
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "confirm",
                    "text": "跳过剧情吗？",
                    "yes": [
                        {
                            "type": "changeFloor",
                            "floorId": "MT143",
                            "loc": [
                                7,
                                7
                            ],
                            "direction": "down"
                        }
                    ],
                    "no": [
                        {
                            "type": "sleep",
                            "time": 1000
                        },
                        "隆美尔从托布鲁克败退回到利比亚后，希特勒似乎是终于清楚的认识到，即便是最优秀的将军，在缺乏补给的情况下也会吃败仗。",
                        "即便在莫斯科战役中惨遭失败，希特勒还是从东线抽调了一批部队和物资送往北非，援助隆美尔的沙漠军团。尤其是空军。",
                        "1942年1月开始，随着德军第二航空队的加入，隆美尔逐渐掌握了一定的制空权，也获得了补给。现在，到了隆美尔的反击时间。",
                        "就像他刚到北非时的那样，英军在装甲战方面完全不是隆美尔的对手，没过多久就再次败下阵来，一路撤退到班加西后面的贾扎拉防线。",
                        "英军去年在这里的战败是由于大意轻敌，但这一次，没有人再敢疏忽。英军利用自己的地面数量优势把贾扎拉防线经营了起来。",
                        "贾扎拉防线主要由障碍物、地雷和步兵组成，可以拖住敌人，再由后方的装甲和火炮部队及时增援，消灭来犯之敌。并且，这条防线很长，在一望无际又缺乏资源的沙漠中几乎不可能被绕开。",
                        "这对隆美尔来说确实很棘手。但他还是迅速制定了计划，抓紧一切时间展开行动。",
                        "一场大战，就此展开。",
                        {
                            "type": "sleep",
                            "time": 500
                        },
                        {
                            "type": "showImage",
                            "code": 1,
                            "image": "chapter5.jpg",
                            "loc": [
                                0,
                                0
                            ],
                            "opacity": 1,
                            "time": 0
                        },
                        {
                            "type": "setCurtain",
                            "time": 500
                        },
                        {
                            "type": "sleep",
                            "time": 2000
                        },
                        {
                            "type": "setCurtain",
                            "color": [
                                0,
                                0,
                                0,
                                1
                            ],
                            "time": 500,
                            "keep": true
                        },
                        {
                            "type": "hideImage",
                            "code": 1,
                            "time": 0
                        },
                        {
                            "type": "sleep",
                            "time": 500
                        },
                        {
                            "type": "changeFloor",
                            "floorId": "MT142",
                            "loc": [
                                -1,
                                -1
                            ]
                        }
                    ]
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,596,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,596,  0,  0,  0,596,  0,596,  0,  0,  0,596,  0,  0],
    [  0,596,  0,596,  0,  0,  0,  0,  0,  0,  0,596,  0,596,  0],
    [596,  0,  0,  0,  0,  0,  0,597,  0,  0,  0,  0,  0,  0,596],
    [  0,  0,  0,597,  0,  0,597,  0,597,  0,  0,597,  0,  0,  0],
    [  0,  0,597,  0,597,  0,  0,  0,  0,  0,597,  0,597,  0,  0],
    [  0,596,  0,  0,  0,  0,  0,597,  0,  0,  0,  0,  0,596,  0],
    [596,  0,  0,598,  0,  0,597,  0,597,  0,  0,598,  0,  0,596],
    [  0,  0,598,  0,598,  0,  0,  0,  0,  0,598,  0,598,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,598,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,596,  0,  0,  0,598,  0,598,  0,  0,  0,596,  0,  0],
    [  0,596,  0,596,  0,  0,  0,596,  0,  0,  0,596,  0,596,  0],
    [596,  0,  0,  0,  0,597,  0,  0,  0,597,  0,  0,  0,  0,596],
    [  0,  0,  0,  0,597,  0,597,  0,597,  0,597,  0,  0,  0,  0],
    [  0,  0,598,  0,  0,  0,  0,598,  0,  0,  0,  0,598,  0,  0],
    [  0,598,  0,598,  0,  0,598,  0,598,  0,  0,598,  0,598,  0],
    [  0,  0,  0,  0,  0,598,  0,  0,  0,598,  0,  0,  0,  0,  0],
    [  0,596,  0,  0,  0,  0,  0,597,  0,  0,  0,  0,  0,596,  0],
    [596,  0,596,  0,  0,  0,597,  0,597,  0,  0,  0,596,  0,596],
    [  0,  0,  0,596,  0,  0,  0,597,  0,  0,  0,596,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,596,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,596,  0,596,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "天空",
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

]
}