main.floors.MT137=
{
    "floorId": "MT137",
    "title": "瓦胡岛",
    "name": "瓦胡岛",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass2",
    "bgm": "medaction1.mp3",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "pearlharbor.jpg",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 2000
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "showui"
        },
        {
            "type": "setValue",
            "name": "item:p40c",
            "operator": "+=",
            "value": "1"
        },
        {
            "type": "loadEquip",
            "id": "p40c"
        },
        "\t[地面通信]上帝啊！天上到处都是日本飞机！快往出口方向飞，当心那些零式战斗机！",
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐逃离珍珠港\n⭐解救友军巡逻机\n⭐尝试挽救亚利桑那号战列舰",
        {
            "type": "callBook"
        },
        {
            "type": "setValue",
            "name": "flag:珍珠港通关",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:MT139tsk",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:MT140tsk",
            "value": "0"
        },
        {
            "type": "setTask",
            "name": "间章任务1",
            "n": 1,
            "text": "逃离珍珠港",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "珍珠港通关",
                    "operator": "=",
                    "text": "通过当前区域",
                    "count": "1"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "间章任务2",
            "n": 1,
            "text": "解救友军巡逻机",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "MT139tsk",
                    "operator": ">=",
                    "text": "解围进度",
                    "count": "5"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "间章任务3",
            "n": 1,
            "text": "尝试挽救亚利桑那号战列舰",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "MT140tsk",
                    "operator": ">=",
                    "text": "解围进度",
                    "count": "9"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "9,13": [
            {
                "type": "text",
                "text": "\t[伊吹萃香]\f[specialnpc.jpg,0,280,100,200]别看面前这些鬼子飞机伤害一个比一个高，但踩了临界以后就全是软柿子！先想办法捡红宝石吧！",
                "pos": [
                    100,
                    280,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[伊吹萃香]\f[specialnpc.jpg,0,280,100,200]还有，不要尝试用测试版时候的路线，这区难度被调整了。",
                "pos": [
                    100,
                    280,
                    380
                ]
            }
        ]
    },
    "changeFloor": {
        "7,0": {
            "floorId": "MT138",
            "loc": [
                7,
                14
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 21, 21, 21,  2, 33, 33,  2, 91,  2, 27, 27,  2, 29, 29,528],
    [  0,594,  0,  2,  0,  0,  2,566,  2,  2,594,  2,  2,  2, 81],
    [  2, 81,  2,  2,594,  2,  0, 82,  0,  0,  0,  0,593,  0,594],
    [  0,  0,  0,  0,  0, 81,  0,  2,  2,594,  2,  2,  2, 81,  2],
    [  2,  2,  2,594,  0,  2,  0,593, 21, 27,528,  2,  0,593,  0],
    [566,  0,  2,  0, 33,  2,  0,  2,  2,528,  2,  2, 21,  2,566],
    [ 27,593, 81, 33,  0,  2, 81,  2, 27,  2,  2,525, 29,525,  2],
    [ 27,  0,  2,  0,594,  0,  0, 27, 29, 27,  0,  2, 27,  2,  2],
    [  2,  2,  2,  0,  2,  2,  2,594,  2,  2, 81,  2,  2, 21, 21],
    [  0,  0,594,  0, 33,  2,528,528,  2,  0,  0,566,  2,  0,  0],
    [ 33,  0,  2,  0,  0,593,528,  0,593,  0,  2, 81,  2,  2,594],
    [  2, 81,  2, 81,  2,  2,  2, 86,  2,  2,  0,  0,  0,  0,  0],
    [  0,594,  2,594,  0,  2,566,  0,566,  2,  2,  2, 81,  2,  2],
    [  0,  2,  2,  2,  0,  2,580,  0, 22,601, 34, 34,593, 34, 34],
    [528,528,528,528,528,  2,566,  0,566,  2, 27, 27, 29,528,528]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  2,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,574,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,574,  0,  0,  0,  0,  0,  0,  0,574,  0,  0,  0],
    [  0,  0,  0,  0,  0,574,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,574,  0,  0,  0,  0,574,  0,  0],
    [  0,  0,574,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,574,  0,574,  0,  0,  0,  0,  0,574,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,574,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,574],
    [574,  0,  0,  0,  0,574,  0,  0,574,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,574,  0,  0],
    [  0,  0,574,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,574,  0,  0,574,  0,  0,  0,574,  0,  0,  0,574,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "天空"
}