main.floors.MT145=
{
    "floorId": "MT145",
    "title": "加查拉防线",
    "name": "加查拉防线",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "sand",
    "bgm": "cao1.mp3",
    "firstArrive": [
        {
            "type": "text",
            "text": "\t[奥金莱克]\f[auchinleck.png,0,310]侧翼部队发来消息说他们遭到德军主力装甲部队的攻击，看来你这里的是佯攻部队。我将命令其他装甲部队前去迎击隆美尔，你继续处理这些佯攻部队即可。",
            "pos": [
                100,
                300,
                380
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "12,8": [
            "\f[c200.jpg,90,50]马基C.200战斗机1940年起于意大利投入使用，活跃于包括北非、巴尔干半岛、希腊和苏联的各大战场。C.200的性能比意大利之前的战斗机都要好，但武器配置仍然是2挺12.7mm的机枪，稍显不足。无论是在极端寒冷的苏联东线战场还是极端炙热的北非战场，C.200都能有不错的表现，但与盟军空军的绝对优势比起来还是显得杯水车薪。到意大利投降时，这种总产量1153架的战斗机只剩不到100架。"
        ]
    },
    "changeFloor": {
        "14,7": {
            "floorId": "MT144",
            "loc": [
                0,
                7
            ]
        },
        "0,7": {
            "floorId": "MT146",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 21, 21, 21, 21,150, 11,150,150,150,150, 11,150,531,530, 11],
    [363,150,150,150,150,521,521,518,363,  0,  0,150,531,405,150],
    [ 11,150,531,150, 11,150,150,362,150,150,577,150,150, 81,  0],
    [401, 81,  0,405,  0,531,150,532,532,150,  0,  0,361,150,362],
    [532,150,  0,150, 81,150,150,150, 81,150,150,361,  0,150,534],
    [532,150, 11,150,  0,532,  0,362,  0,530,  0, 11,534,150,361],
    [150,150,  0,150,150,150,361,150,150,250,150,150,150,150,533],
    [ 92,401, 82,569,578, 81,  0,533,150,530,589,534,361,533, 94],
    [150,150,  0,150,150,150,361,150,150,250,150,150,10289,150,533],
    [ 31,150, 11,150,533,  0,206,  0,150,  0,  0,362,530,150,362],
    [ 11,150,  0,150,362,150,150,  0,362,363,150,150,  0,150,534],
    [518,363,  0,577,530,  0, 11,  0,150,  0,  0,150,381,150,363],
    [150, 81,150,150,150,401,150,150,150,150,531,150,  0,224,  0],
    [ 21,364,150, 22,150,518,  0, 81, 21,150, 11,150,361,150, 11],
    [ 21, 21,150,534,362,  0, 11,150, 21,362,  0,150,520, 81,522]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}