main.floors.MT154=
{
    "floorId": "MT154",
    "title": "地中海",
    "name": "地中海",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "europe5.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,1": [
            {
                "type": "playSound",
                "name": "technology.mp3"
            },
            {
                "type": "function",
                "function": "function(){\nflags.learned[12]=true\n}"
            },
            {
                "type": "text",
                "text": "\t[系统提示]习得新技能：从海底出击",
                "async": true
            },
            "\t[系统提示]\f[skill12.jpg,90,50]从海底出击（150指挥点）：下一场与敌方海军战斗中，我方潜艇加入战斗，在战斗开始时抢先发射8枚鱼雷，随后潜艇撤退（战术技能）。",
            "\t[历史来源]\f[skill12.jpg,90,50]潜艇作战不是德军的专项。德军潜艇出名很大程度上是因为它们是德军破坏盟军运输线的最有效力量，而同盟国海军的作战重点在于歼灭敌军大型军舰。而德军恰好没多少大型战舰，所以大西洋上的盟军潜艇自然是没什么耀眼战果。但对于地球另一端的日本海军而言，美军潜艇也是一股不容轻视的力量，战争期间有不少包括战列舰和航空母舰在内的日本大型战舰殒命于美军潜艇的鱼雷之下。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "0,7": {
            "floorId": "MT153",
            "loc": [
                14,
                7
            ]
        },
        "14,7": {
            "floorId": "MT155",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT154_7_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "8,6": [
            {
                "type": "setValue",
                "name": "flag:door_MT154_7_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "6,4": [
            {
                "type": "setValue",
                "name": "flag:door_MT154_7_3",
                "operator": "+=",
                "value": "1"
            }
        ],
        "8,4": [
            {
                "type": "setValue",
                "name": "flag:door_MT154_7_3",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "7,5": {
            "0": {
                "condition": "flag:door_MT154_7_5==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT154_7_5",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        },
        "7,3": {
            "0": {
                "condition": "flag:door_MT154_7_3==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT154_7_3",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [530,530,530,530,216,  3,588, 22,588,  3,590,569, 82, 21,588],
    [  3,  3,  3,  3,360,  3, 21,551, 21,  3,569,569,  3,399,588],
    [216,531,531,531,531,  3,570, 21,570,  3,216,  3,  3, 82,  3],
    [360,  3,  3,  3,  3,  3,  3, 85,  3,  3,  0,  3,  0,211,360],
    [ 81,  3,533,216,534,  3,400,360,400,  3,532,  3,  0,  3,532],
    [533,  0,234,  3,534,  3,  3, 85,  3,  3,  0,  3,360,  3,532],
    [  3,  3,  3,211,534,  3,387,360,387,  3,255, 81,212,  3,  3],
    [ 92,  0, 21,360,  3,  3,  3, 82,  3,  3,  3,  3, 81,216, 94],
    [  3,  3,  3,211,  0,381,360,216,360,  0,381,  0,212,  3,  3],
    [532,532,532,  3,533,  0,  3,533,  3,533, 81,  3,577,521, 21],
    [578,  3,  3,521, 81,  3,  3,240,  3,  3,534,534,  3, 21,360],
    [  0,  0,360,234,  0,  0,  3,533,  3,534,534, 81,  3,  3,393],
    [  3,  3,  3, 81,  3,  0,360,216,360,534,  3,234,533,532,533],
    [518,531,  3,  0,  3,  3,  3, 82,  3,  3,  3,  3,  3,  3, 81],
    [518,531,240,  0,  3,536,537,255,538,539,  3,531,531,531,216]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}