main.floors.MT175=
{
    "floorId": "MT175",
    "title": "阿拉曼",
    "name": "阿拉曼",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "sand",
    "bgm": "allthis.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,4": [
            {
                "type": "playSound",
                "name": "technology.mp3"
            },
            {
                "type": "function",
                "function": "function(){\nflags.learned[13]=true\n}"
            },
            "\t[系统提示]习得新技能：金牌损管",
            "\t[系统提示]\f[skill13.jpg,90,50]金牌损管（180指挥点）：下一场与敌人海军的战斗结束后，如果剩余血量不足10%，则恢复全部血量（战术技能）。",
            "\t[历史来源]\f[skill13.jpg,90,50]二战时期，美国海军的损害管制人员（简称损管）实力惊人，经常像开了挂一样的把奄奄一息的战舰奇迹般的抢救回来。例如，美军“约克城”号航空母舰在珊瑚海海战中遭受重创，日军预计这艘航母最起码要修三个月才能出海，可美军的损管硬是在3天之内就修好了航母并送上中途岛战场。在中途岛战役中，约克城号又被日军轰炸机击中数次，可当天下午日军飞机再次赶来，却发现约克城号就像崭新出厂一样，让他们误以为这是另一艘同型号航母。类似的案例数不胜数。于是，人们便把二战期间的美国海军损管人员称为“氪金损管”。不过，现在的美军损管似乎从“氪佬”变成了“零充”，工作效率大不如前。2020年，美国“好人理查德”号两栖攻击舰起火，结果这把火烧了4天才被扑灭，“好人理查德”就这样变成了“熟人理查德”，宣告报废。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT173",
            "loc": [
                7,
                0
            ]
        },
        "14,7": {
            "floorId": "MT177",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "14,2": [
            {
                "type": "openDoor",
                "loc": [
                    12,
                    7
                ]
            }
        ],
        "14,12": [
            {
                "type": "openDoor",
                "loc": [
                    13,
                    7
                ]
            }
        ],
        "2,3": [
            {
                "type": "setValue",
                "name": "flag:door_MT175_1_4",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_MT175_1_4===5)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            1,
                            4
                        ]
                    }
                ]
            }
        ],
        "4,3": [
            {
                "type": "setValue",
                "name": "flag:door_MT175_1_4",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_MT175_1_4===5)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            1,
                            4
                        ]
                    }
                ]
            }
        ],
        "3,4": [
            {
                "type": "setValue",
                "name": "flag:door_MT175_1_4",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_MT175_1_4===5)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            1,
                            4
                        ]
                    }
                ]
            }
        ],
        "2,5": [
            {
                "type": "setValue",
                "name": "flag:door_MT175_1_4",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_MT175_1_4===5)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            1,
                            4
                        ]
                    }
                ]
            }
        ],
        "4,5": [
            {
                "type": "setValue",
                "name": "flag:door_MT175_1_4",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_MT175_1_4===5)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            1,
                            4
                        ]
                    }
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "1,4": {
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 22,250,  0,150,266, 81,  0,  0,150,531,150,531,150,150,150],
    [ 22,150,  0,250,  0,150,150,204,150,531,150,531,150,390,518],
    [150,150,150,150,150,150, 21, 21,150,  0,271,  0, 82,  0,232],
    [588,150,383,  0,369,150,383,150,150,150, 81,150,150,390,518],
    [551, 85,  0,220,  0, 82,  0,250,570,250,  0,518,150,150,150],
    [588,150,383,  0,369,150,404,150,150,150,534,  0,206, 21, 21],
    [150,150,150,150,150,150,534,150,150,150,409,150,150,150,150],
    [534,150,532,250,533,150,534,150,150,150,233, 81, 85, 85,619],
    [250, 81,532,150,403, 81,534,203, 21,150,409,150,150,150,150],
    [531,150,150,150,150,150,265,150,150, 21,  0,  0,206, 21, 21],
    [531,531,403, 81,  0,532,532,  0,150,150,150, 81,150,150,150],
    [150,150,150,150,250,150,150,250,534,150,570,  0,150,390,518],
    [530,530,232,150,534,534,203, 81,534,203,  0,534, 82,  0,232],
    [150,150,404, 82,265,150,150,  0,150,150,150,265,150,390,518],
    [530,530,232,150,518,518,150, 93,571,150, 21, 21,150,150,150]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}