main.floors.MT213=
{
    "floorId": "MT213",
    "title": "法国",
    "name": "法国",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "sky.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "europe4.mp3",
    "firstArrive": [
        {
            "type": "if",
            "condition": "(flag:MT211protect===true)",
            "true": [
                {
                    "type": "playSound",
                    "name": "xinxinmagic.mp3"
                },
                "\t[系统提示]先前分离的护航战机中队已经归队，攻击力返还",
                {
                    "type": "setValue",
                    "name": "status:atk",
                    "operator": "+=",
                    "value": "50"
                }
            ],
            "false": [
                {
                    "type": "playSound",
                    "name": "xinxinmagic.mp3"
                },
                "\t[系统提示]先前离队的轰炸机已被德军击落！友军血量-25万",
                {
                    "type": "setValue",
                    "name": "flag:友军血量",
                    "operator": "-=",
                    "value": "250000"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,14": {
            "floorId": "MT212",
            "loc": [
                7,
                0
            ]
        },
        "7,0": {
            "floorId": "MT214",
            "loc": [
                7,
                14
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [371,616,571,571,616,371,140, 91,140, 22,536,140,535,538,538],
    [ 81,140,140,140,140, 81,140,372,140,536,277,140,277,140,140],
    [  0,368,535,537,140,  0,140, 81,140,140, 82,140, 81,140, 21],
    [140,140,537,535,140,  0, 21,  0,  0,522,  0,536,  0,368, 21],
    [ 22,140,140,140,  0, 81,140,140,140, 81,140,140, 81,140, 21],
    [378, 82,  0,140,  0,140,538,140,390,518,390,140,  0,140,140],
    [518,140,518,140,521,140,538,140,140,616,140,140,536,140,522],
    [518,140,  0,277,  0,536,368,140,390,518,390,140,  0,378,  0],
    [140,140,140,140,140, 81,140,140,140, 81,140,140,140,140, 21],
    [571, 21,140,  0,206,  0,140,518,140,535,  0,536,  0,369,  0],
    [ 21,371,140, 22,140,  0,206,518,140,140,140,140,140, 81,140],
    [140, 81,140,140,140,140, 82,140,140,  0,369,  0,538,539,538],
    [369,  0,518,571,140,  0,277,  0, 81,536,140,140,140,140,140],
    [ 81,140,140,140,140,522,140,  0,140,  0,372,  0,140,539,539],
    [536,536,  0,369, 81,  0,140, 93,140,536,140,  0,368,539,539]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "天空"
}