main.floors.MT219=
{
    "floorId": "MT219",
    "title": "凯赛林隘口",
    "name": "凯赛林隘口",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "sand",
    "bgm": "cao5.mp3",
    "firstArrive": [
        {
            "type": "resumeBgm"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "text",
            "text": "\t[隆美尔]\f[rommel.png,0,310]如我所料，美国人根本不堪一击！全军按原定计划进行追击，扩大战果！我希望阿尼姆将军能尽快配合我完成夹击，你的部队是很关键的一部分！",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[阿尼姆]\f[anyum.png,0,310]现在的非洲军团已经不再是你一个人说了算的。我认为你的计划还是太过冒险，我拒绝协同进攻。",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐向西溃逃\n⭐通关时至少持有5把蓝钥匙\n⭐切换楼层次数不超过7次",
        {
            "type": "callBook"
        },
        {
            "type": "setValue",
            "name": "flag:第31关通关",
            "value": "0"
        },
        {
            "type": "setTask",
            "name": "第31关任务1",
            "n": 1,
            "text": "向西溃逃",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "第31关通关",
                    "operator": "=",
                    "text": "逃离战场",
                    "count": "1"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第31关任务2",
            "n": 1,
            "text": "通关时至少持有5把蓝钥匙",
            "info": [
                {
                    "type": "checkItem",
                    "checkItem": "blueKey",
                    "operator": ">=",
                    "text": "当前持有的蓝钥匙数量",
                    "count": 5
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第31关任务3",
            "n": 1,
            "text": "切换楼层次数不超过7次",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "mission32task2",
                    "operator": "<=",
                    "text": "本区域已切换楼层总次数",
                    "count": "7"
                }
            ]
        }
    ],
    "eachArrive": [
        {
            "type": "setValue",
            "name": "flag:mission32task2",
            "operator": "+=",
            "value": "1"
        }
    ],
    "parallelDo": "",
    "events": {
        "13,6": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]这关的敌人都非常强，每到一个新楼层还会额外扣攻击力。这时候就不要贪恋宝石了，火速往出口逃跑吧！别忘了上一关获得的对称飞技能哦！",
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]当然，你要是选的的低难度，或者下午茶数量在200以上，也可以试试杀穿前几张地图。"
        ]
    },
    "changeFloor": {
        "0,7": {
            "floorId": "MT220",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [148,148,148,148,150, 21, 21, 21,150,150,150,538, 81,232,150],
    [148,148,148,537,150,150, 81,150,150,  0,250,  0,150,523,535],
    [148,538,538,404,150,  0,253,  0,150,250,150,250,150,150,409],
    [150,150,150, 81,  0,204,150,204, 81,  0,150,536,150,518,518],
    [ 21, 21,409,  0,571,150,150,  0,150,265,150,  0,150,518,518],
    [ 21, 21,150,150,539,150,539,253,150,536,  0,150,150,150,150],
    [150,150,150, 81,  0,571,404,150,150,150,250,150,605,601,605],
    [ 92,  0,266,250,150,150,539,203,250,203,  0, 86,580,  0,  0],
    [150,150,150, 81,404,150,203,150,150,150,250,150,605,581,605],
    [571,250,518,150,537,150,539,220,150,265,536,150,150,150,150],
    [  0,150,518,150,537, 81,150,150,150,  0,232,  0,539,539,539],
    [271,150,150,150,150,232,536,523,248,518,150, 81,150,150,150],
    [  0, 81,539,248,539,  0, 81,150,150,150,150,266, 21, 22,148],
    [150,150,203,150,203,150,232,537,150,341, 82,519,148,148,148],
    [552,150, 21,150, 21,150,538,535,150,341,148,148,148,148,148]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}