main.floors.MT227=
{
    "floorId": "MT227",
    "title": "马雷特防线",
    "name": "马雷特防线",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "sand",
    "bgm": "desert3.mp3",
    "firstArrive": [
        {
            "type": "animate",
            "name": "aim",
            "loc": [
                14,
                2
            ]
        },
        {
            "type": "animate",
            "name": "hand",
            "loc": [
                14,
                2
            ]
        },
        {
            "type": "animate",
            "name": "wonder",
            "loc": [
                14,
                4
            ]
        },
        {
            "type": "animate",
            "name": "vehicleexplore",
            "loc": [
                14,
                4
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    14,
                    4
                ]
            ],
            "remove": true,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "text",
            "text": "\t[蒙哥马利]\f[montgomary.png,0,310]指挥官阁下，敌人的新式坦克非常强大，我们没有能正面击穿它们装甲的武器。",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙哥马利]\f[montgomary.png,0,310]先试着避免与其发生正面冲突，等到时机合适，再想办法摧毁。",
            "pos": [
                100,
                300,
                380
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,11": [
            {
                "type": "text",
                "text": "\t[伊吹萃香]\f[specialnpc.jpg,0,280,100,200]虎式坦克将在很长一段时间之内都作为强敌出现，它们难以被空军直接摧毁，并且你在1944年之前是无法撼动其装甲的！",
                "pos": [
                    100,
                    280,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[伊吹萃香]\f[specialnpc.jpg,0,280,100,200]摧毁一辆虎式需要付出不小代价，如果真要硬打，\r[yellow]用后勤砸死它们\r也许是个可行的办法。",
                "pos": [
                    100,
                    280,
                    380
                ]
            },
            "注：考虑到开虎式的一般都是王牌，本作中，虎式的装甲值是按照摆角度后的等效数值填的。"
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT226",
            "loc": [
                7,
                0
            ]
        },
        "14,0": {
            "floorId": "MT228",
            "loc": [
                14,
                14
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 22, 22,150,366,590,150,535,150,518, 81,536,150,518,150, 91],
    [ 11,150,150, 11,150,150,535,150,409,150,571,150,518, 82,  0],
    [536,266,150,365,536, 82,535, 11,  0,150,  0,150,  0,150,270],
    [150, 81,150,  0,365,244,150,150,253,150,539,409,539,150, 11],
    [248, 11,404, 81,150,518,236,150,150,150,150, 81,150,150,548],
    [580,150,539,244,  0,150,150,150,538,536,150,215,539,536,539],
    [150,150,150,150, 11,150,571, 11,265,538,150,150,244,150,150],
    [535,150,519,150,  0,265,  0,150,220,150,150,150, 11,150,392],
    [535,150,523,150,150, 81,150,150,150,536,536, 81,405,150,536],
    [  0, 82,404,150,  0,  0,244,  0,244,  0, 11,150,571, 81,232],
    [411,150,390,150,536,150,150, 81,150,150,215,150,150,150,  0],
    [ 81,150,150,410,571,150,392, 11,601,150,  0,536,392,150, 82],
    [232, 11,  0,  0, 81,150,150,362,150,150, 81,150,150,218, 22],
    [ 81,150,150,150,409,537,150,  0,150,539,409,539,150, 21,580],
    [ 21, 21, 21,150,537,537,150, 93,150,253, 21,580, 81,410,538]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}