main.floors.MT224=
{
    "floorId": "MT224",
    "title": "地图",
    "name": "地图",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "gaijin2.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "指挥官阁下，决战已经开始。",
        "美军在之前的战斗中元气大伤，暴露出他们兵员素质的不足。这次进攻，由我们光荣的大不列颠王国陆军担任主力，美国、自由法国和澳大利亚军队负责为我们提供支援。",
        {
            "type": "previewUI",
            "action": [
                {
                    "type": "drawArrow",
                    "x1": 48,
                    "y1": 240,
                    "x2": 208,
                    "y2": 208,
                    "style": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "lineWidth": 3
                },
                {
                    "type": "drawArrow",
                    "x1": 80,
                    "y1": 304,
                    "x2": 208,
                    "y2": 272,
                    "style": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "lineWidth": 3
                },
                {
                    "type": "drawArrow",
                    "x1": 112,
                    "y1": 368,
                    "x2": 240,
                    "y2": 304,
                    "style": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "lineWidth": 3
                },
                {
                    "type": "drawArrow",
                    "x1": 176,
                    "y1": 432,
                    "x2": 240,
                    "y2": 336,
                    "style": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "lineWidth": 3
                },
                {
                    "type": "drawArrow",
                    "x1": 272,
                    "y1": 432,
                    "x2": 272,
                    "y2": 336,
                    "style": [
                        255,
                        0,
                        0,
                        1
                    ],
                    "lineWidth": 3
                }
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "蒙哥马利元帅已经集结了大规模部队，盟军部队将从各个方向猛攻马雷特防线，这是我们与突尼斯之间的最后屏障。如果我们能获得胜利，敌人的沙漠军团将不复存在！",
        "你负责的正是整条防线中最坚固的环节之一。我们有压倒性的数量优势，但仍不可轻敌，德军反坦克高射炮的威力，我们已经领教过无数次。",
        "此外，从侦察机拍摄的照片上看来，敌人的阵地中似乎有一些\r[yellow]新型坦克\r的身影。美军报告称这些新型坦克十分强大。考虑到他们战斗水平低下，我们对此报告持怀疑态度，但最好留些心眼。",
        "现在已经可以去做行动准备了，祝好运！",
        {
            "type": "clearMap"
        },
        {
            "type": "changeFloor",
            "floorId": "MT225",
            "loc": [
                7,
                7
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,584,  0,  0,499,  0,  0,216,  0,  0,  0,  0,216,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,216,  0,  0,  0,  0],
    [  0,584,  0,  0,  0,  0,499,  0,  0,  0,  0,216,  0,  0,  0],
    [  0,  0,  0,499,  0,  0,  0,  0,  0,  0,216,  0,  0,  0,216],
    [  0,  0,  0,  0,  0,  0,  0,207,369,203,  0,  0,  0,216,  0],
    [  0,  0,  0,  0,505,  0,  0,369,565,547,624,564,  0,  0,  0],
    [  0,550,548,623,270,409,  0,207,369,203,  0,  0,  0,  0,  0],
    [504,550,  0,250,501,505,409,  0,250,  0,  0,  0,  0,  0,  0],
    [  0,550,548,363,623,589,232,250,  0,  0,250,  0,  0,  0,499],
    [  0,550,  0,548,250,623,253,  0,  0,250,  0,  0,499,  0,  0],
    [  0,504,550,  0,501,250,589,409,270,505,409,  0,  0,  0,584],
    [  0,  0,  0,550,548,623,363,589,253,623,589,  0,499,  0,  0],
    [  0,  0,504,550,  0,548,250,501,363,250,501,  0,  0,  0,499],
    [  0,  0,  0,  0,504,550,  0,548,  0,548,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,504,550,504,550,504,  0,  0,584,  0,  0]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16,  0,  0,  0, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0, 16, 16, 16, 16],
    [ 16,488,492,491,  0,  0,  0,  0,  0,  0,  0, 16, 16, 16, 16],
    [488,488,492,491,491,  0,  0,  0,  0,  0,  0,  0, 16, 16, 16],
    [488,488,492,491,491,491,  0,  0,  0,  0,  0,  0, 16, 16, 16],
    [492,492,492,492,491,491,  0,  0,  0,  0,  0,  0, 16, 16, 16],
    [492,492,493,493,491,491,491,  0,  0,  0,  0, 16, 16, 16, 16],
    [493,493,493,493,492,491,491,491,491,491,491, 16, 16, 16, 16],
    [493,493,493,493,492,492,491,491,491,491,491, 16, 16, 16, 16],
    [493,493,493,492,492,492,492,492,492,492, 16, 16, 16, 16, 16],
    [493,493,493,492,492,492,492,492,492,492, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "陆地"
}