main.floors.MT238=
{
    "floorId": "MT238",
    "title": "地中海",
    "name": "地中海",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "wots3.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "14,7": [
            {
                "type": "unloadEquip",
                "pos": 0
            },
            {
                "type": "unloadEquip",
                "pos": 1
            },
            {
                "type": "unloadEquip",
                "pos": 2
            },
            {
                "type": "unloadEquip",
                "pos": 3
            },
            {
                "type": "unloadEquip",
                "pos": 4
            },
            {
                "type": "unloadEquip",
                "pos": 5
            },
            {
                "type": "unloadEquip",
                "pos": 6
            },
            {
                "type": "update"
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "hideui"
            },
            {
                "type": "update"
            },
            {
                "type": "sleep",
                "time": 1000
            },
            {
                "type": "playSound",
                "name": "158-Skill02.mp3"
            },
            {
                "type": "showImage",
                "code": 1,
                "image": "win.png",
                "sloc": [
                    0,
                    0,
                    null
                ],
                "loc": [
                    -60,
                    120,
                    600,
                    240
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "scaleImage",
                "code": 1,
                "center": [
                    80,
                    160
                ],
                "scale": 0.5,
                "time": 500
            },
            {
                "type": "function",
                "function": "function(){\nvar a = core.taskSystem.checkTask(0) ? 1 : 0,\n\tb = core.taskSystem.checkTask(1) ? 1 : 0,\n\tc = core.taskSystem.checkTask(2) ? 1 : 0;\ncore.setFlag('@temp@A', a + b + c);\n}"
            },
            {
                "type": "if",
                "condition": "(temp:A>=1)",
                "true": [
                    {
                        "type": "playSound",
                        "name": "xinxinbazhe.mp3"
                    },
                    {
                        "type": "showImage",
                        "code": 2,
                        "image": "star.png",
                        "sloc": [
                            0,
                            0,
                            null
                        ],
                        "loc": [
                            15,
                            50,
                            90,
                            90
                        ],
                        "opacity": 1,
                        "time": 500
                    },
                    {
                        "type": "if",
                        "condition": "(temp:A>=2)",
                        "true": [
                            {
                                "type": "playSound",
                                "name": "xinxinbazhe.mp3"
                            },
                            {
                                "type": "showImage",
                                "code": 3,
                                "image": "star.png",
                                "sloc": [
                                    0,
                                    0,
                                    null
                                ],
                                "loc": [
                                    175,
                                    50,
                                    90,
                                    90
                                ],
                                "opacity": 1,
                                "time": 500
                            },
                            {
                                "type": "if",
                                "condition": "(temp:A>=3)",
                                "true": [
                                    {
                                        "type": "playSound",
                                        "name": "xinxinbazhe.mp3"
                                    },
                                    {
                                        "type": "showImage",
                                        "code": 4,
                                        "image": "star.png",
                                        "sloc": [
                                            0,
                                            0,
                                            null
                                        ],
                                        "loc": [
                                            325,
                                            50,
                                            90,
                                            90
                                        ],
                                        "opacity": 1,
                                        "time": 500
                                    }
                                ],
                                "false": []
                            }
                        ],
                        "false": []
                    }
                ],
                "false": []
            },
            {
                "type": "showImage",
                "code": 5,
                "image": "abstract.png",
                "loc": [
                    40,
                    480
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "moveImage",
                "code": 5,
                "to": [
                    40,
                    20
                ],
                "time": 500
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "drawTextContent",
                "text": "   通往突尼斯的所有海上航线都已被\n指挥官阁下严密封锁，从现在起，没有\n任何敌军补给能抵达突尼斯！\n   劝降单已经用运输机空投到突尼斯\n了，就看敌人能不能认清形势。那里的\n敌人就算再怎么顽强抵抗，也必然逃不\n过全军覆没的命运。",
                "left": 60,
                "top": 100,
                "align": "left",
                "fontSize": 20,
                "color": [
                    0,
                    0,
                    0,
                    1
                ]
            },
            {
                "type": "wait"
            },
            {
                "type": "clearMap"
            },
            {
                "type": "moveImage",
                "code": 5,
                "to": [
                    40,
                    480
                ],
                "time": 500
            },
            {
                "type": "hideImage",
                "code": 5,
                "time": 0
            },
            {
                "type": "sleep",
                "time": 2000
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "hideImage",
                "code": 1,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 2,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 3,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 4,
                "time": 0
            },
            {
                "type": "setHeroOpacity",
                "opacity": 0
            },
            {
                "type": "setValue",
                "name": "flag:stage",
                "value": "35"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "confirm",
                "text": "跳过剧情吗？",
                "yes": [
                    {
                        "type": "changeFloor",
                        "floorId": "MT240",
                        "loc": [
                            7,
                            7
                        ],
                        "direction": "down"
                    }
                ],
                "no": [
                    {
                        "type": "playBgm",
                        "name": "desert3.mp3"
                    },
                    "在盟军从陆海空三个维度联合收紧突尼斯的包围圈时，盟军的地面部队很快察觉到问题。",
                    "对面德意联军的防御和攻击风格与他们认识的“沙漠之狐”截然不同，很明显，对方的指挥官不是隆美尔本人。",
                    "事实上，早在隆美尔把部队全部撤回突尼斯的时候，就已经接到了撤职通知。",
                    "希特勒为他的抗命行为感到愤怒，而墨索里尼也把自己的北非占领区全部丢失归罪于隆美尔。他们一致决定以让隆美尔“回国养病”的方式，解除他的指挥权，由意大利的梅塞将军担任新的总指挥。",
                    "从撤退的那一刻起，隆美尔就知道，自己已经失宠了。这一点在他给妻子的信件中明确的写了下来。他深知，自己这次回国，便是与北非的永别。",
                    "作为“沙漠之狐”，隆美尔绝不甘心以一场惨败作为自己北非之行的收尾，于是顶着压力，打下了凯赛林隘口的大捷，也算是为自己挽回了一点声誉。在那场战役结束后不久，他就离开了北非。",
                    "美国的巴顿中将是美军装甲战领域的佼佼者，凯赛林隘口战役结束后，他接替弗雷登道尔成为第二军军长。他迫不及待想要与隆美尔来一场决斗，可直到战争结束，这个愿望也没实现。",
                    "失去隆美尔的沙漠军团就是一支失去了灵魂的部队。尽管他们仍保有极高的战斗素养，和几辆新的“虎”式坦克支援，但整体战斗力已经大打折扣，被盟军彻底瓦解只是时间问题。",
                    "隆美尔回国后，第一时间来到了东线战场。苏德两军正在那里展开血腥而残酷的交锋，希特勒也在那里视察。",
                    "听说隆美尔要回来，希特勒本打算狠狠的问责，可当隆美尔真的站在他面前时，看着自己曾经的爱将，如今在北非恶劣环境的摧残下已经羸弱不堪，不成人样时，他动摇了。那些琢磨了一晚上的粗口，最终还是咽了下去。",
                    "隆美尔离开北非，也许是件幸事。因为北非的败局已成定势，德意联军的海上退路已经被彻底切断，天上也布满了盟军的巡逻战斗机。要是再晚一些，他可能真的回不来了。",
                    "在接收到明确的投降禁令后，坚守突尼斯的德国沙漠军团，只剩下了最后的选择——死战到底。",
                    {
                        "type": "changeFloor",
                        "floorId": "MT239",
                        "loc": [
                            -1,
                            -1
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "0,7": {
            "floorId": "MT236",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 21,  3,538,538,538, 82, 22, 22, 22,  3,539,539,  3, 21, 21],
    [ 21,  3,  3,207,  3,  3,  0,384,  0,  3,  3, 81,216,360, 21],
    [ 21,383,  3,  0,360,  3,  3, 81,  3,521,384,  0,  3,  3,  3],
    [383,216, 81,  3,216,  3,  0,395,360,521,  3,360,  0, 81,396],
    [535,  3,521,  0,385,  0,521,  3,  0,518,  3,  3,255,  3,537],
    [  3,  3,  3,393,  3,539,  3,  3, 81,  3,  0,360,  0,  3,537],
    [  0,518,  3,360,  3,  3,538,537,571,  3,381,  3,  3,  3, 82],
    [ 92,255, 81,207,  3,537,  3,  3,207, 81,  0,396,331, 82, 89],
    [  0,518,  3,360,394,360,538,  3,571,  3,381,  3,  3,  3, 82],
    [  3,  3,  3,393,  3,  3,255, 82,385,  3,  0,360,  0,  3,537],
    [536,  3,518,  0,384,360,539,  3,571,  0,  3,  3,385,  3,537],
    [536,  3,  3, 82,  3,  3,539,  3,  3,395,  3,  0,  0, 81,396],
    [216, 81,  0,399,381,538,  3,  0,518,  0,  3,216,  3,  3,  3],
    [536,  3,539,539,  3,538,  3, 81,  3,  3,360,255, 82,535,535],
    [536,  3,  3,539,  3,538,  3,216, 21, 21,383,  3,  3,535,519]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}