main.floors.MT235=
{
    "floorId": "MT235",
    "title": "地中海",
    "name": "地中海",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "wots3.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,11": [
            {
                "type": "playSound",
                "name": "technology.mp3"
            },
            {
                "type": "function",
                "function": "function(){\nflags.learned[17]=true\n}"
            },
            "\t[系统提示]习得新技能：潜行",
            "\t[系统提示]潜行（60指挥点）：进入潜行状态，回避领域类伤害，并在进入战斗后额外获得1回合先攻和20%减伤。可主动解除，或在触碰地雷、进入战斗或进入下一区域时被动解除。注意：开启时或持续期间被“点杀”敌人攻击，也会被直接解除。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "0,7": {
            "floorId": "MT234",
            "loc": [
                14,
                7
            ]
        },
        "14,4": {
            "floorId": "MT236",
            "loc": [
                0,
                4
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "13,11": [
            {
                "type": "setValue",
                "name": "flag:door_MT235_12_11",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_MT235_12_11===4)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            12,
                            11
                        ]
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT235_12_11",
                        "value": "0"
                    }
                ]
            }
        ],
        "14,11": [
            {
                "type": "setValue",
                "name": "flag:door_MT235_12_11",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_MT235_12_11===4)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            12,
                            11
                        ]
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT235_12_11",
                        "value": "0"
                    }
                ]
            }
        ],
        "13,12": [
            {
                "type": "setValue",
                "name": "flag:door_MT235_12_11",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_MT235_12_11===4)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            12,
                            11
                        ]
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT235_12_11",
                        "value": "0"
                    }
                ]
            }
        ],
        "14,12": [
            {
                "type": "setValue",
                "name": "flag:door_MT235_12_11",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "if",
                "condition": "(flag:door_MT235_12_11===4)",
                "true": [
                    {
                        "type": "openDoor",
                        "loc": [
                            12,
                            11
                        ]
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_MT235_12_11",
                        "value": "0"
                    }
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "12,11": {
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 21,397,  0,  0,  3,518,518,  3,539,  3,535,  3, 21, 21, 21],
    [ 21,  3,  3,216,  3,518,518,216,234,  3,535,  3,216,  3,  3],
    [ 21,  3,207,  0,  3,  3,  3,  3, 81,  3,207,  3,397,537,537],
    [  3,  3, 82,  3,  3,538, 81,381,  0,  3, 81,  3, 81,  3,  3],
    [398,384,  0,  0,384,538,  3,  0,360,383,360,385,  0,  3, 94],
    [383,  3, 81,  3,  3,  3,  3,  3,  3,216,  3,  3,  3,  3,207],
    [  0,  3,518,  3,605,341,539,255,  3,  0, 81,381,  0,  3,216],
    [ 92,  3,518,  3,  0,  0,255,255,  3,  0,  3,  0,536, 81,360],
    [  3,  3, 81,  3,  3,  3,  3, 82,  3,216,  3,384,  3,  3,399],
    [536,360,385,240,539,  3,539,216,234,  0, 81,538,538, 81,234],
    [536,  3, 81,  3,539,385,539,  3,  0,538,  3,  3,  3,  3, 82],
    [  3,  3,216,  3,  3,  3,  3,  3,  3,  3,  3,551, 85,255,255],
    [ 22,  3,240,  3,331,332,543,542,541,540,  3,667,  3,255,255],
    [ 22,  3,  0,  3,583,  3,543,542,541,540,  3,  3,  3, 22, 21],
    [207, 81,  0,216,400,  3,543,542,541,540,  3,  3,  3,  3,  3]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}