main.floors.MT232=
{
    "floorId": "MT232",
    "title": "旗舰指挥室",
    "name": "旗舰指挥室",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "cao6.mp3",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:dry",
            "value": "false"
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showui"
        },
        {
            "type": "playSound",
            "name": "technology.mp3"
        },
        {
            "type": "function",
            "function": "function(){\nflags.learned[16]=true\n}"
        },
        "\t[系统提示]习得新技能：海上霸主",
        "\t[系统提示]\f[skill16.jpg,90,50]海上霸主（1000指挥点）：只能在海上使用且必须装备着航空母舰。使用后，派出舰载机发动空袭，使全图除潜艇外的敌方海军受到5倍攻击力和2倍雷击值的伤害（可致死并获得金经），同时我方损失等同于20%血限的hp。每张地图仅限使用一次，boss层无效。（温馨提示：本技能使用后需要遍历地图上所有敌人以计算伤害，可能会卡顿一段时间）",
        "\t[历史来源]\f[skill16.jpg,90,50]在二战开始前，海战始终以战列舰这样的“大舰巨炮”为核心。航空母舰作为新兴力量起初并不受重视，而《华盛顿海军条约》限制了一战后各国的战列舰吨位，间接为航母创造了发展空间。珍珠港事件后，美国太平洋舰队全部的战列舰或沉或伤，航母便担负起了战争初期美军的海上主力，并在珊瑚海、中途岛、瓜岛等一系列关键战役中证明了自身的价值。到了二战中期，航母已经彻底改写了海战的规则，完完全全地成为了新一代“海上霸主”。而战列舰转而负责防空护航、对岸炮击、夜间近距离海战等任务。随着航母舰载机夜战能力和导弹技术的进步，战列舰已经没有任何应用价值，并逐渐退出历史舞台。",
        {
            "type": "function",
            "function": "function(){\nflags.航母炸过的楼层 = {}\n}"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,7": [
            "\t[海军参谋,N515]长官，所有军舰待命中！",
            {
                "type": "insert",
                "name": "选择战舰"
            }
        ],
        "12,7": [
            "\t[机场后勤,N516]长官，我方空军已就绪！",
            {
                "type": "insert",
                "name": "选择飞机"
            }
        ],
        "7,12": [
            "\t[参谋,N517]长官，请下达指示！",
            "\t[系统提示]即将进入存档界面",
            {
                "type": "callSave"
            },
            {
                "type": "insert",
                "name": "选择技能"
            },
            {
                "type": "choices",
                "text": "是否立即前往战场？",
                "choices": [
                    {
                        "text": "还没准备好",
                        "action": []
                    },
                    {
                        "text": "现在出发",
                        "action": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    0,
                                    0,
                                    0,
                                    1
                                ],
                                "time": 500,
                                "keep": true
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT233",
                                "loc": [
                                    0,
                                    7
                                ],
                                "direction": "right"
                            }
                        ]
                    }
                ]
            }
        ],
        "4,1": [
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]当前区域敌人特点：大量海空军，存在战列舰。\n推荐携带技能：空战王牌、Z字规避、扫雷、破译、从海底出击、补给线、海上霸主（有航母的带）\n推荐出战装备：V级驱逐舰、克利夫兰级巡洋舰、光辉号航母、P47雷电、P38闪电、B25米切尔。",
            "可以在此清空技能槽，以便于玩家重新选择技能",
            {
                "type": "confirm",
                "text": "清空技能槽？",
                "yes": [
                    {
                        "type": "function",
                        "function": "function(){\nflags.skillList=[0,0,0,0,0,0,0]\n}"
                    }
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [30243,30576,30577,30577,30577,30577,30577,30577,30577,30577,30577,30577,30577,30578,30243],
    [30251,30584,30585,30585,30585,30585,30585,30585,30585,30585,30585,30585,30585,30586,30251],
    [30251,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30251],
    [30251,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30251],
    [30251,  0,  0,10136,10137,10137,10137,10137,10137,10137,10137,10138,  0,  0,30251],
    [30251,  0,  0,10144,10145,10145,10145,10145,10145,10145,10145,10146,  0,  0,30251],
    [30251,  0,  0,10144,10145,10145,10145,10145,10145,10145,10145,10146,  0,  0,30251],
    [30251,  0,515,10144,10145,10145,10145,10145,10145,10145,10145,10146,516,  0,30251],
    [30251,  0,  0,10144,10145,10145,10145,10145,10145,10145,10145,10146,  0,  0,30251],
    [30251,  0,  0,10144,10145,10145,10145,10145,10145,10145,10145,10146,  0,  0,30251],
    [30251,  0,  0,10144,10145,10145,10145,10145,10145,10145,10145,10146,  0,  0,30251],
    [30251,  0,  0,10144,10145,10145,10145,10145,10145,10145,10145,10146,  0,  0,30251],
    [30251,  0,  0,  0,  0,  0,  0,517,  0,  0,  0,  0,  0,  0,30251],
    [30251,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30251],
    [30259,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30259]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,559,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,90440,  0,  0,  0,  0,  0,  0,  0,  0,  0,90440,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,558,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,557,  0],
    [  0,  0,90440,  0,  0,  0,  0,  0,  0,  0,  0,  0,90440,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,90440,  0,  0,  0,  0,  0,  0,  0,  0,  0,90440,  0,  0],
    [  0,  0,  0,10152,10153,10153,10153,10153,10153,10153,10153,10154,  0,  0,  0],
    [  0,  0,  0,  0,90440,  0,  0,90440,  0,  0,90440,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,559,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,90914,  0,  0,30749,30750,30751,  0,  0,90915,  0,  0,  0],
    [  0,  0,  0,90922,10163,  0,30757,30758,30759,  0,  0,90923,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,80620,  0,80678,  0,80620,  0,  0,  0,80620,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,80622,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,80620,  0,  0,90932,90933,  0,  0,  0,80620,  0,  0,  0],
    [  0,  0,  0,  0,  0,80678,90940,90941,  0,80678,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,80620,  0,80678,  0,  0,  0,  0,  0,80620,  0,  0,  0],
    [  0,  0,  0,  0,  0,80620,  0,80620,  0,80620,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "海洋"
}