main.floors.MT262=
{
    "floorId": "MT262",
    "title": "那不勒斯",
    "name": "那不勒斯",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "bgm5.mp3",
    "firstArrive": [
        {
            "type": "text",
            "text": "\t[克拉克]\f[clark.png,0,310]敌人切断了我们与友军的联系，他们的部队甚至逼近了我的司令部！撤回海滩，必要情况下，从海上撤退！",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[艾森豪威尔]\f[eisenhower.png,0,310]用登陆艇接应地面部队撤离，无论是从技术上还是从战术上讲都是不可行的！坚持住，我会派遣战列舰和轰炸机支援你们！",
            "pos": [
                100,
                300,
                380
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,4": [
            {
                "type": "playSound",
                "name": "technology.mp3"
            },
            {
                "type": "function",
                "function": "function(){\nflags.learned[18]=true\n}"
            },
            "\t[系统提示]习得新技能：孟菲斯美女号",
            "\t[系统提示]\f[skill18.jpg,90,50]孟菲斯美女号（200指挥点）：下一场战斗中，友军不会受到任何伤害，且战斗伤害减少25%。",
            "\t[历史来源]\f[skill18.jpg,90,50]“孟菲斯美女号”是一架B17轰炸机的名字。在二战中期，盟军轰炸机组在执行对德本土轰炸任务时，常常因缺少护航战斗机而损失惨重，令机组成员们谈之色变。为此，美国陆军第八航空队出了一条规定：完成25次轰炸任务就能除役回家。但实际上，战争的残酷远超人们想象，绝大多数飞机连5次任务都完不成，就在敌人的领地上机毁人亡。整场战争下来，数千架轰炸机中只有3架飞机完成了25次任务（其中一架还在最后一次返航途中坠毁，机组全员阵亡），而“孟菲斯美女”号是其中最后一个完成（1943年5月17日），但却是唯一一个没有机组人员死亡的。为纪念这架被幸运女神眷顾的传奇轰炸机，1990年，它的故事被改编成了电影，名字就叫《孟菲斯美女号》。而飞机本体目前被安置在俄亥俄州美国空军国家博物馆。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "14,11": {
            "floorId": "MT261",
            "loc": [
                0,
                11
            ]
        },
        "14,3": {
            "floorId": "MT263",
            "loc": [
                0,
                3
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [540,540, 20,519,519,227,519,519, 20,541,147,147,  0,250,580],
    [ 20,227, 20, 20, 20, 82, 20, 20, 20,541,147, 11,227,152,390],
    [541,  0, 11,250, 20, 81, 20,605,410,541,147, 81,152,152,152],
    [ 20, 20, 20,  0, 81,265,  0, 11,147,218,147,  0,266,372, 94],
    [551, 20,218,147,147,147,147, 81,147,147,147, 11,152,152,152],
    [270, 20,  0,518,388,147,605,  0, 11,  0,147,266,152,542,272],
    [270, 20,235,147,147,147,632,147,147,265,147,  0, 81,632,542],
    [390, 82,  0, 11,147,390,390,147,523,523, 82,235,152,152,152],
    [ 20, 20, 20,542,147,410,147,147,410,152,152, 11,152,543,272],
    [523,410, 81,250,147,  0, 81,  0,  0,590,152,  0, 81,632,543],
    [540,523, 20, 11,369,  0,149,265,152,152,152,369,152,152,152],
    [ 20, 20, 20, 20,632, 11,149,544,544,544,152, 11,265,  0, 94],
    [ 22, 22, 20,  0, 81,149,149,149,149,  0,152,152, 81,152,152],
    [410, 20, 20,250,149, 22,149,  0, 81,265,152,218,266,580,580],
    [  0, 81, 11,  0,149, 22,410, 11,149,543,152,152,152,152,152]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}