main.floors.MT27=
{
    "floorId": "MT27",
    "title": "英吉利海峡",
    "name": "英吉利海峡",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "europe1.mp3",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:escort",
            "value": "true"
        },
        {
            "type": "setValue",
            "name": "flag:友军血量",
            "value": "100000"
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\r[yellow]Mission 5  海上撤退",
        {
            "type": "text",
            "text": "\t[道丁]\f[dowdin.png,0,310]敌人对我们的船队发起了大规模袭击！指挥官阁下，所有皇家海军和空军的指挥权都已交给你，务必保护好我们撤退的船队！",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[赫尔曼·戈林]\f[gorlin.png,0,310]敌人的陆军在船上是非常脆弱的。我们没能阻止他们上船，但现在是将他们一举击沉的好机会！所有飞机，开始自由攻击！",
            "pos": [
                100,
                300,
                380
            ]
        },
        "\t[系统提示]敌人战力重置中",
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "hp",
            "value": "1000"
        },
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "atk",
            "value": "200"
        },
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "special",
            "value": "[6,28]"
        },
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "n",
            "value": "3"
        },
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "bom",
            "value": "300"
        },
        {
            "type": "setEnemy",
            "id": "me110c",
            "name": "hp",
            "value": "1500"
        },
        {
            "type": "setEnemy",
            "id": "me110c",
            "name": "atk",
            "value": "240"
        },
        {
            "type": "setEnemy",
            "id": "me110c",
            "name": "bom",
            "value": "300"
        },
        {
            "type": "setEnemy",
            "id": "ju87b",
            "name": "hp",
            "value": "1350"
        },
        {
            "type": "setEnemy",
            "id": "u7",
            "name": "hp",
            "value": "100"
        },
        {
            "type": "setEnemy",
            "id": "u7",
            "name": "top",
            "value": "2000"
        },
        {
            "type": "setEnemy",
            "id": "u7",
            "name": "tpn",
            "value": "4"
        },
        "\t[系统提示]敌人战力重置完成",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]特殊任务：护航战 规则说明",
        "\t[系统提示]在护航战中，状态栏里会有一项“友军”血量值，该数值为受保护目标的血量，无法以任何形式增加，若“友军”血量值清零，任务立即失败。（相当于新新魔塔2的公主，但不能补充血量）",
        "\t[系统提示]战斗期间，主角和友军会同时受到敌人的攻击，其中主角受到的40%伤害会同时算作友军承受的伤害。换言之，主角受到的伤害不变，其中的40%会被计入对友军的伤害。",
        "\t[系统提示]因此，护航战模式下，主角应尽可能避免过多接触强敌，且尽可能多的使用技能减少伤害。毕竟自己的血量可以通过血瓶来恢复，但友军的血量一旦损失，就再无恢复的可能。",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐通过当前区域\n⭐友军剩余血量不少于50000\n⭐击落所有JU-87“斯图卡”俯冲轰炸机",
        {
            "type": "callBook"
        },
        {
            "type": "setValue",
            "name": "flag:第五关通关",
            "value": "0"
        },
        {
            "type": "setTask",
            "name": "第五关任务1",
            "n": 1,
            "text": "通过当前区域",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "第五关通关",
                    "operator": "=",
                    "text": "抵达终点",
                    "count": "1"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第五关任务2",
            "n": 1,
            "text": "友军剩余血量多于50000",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "友军血量",
                    "operator": ">=",
                    "text": "友军血量剩余",
                    "count": "50000"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第五关任务3",
            "n": 1,
            "text": "击落所有JU-87“斯图卡”俯冲轰炸机",
            "info": [
                {
                    "type": "checkBlock",
                    "checkBlock": "ju87b",
                    "floorId": [
                        "MT27",
                        "MT28",
                        "MT29",
                        "MT30",
                        "MT31"
                    ],
                    "operator": "<=",
                    "text": "“斯图卡”轰炸机剩余",
                    "count": 0
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,3": [
            "\f[uboat.png,90,50]U型潜艇特指在第一次和第二次世界大战中，德国潜艇的总称（德语Untersee-boot，英文U-boat）。由于德国的水面舰艇实力无法与英国皇家海军抗衡，潜伏在水中而不易被察觉的U艇就顺理成章的成为了德国在大西洋海战中的主力。二战期间，U艇借助德国海军上将卡尔·邓尼茨发明的狼群战术，击沉了数以千计的盟军商船，甚至还有不少包括战列舰和航空母舰在内的军舰，直到1943年后，盟军的反潜技术取得重大突破，U艇的威胁才大大减小。"
        ],
        "4,0": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]由于是第一次进行护航战任务，本关设定的所有敌人伤害加起来也不会使友军血量清零，但为了省一些血，该开的技能还是要开的！另外，本关出现的敌方鱼雷轰炸机是可以踩到临界的，建议在积攒足够的攻击力之前，绕开他们！"
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT28",
            "loc": [
                7,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "7,3": [
            {
                "type": "if",
                "condition": "(flag:hard===1)",
                "true": [
                    "\t[系统提示]检测到当前为“神剧难度”，获得10瓶下午茶、1000血限和血量、500指挥点数、500黄金",
                    {
                        "type": "setValue",
                        "name": "item:tea",
                        "operator": "+=",
                        "value": "10"
                    },
                    {
                        "type": "setValue",
                        "name": "status:hpmax",
                        "operator": "+=",
                        "value": "1000"
                    },
                    {
                        "type": "setValue",
                        "name": "status:hp",
                        "operator": "+=",
                        "value": "1000"
                    },
                    {
                        "type": "setValue",
                        "name": "status:mana",
                        "operator": "+=",
                        "value": "500"
                    },
                    {
                        "type": "setValue",
                        "name": "status:money",
                        "operator": "+=",
                        "value": "500"
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(flag:hard===2)",
                "true": [
                    "\t[系统提示]检测到当前为“街机难度”，获得100指挥点数、100黄金",
                    {
                        "type": "setValue",
                        "name": "status:mana",
                        "operator": "+=",
                        "value": "100"
                    },
                    {
                        "type": "setValue",
                        "name": "status:money",
                        "operator": "+=",
                        "value": "100"
                    }
                ]
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 29, 29,  3,347,601, 34, 21,  0, 21, 34,  3, 27, 27, 27, 27],
    [ 21,  3,  3,347,  3, 33, 22,  0, 22, 33,  3,  3,  3,  3,207],
    [ 29, 29,  3, 21,  3, 34, 21,  0, 21, 34,  3, 28, 28, 28, 28],
    [  3,206,  3,  0, 82,  3,  3, 86,  3,  3,  3,382,  3,  3,  3],
    [  0,  0,  3,216,  0,  3,  0,  0,  0,  0,207,  0, 28,  3, 22],
    [ 81,  3,  3,  0,  0, 81,205,  3,206,  3,  3,  3,  0,  3, 32],
    [ 28, 28,207,  0,  3,  3,  0,  3,  0,  0,205,  0,207,  3, 32],
    [  3,  3,  3,518,  3, 30, 28,  3, 28, 30,  3, 81,  0,  3,207],
    [ 32,205,  0,  0,205,  0, 31,383, 31,  3,  3,  3,  0,  3, 81],
    [ 29,  3, 81,  3,  3,  3,  3, 30,  3,  3,520,  0,  0, 81, 28],
    [ 30,  3,  0,  0,207,  0,  3,  3,  3, 22,  3,  0,  3, 28, 28],
    [  3,  3, 81,  3,  3,  0,518,518,518,  0, 81,207,  3,  3,  3],
    [  0,382,  0,382,  3,  0,  3,216,  3,  0,  3,345,345,345,345],
    [  0,  3,  3,345,  3,206, 82,518, 82,206,  3,  3,  3,  3, 82],
    [ 21, 21,  3,345,  3, 21,  3, 93,  3, 21,  3, 21, 21, 21, 21]
],
    "bgmap": [
    [ 16, 16, 16, 16,  3, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,10163,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "海洋"
}