main.floors.MT288=
{
    "floorId": "MT288",
    "title": "卡西诺山-5",
    "name": "卡西诺山-5",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X100052",
    "bgm": "bgm6.mp3",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:第39关任务2",
            "value": "1"
        },
        {
            "type": "if",
            "condition": "(flag:修道院!==true)",
            "true": [
                {
                    "type": "choices",
                    "text": "\t[是否跳过剧情？]以下剧情涉及到接下来的选择，初次观看建议不要跳过",
                    "choices": [
                        {
                            "text": "跳过",
                            "action": []
                        },
                        {
                            "text": "不跳过",
                            "action": [
                                {
                                    "type": "setCurtain",
                                    "color": [
                                        0,
                                        0,
                                        0,
                                        1
                                    ],
                                    "time": 500,
                                    "keep": true
                                },
                                "在卡西诺山的山顶上，伫立着一座修道院——圣本笃修道院。",
                                "这座修道院对于西方国家而言是一座文物，历史悠久，是基督教最神圣的地方之一。即便基督教产生了许多分支，但它们都对修道院本身以及建立修道院的圣本笃本人十分尊崇，何况修道院下就埋着他的遗体。对于信奉基督教的欧洲国家和美国而言，它的重要性不言而喻。",
                                "因此，早在卡西诺山战役打响之前，德军和盟军就作出约定：\r[yellow]德军不会在圣本笃修道院内进行驻军以及进行其他军事用途，盟军也不会炸毁它\r，双方共同守护这一珍贵的物质文化遗产，当然更重要的是，\r[yellow]谁不小心破坏了它，谁就在舆论和道德上占了下风\r。",
                                "然而，匹夫无罪，怀璧其罪。圣本笃修道院的地理位置实在太好了，可以俯瞰整个卡西诺山，一旦用于军事，无论是\r[yellow]给炮兵提供观察哨还是狙击手用于伏击，抑或是改造成堡垒，甚至单纯只是放个士兵去透过窗户侦察敌情，都能给盟军造成不小麻烦\r。所以双方嘴上这么说，实际上都对其虎视眈眈。",
                                "盟军高层陷入了猜疑：德军真的会乖乖信守承诺，不利用修道院吗？再加上近期，\r[yellow]德军的炮火落点似乎非常精准，有士兵报告称自己的战友被狙击手射杀，在修道院的窗户上发现望远镜闪光，以及从修道院附近传来轻武器射击声音\r。",
                                "一位新西兰将军称，修道院必须被炸毁，其他都不重要。如果在一座历史文物和我军的生命之间做出选择，那么显然后者更重要。",
                                {
                                    "type": "setCurtain",
                                    "time": 500
                                }
                            ]
                        }
                    ]
                },
                {
                    "type": "choices",
                    "text": "\t[突发事件]是否空袭炸毁圣本笃修道院？",
                    "choices": [
                        {
                            "text": "给劳资炸！",
                            "action": [
                                "空袭将修道院夷为平地。但事实证明，那里没有任何德军，只有基督教徒和平民。",
                                "盟军的行为引起了国际社会的不满，并且德军现在可以名正言顺的将那里的残垣断壁挪作炮兵观察哨和狙击手掩体。从现在起，当前区域领域类伤害增加，且每次战后会被狙击手攻击一次。",
                                {
                                    "type": "setEnemy",
                                    "id": "mortar",
                                    "name": "zone",
                                    "value": "20000",
                                    "norefresh": true
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "pak40",
                                    "name": "zone",
                                    "value": "25000",
                                    "norefresh": true
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "howitzer150",
                                    "name": "zone",
                                    "value": "15000",
                                    "norefresh": true
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "flak88",
                                    "name": "zone",
                                    "value": "30000",
                                    "norefresh": true
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "gunbunker",
                                    "name": "zone",
                                    "value": "15000",
                                    "norefresh": true
                                },
                                {
                                    "type": "setValue",
                                    "name": "flag:摧毁修道院",
                                    "value": "true"
                                }
                            ]
                        },
                        {
                            "text": "继续观望",
                            "action": [
                                "无事发生"
                            ]
                        }
                    ]
                },
                {
                    "type": "setValue",
                    "name": "flag:修道院",
                    "value": "true"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,13": [
            {
                "type": "playSound",
                "name": "floor.mp3"
            },
            {
                "type": "setHeroOpacity",
                "opacity": 0,
                "time": 500
            },
            {
                "type": "moveHero",
                "time": 50,
                "steps": [
                    "up:3"
                ]
            },
            {
                "type": "setHeroOpacity",
                "opacity": 1,
                "time": 500
            }
        ],
        "7,10": [
            {
                "type": "playSound",
                "name": "floor.mp3"
            },
            {
                "type": "setHeroOpacity",
                "opacity": 0,
                "time": 500
            },
            {
                "type": "moveHero",
                "time": 50,
                "steps": [
                    "down:3"
                ]
            },
            {
                "type": "setHeroOpacity",
                "opacity": 1,
                "time": 500
            }
        ]
    },
    "changeFloor": {
        "1,14": {
            "floorId": "MT286",
            "loc": [
                1,
                0
            ]
        },
        "7,14": {
            "floorId": "MT286",
            "loc": [
                7,
                0
            ]
        },
        "13,14": {
            "floorId": "MT286",
            "loc": [
                13,
                0
            ]
        },
        "14,11": {
            "floorId": "MT289",
            "loc": [
                0,
                11
            ]
        },
        "14,7": {
            "floorId": "MT289",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {
        "7,12": [
            "down"
        ],
        "7,11": [
            "up"
        ],
        "6,12": [
            "down"
        ],
        "5,12": [
            "down"
        ],
        "4,12": [
            "down"
        ],
        "8,12": [
            "down"
        ],
        "9,12": [
            "down"
        ],
        "10,12": [
            "down"
        ],
        "11,13": [
            "down",
            "left"
        ],
        "3,13": [
            "down",
            "right"
        ],
        "2,14": [
            "right"
        ],
        "4,11": [
            "up"
        ],
        "0,11": [
            "up"
        ],
        "1,11": [
            "up"
        ],
        "2,11": [
            "up"
        ],
        "3,11": [
            "up"
        ],
        "5,11": [
            "up"
        ],
        "6,11": [
            "up"
        ],
        "8,11": [
            "up"
        ],
        "9,11": [
            "up"
        ],
        "10,11": [
            "up"
        ],
        "11,10": [
            "up",
            "left"
        ],
        "12,10": [
            "up"
        ],
        "13,10": [
            "up"
        ],
        "14,10": [
            "up"
        ],
        "12,14": [
            "left"
        ],
        "12,0": [
            "up",
            "left"
        ],
        "12,1": [
            "left"
        ],
        "12,2": [
            "down",
            "left"
        ],
        "13,2": [
            "down"
        ],
        "14,2": [
            "down",
            "right"
        ],
        "13,0": [
            "up"
        ],
        "14,0": [
            "up",
            "right"
        ],
        "14,1": [
            "right"
        ]
    },
    "cannotMoveIn": {
        "7,12": [
            "down"
        ],
        "7,11": [
            "up"
        ],
        "6,12": [
            "down"
        ],
        "5,12": [
            "down"
        ],
        "4,12": [
            "down"
        ],
        "8,12": [
            "down"
        ],
        "9,12": [
            "down"
        ],
        "10,12": [
            "down"
        ],
        "11,13": [
            "down",
            "left"
        ],
        "3,13": [
            "down",
            "right"
        ],
        "2,14": [
            "right"
        ],
        "4,11": [
            "up"
        ],
        "1,11": [
            "up"
        ],
        "0,11": [
            "up"
        ],
        "2,11": [
            "up"
        ],
        "3,11": [
            "up"
        ],
        "5,11": [
            "up"
        ],
        "6,11": [
            "up"
        ],
        "8,11": [
            "up"
        ],
        "9,11": [
            "up"
        ],
        "10,11": [
            "up"
        ],
        "11,10": [
            "up",
            "left"
        ],
        "12,14": [
            "left"
        ],
        "14,10": [
            "up"
        ],
        "13,10": [
            "up"
        ],
        "12,10": [
            "up"
        ],
        "12,0": [
            "up",
            "left"
        ],
        "12,1": [
            "left"
        ],
        "12,2": [
            "down",
            "left"
        ],
        "13,2": [
            "down"
        ],
        "14,2": [
            "down",
            "right"
        ],
        "13,0": [
            "up"
        ],
        "14,0": [
            "up",
            "right"
        ],
        "14,1": [
            "right"
        ]
    },
    "map": [
    [ 21,372,632,351, 22, 22, 11,265,542,351,351,543,204,  0,390],
    [ 21,351, 11,351,351,265,351,542,351,543,543,543,  0,388,  0],
    [351,351, 81,543,351, 11, 81,351, 21,266,351,351,  0,  0,  0],
    [540,540,351,543,  0,351, 21,351,351, 81,265, 21,100081,100082,100083],
    [351,244,351,351,244, 81,204,351, 21,203,351,204,351, 21, 21],
    [542, 11,244,218,351,351,541, 11,351, 11,203,351,203,372, 21],
    [542,351, 21,351,541,541,351,541,203,351,542,351, 81,351,351],
    [351,351, 82,351,372,351,351,351, 11,351,542, 11, 82,233, 94],
    [244, 81,203, 21,265,541, 11,203, 11, 81,265,351, 11,351,351],
    [540,351,351, 11,351,541,351, 81,351,542,244,351,203,  0,540],
    [540,351,540,244,540,351, 21,  0, 21,351,542,  0,351,605,605],
    [227, 81,  0,266,  0,590,218,  0,218,590,  0,266,351,351, 94],
    [605,351, 11,351,  0,204,  0,  0,  0,204,  0,632, 81,390, 11],
    [248,351,233,  0,519,351,540,  0,540,351,519,  0, 11,351,351],
    [351, 93,390,100075,541, 11,203, 93,203, 11,541,100073,  0, 93,248]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100049,100050,100051],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100057,  0,100059],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100065,100066,100067],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,556,  0,  0,  0,100049,100050,100050,100050],
    [100049,100050,100050,100050,100050,100050,100050,100050,100050,100050,100050,  0,  0,  0,  0],
    [100057,  0,  0,  0,100066,100066,100066,100066,100066,100066,100066,  0,  0,  0,  0],
    [100057,  0,  0,100067,  0,  0,  0,559,  0,  0,  0,100065,  0,  0,  0],
    [100057,  0,100059,  0,  0,  0,  0,  0,  0,  0,  0,  0,100057,  0,  0]
],
    "fgmap": [

],
    "area": "陆地"
}