main.floors.MT293=
{
    "floorId": "MT293",
    "title": "卡西诺山-10",
    "name": "卡西诺山-10",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X100052",
    "bgm": "bgm6.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,0": [
            {
                "type": "setValue",
                "name": "flag:咒",
                "value": "false"
            },
            {
                "type": "update"
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "hideui"
            },
            {
                "type": "update"
            },
            {
                "type": "sleep",
                "time": 1000
            },
            {
                "type": "playSound",
                "name": "158-Skill02.mp3"
            },
            {
                "type": "showImage",
                "code": 1,
                "image": "win.png",
                "sloc": [
                    0,
                    0,
                    null
                ],
                "loc": [
                    -60,
                    120,
                    600,
                    240
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "scaleImage",
                "code": 1,
                "center": [
                    80,
                    160
                ],
                "scale": 0.5,
                "time": 500
            },
            {
                "type": "function",
                "function": "function(){\nvar a = core.taskSystem.checkTask(0) ? 1 : 0,\n\tb = core.taskSystem.checkTask(1) ? 1 : 0,\n\tc = core.taskSystem.checkTask(2) ? 1 : 0;\ncore.setFlag('@temp@A', a + b + c);\n}"
            },
            {
                "type": "if",
                "condition": "(temp:A>=1)",
                "true": [
                    {
                        "type": "playSound",
                        "name": "xinxinbazhe.mp3"
                    },
                    {
                        "type": "showImage",
                        "code": 2,
                        "image": "star.png",
                        "sloc": [
                            0,
                            0,
                            null
                        ],
                        "loc": [
                            15,
                            50,
                            90,
                            90
                        ],
                        "opacity": 1,
                        "time": 500
                    },
                    {
                        "type": "if",
                        "condition": "(temp:A>=2)",
                        "true": [
                            {
                                "type": "playSound",
                                "name": "xinxinbazhe.mp3"
                            },
                            {
                                "type": "showImage",
                                "code": 3,
                                "image": "star.png",
                                "sloc": [
                                    0,
                                    0,
                                    null
                                ],
                                "loc": [
                                    175,
                                    50,
                                    90,
                                    90
                                ],
                                "opacity": 1,
                                "time": 500
                            },
                            {
                                "type": "if",
                                "condition": "(temp:A>=3)",
                                "true": [
                                    {
                                        "type": "playSound",
                                        "name": "xinxinbazhe.mp3"
                                    },
                                    {
                                        "type": "showImage",
                                        "code": 4,
                                        "image": "star.png",
                                        "sloc": [
                                            0,
                                            0,
                                            null
                                        ],
                                        "loc": [
                                            325,
                                            50,
                                            90,
                                            90
                                        ],
                                        "opacity": 1,
                                        "time": 500
                                    }
                                ],
                                "false": []
                            }
                        ],
                        "false": []
                    }
                ],
                "false": []
            },
            {
                "type": "showImage",
                "code": 5,
                "image": "abstract.png",
                "loc": [
                    40,
                    480
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "moveImage",
                "code": 5,
                "to": [
                    40,
                    20
                ],
                "time": 500
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "drawTextContent",
                "text": "   卡西诺山地区的战事仍在平稳推进\n。我军损失很小，克拉克将军预计，我\n们很快就能彻底结束这场战役。\n   德军的顽强抵抗不是问题，我们完\n全能够处理。只不过友军的进度不太理\n想，他们应当反思为什么没有配合好我\n军的行动！至于那座修道院？完全是个\n意外，一定是德军做了些什么欺骗行动\n好让我们误炸！\n（这份简报似乎是在克拉克的要求下写\n的）",
                "left": 60,
                "top": 100,
                "align": "left",
                "fontSize": 20,
                "color": [
                    0,
                    0,
                    0,
                    1
                ]
            },
            {
                "type": "wait"
            },
            {
                "type": "clearMap"
            },
            {
                "type": "submitTask"
            },
            {
                "type": "moveImage",
                "code": 5,
                "to": [
                    40,
                    480
                ],
                "time": 500
            },
            {
                "type": "hideImage",
                "code": 5,
                "time": 0
            },
            {
                "type": "sleep",
                "time": 2000
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "hideImage",
                "code": 1,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 2,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 3,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 4,
                "time": 0
            },
            {
                "type": "setHeroOpacity",
                "opacity": 0
            },
            {
                "type": "setValue",
                "name": "flag:stage",
                "value": "41"
            },
            {
                "type": "confirm",
                "text": "跳过剧情吗？",
                "yes": [
                    {
                        "type": "changeFloor",
                        "floorId": "MT295",
                        "loc": [
                            7,
                            11
                        ],
                        "direction": "down"
                    }
                ],
                "no": [
                    "1944年1月17日，第一次卡西诺战役打响。这一次，作战最为凶猛的盟军部队，是一直不被看好的法军和波兰军队。",
                    "法军部队中，许多都是阿尔及利亚等殖民地招来的士兵，他们是天生的山地战能手。顶着德军的机枪大炮，这些来自外地的勇士们将恐惧抛诸脑后，一边疯狂射击，一边冲向德军阵地，一度与敌人发生血腥的白刃战。",
                    "法军战斗过的地方，一片狼藉。许多尸骸甚至不完整，浑身上下遍布刀伤甚至咬痕，甚至肢体都不翼而飞，给战地记者留下了深刻的印象。当然，他们自身也伤亡惨重。",
                    "波兰军队也将国家分裂的悲痛化作战力。纵使身在异国他乡，接受外国将领的指挥，但他们仍然愿意为了歼灭敌人而献出自己的生命。两支经受了“国破家亡”之痛的军队，在这片血腥战场上展现出最惊人的战斗意志。",
                    "但德军也不是软柿子。镇守卡西诺山的德军虽然人数处于劣势，但这些人要么是被称作“雅利安超人”的伞兵部队，要么就是久经沙场，虽不成编制，却个个以一敌十的老兵们。",
                    "德军和法军、波军激烈交锋，许多阵地反复易手，尸骸堆积成山。最终，盟军一方成功推进了一段距离，法军只需要再获得一个师的增援，就能完成对德军的包抄了。",
                    "另一端的英军也不甘示弱。虽然战力远不及法国和波兰，也付出了惨痛伤亡，但他们仍然艰难推进了几个山头，夺取能够俯瞰美军正面攻击方向的高地。如果美军此时及时分兵增援，建立桥头堡，那之后不仅有机会侧翼突破，还能给正面攻击的部队提供火力掩护。",
                    "可回到负责正面主攻的美军这边，他们接到的任务是硬冲德军高地，强渡拉皮多河。强渡河流作战，进攻方必然劣势，通常只在万不得已或是有特殊计划的时候才会这样做，那是军事能力最硬的指挥官才有把握打的仗。同时，山地战也是美军的弱项，何况是直冲对面枪口。",
                    "是个明眼人都看得出这是个自杀式举动。不仅第36师师长沃克将军，许多前线军官甚至小队长都意识到，这将是一次有去无回的行动，但军令如山，他们除了服从命令，别无选择。沃克在日记中写道：我不知道如何才能成功，我已经做好了失败的准备。",
                    "渡河当天，士兵们看到了自家长官眼神中掩饰不住的悲痛和惋惜，很快明白了事情的严重性，但他们仍然选择了冲锋。那一天，河水被染的鲜红，皮划艇一艘接一艘倾覆，浮桥一次又一次被炸断，即便侥幸过河的士兵也在硝烟中迷路闯进雷区。",
                    "但德军防线却岿然不动，德军第10集团军司令菲廷霍夫甚至都没有意识到这是美军的主攻部队，还以为这是一次武力侦察。美国报纸则称这次渡河是“自珍珠港事件以来最严重的灾难”。一位新西兰将军评价：在这次行动中，他们这些美军，除了勇气，就没有什么事做对了。",
                    "而造就这一惨状的，除了在河对岸架好机枪严阵以待的德军外，美军的指挥官克拉克上将更是难逃其责。他太想打出自己的名号了，除此之外，大局也好，士兵们的生命也罢，他统统不在乎。他甚至早就知道渡河行动将带来巨大损失，也知道如果美军及时向英法提供增援会有很大收益，但他不在乎。他只想告诉媒体：意大利战役的成功，属于他一人。",
                    "盟军意大利地区最高司令，哈罗德·亚历山大，注意到了美军的低沉士气。他让参谋前去调查情况。而后，参谋返回的报告称道：士气逐渐恶化，军队灰心丧气，几乎叛变。于是，亚历山大打算，如果卡西诺再久攻不下，就让新西兰和印度军队支援美军。",
                    "但在克拉克眼里，接受他国援助无疑是在折损美军和他自己的威望。于是他一边逼迫部队进攻，一边给亚历山大回复：目前的迹象表明，卡西诺高地很快会被占领。他甚至还对丘吉尔说：我对在这一地区取得突破有很大希望。媒体也被他骗了，《泰晤士报》开始宣称：卡西诺战役即将结束。这些坐在办公室的人根本看不到前线的血肉横飞，自然也没看出来这是个离谱到家的谎言。",
                    "也许战报会撒谎，但阵线不会。卡西诺地区已经成了一台绞肉机，美军自不必说，德军为数不多的守备部队同样也在美军不要命的冲锋下逐渐减少。于是，双方在2月14日（情人节）当天安排了2小时不稳定休战，稍作喘息。",
                    "而这，仅仅是第一次罗马战役的落幕。后续的几次战役，也依旧会是同样的“绞肉机”战役。",
                    "意大利的战事将持续很长时间都不会有结果，克拉克的功利心仍将不停的吞噬盟军战士们的生命，却唯独不会影响他本人，他甚至还能逐步升迁，获得威望。最终，他将如自己所愿的，踩着用士兵们的血肉铺成的红毯进入罗马，迎接媒体镜头的贴脸特写——他是个成功的政客，同时也绝对是个极度失格的将军。",
                    "9年后，他将在地球的另一端，在同样的地形中指挥战斗。但那一次，不再是正义的反法西斯战争，而是罪恶的侵略战争，他将被另一支英勇无畏的人民军队彻底击败。他将签下令自己倍感耻辱的停战协定，失去他最想要的名望。",
                    {
                        "type": "sleep",
                        "time": 500
                    },
                    "视角转向欧洲。盟军在这里暂时还没有发生地面战斗，天空仍然是主战场。",
                    "盟军的飞机数量占据着优势地位，但由于缺少长途护航战斗机，他们无法深入德军腹地，对重要的工业区展开有效轰炸。几次尝试均以令人难以接受的惨痛损失告终。",
                    "然而，当一批崭新的银白色战斗机从海路运抵欧洲之后，这一现象很快将成为过去时。",
                    "用不了多久，它们的引擎声将响彻整个欧洲的天空，令敌人闻风丧胆，令友军倍感安心。它们的名字很快被双方所熟知：",
                    "北美P-51“野马”式战斗机。",
                    {
                        "type": "changeFloor",
                        "floorId": "MT294",
                        "loc": [
                            -1,
                            -1
                        ]
                    }
                ]
            }
        ],
        "7,12": [
            "\t[系统提示]你凭实力来到了这一层并发现了这个彩蛋，这表明你是个勇士。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT292",
            "loc": [
                7,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "8,0": {
            "0": {
                "condition": "['MT284','MT285','MT286','MT287','MT288','MT289','MT290','MT291','MT292','MT293'].includes(core.status.floorId)&&core.itemCount('tea')<=10&&flags.mission40tsk1!=true",
                "currentFloor": false,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    "\t[盟军指挥官,hero]我们遭受了惨重损失，继续与敌人僵持下去，损失将不可估量。必须向上级申请停止进攻，休整部队。",
                    {
                        "type": "changeFloor",
                        "floorId": "MT293",
                        "loc": [
                            7,
                            1
                        ],
                        "direction": "down"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [50049,540,540,540,50049,605,109, 89,109,540,50049,625,244,625,50049],
    [50049,266,227,266,50049,605,109,345,109,540,50049,50049, 11,50049,540],
    [540,50049, 81,50049, 11,390,109,109,109,390,50049,218,244, 11,244],
    [540, 11,227,50049,266,50049,541,50049,390,270,540,50049, 82,50049,540],
    [540,50049,244, 11,541,372,541,50049,50049, 81,50049,542, 11,244,50049],
    [50049,541,244,541,50049, 81,50049,390,543, 11,542,244,50049,542,542],
    [542,50049,50049, 82,543,244,543,50049,663,543,50049,50049,50049,50049, 11],
    [542,50049,542,50049,50049,50049, 11,50049,50049, 82,  0,390,270, 81,372],
    [390, 11,227,244,50049,543,265, 81,543,265,50049,50049,  0,50049,542],
    [50049,50049,50049, 81,50049,266,541,50049,266,50049,543,50049, 11,50049,50049],
    [542,372,390,663, 11,541,50049,266,50049,  0,372,50049,227, 21, 21],
    [ 81,50049,50049,50049,50049,50049,50049, 11,50049,265,50049,372,50049,50049, 11],
    [ 21, 21,50049,218, 11,265, 81,  0, 81, 11,50049,  0, 11,218, 21],
    [50049, 11,50049, 21,50049,266,50049,544,50049,265, 81,227,50049,50049,50049],
    [ 22,218, 81, 21,50049, 22,50049, 93,50049, 21,50049, 82,  0,248,248]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}