main.floors.MT290=
{
    "floorId": "MT290",
    "title": "卡西诺山-7",
    "name": "卡西诺山-7",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "X100052",
    "bgm": "bgm6.mp3",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:第39关任务2",
            "value": "1"
        },
        {
            "type": "if",
            "condition": "(flag:修道院!==true)",
            "true": [
                {
                    "type": "choices",
                    "text": "\t[是否跳过剧情？]以下剧情涉及到接下来的选择，初次观看建议不要跳过",
                    "choices": [
                        {
                            "text": "跳过",
                            "action": []
                        },
                        {
                            "text": "不跳过",
                            "action": [
                                {
                                    "type": "setCurtain",
                                    "color": [
                                        0,
                                        0,
                                        0,
                                        1
                                    ],
                                    "time": 500,
                                    "keep": true
                                },
                                "在卡西诺山的山顶上，伫立着一座修道院——圣本笃修道院。",
                                "这座修道院对于西方国家而言是一座文物，历史悠久，是基督教最神圣的地方之一。即便基督教产生了许多分支，但它们都对修道院本身以及建立修道院的圣本笃本人十分尊崇，何况修道院下就埋着他的遗体。对于信奉基督教的欧美国家而言，它的重要性不言而喻。",
                                "因此，早在卡西诺山战役打响之前，德军和盟军就作出约定：\r[yellow]德军不会在圣本笃修道院内进行驻军以及进行其他军事用途，盟军也不会炸毁它\r，双方共同守护这一珍贵的物质文化遗产，当然更重要的是，\r[yellow]谁不小心破坏了它，谁就在舆论和道德上占了下风\r。",
                                "然而，匹夫无罪，怀璧其罪。圣本笃修道院的地理位置实在太好了，可以俯瞰整个卡西诺山，一旦用于军事，无论是\r[yellow]给炮兵提供观察哨还是狙击手用于伏击，抑或是改造成堡垒，甚至单纯只是放个士兵去透过窗户侦察敌情，都能给盟军造成不小麻烦\r。所以双方嘴上这么说，实际上都对其虎视眈眈。",
                                "盟军高层陷入了猜疑：德军真的会乖乖信守承诺，不利用修道院吗？再加上近期，\r[yellow]德军的炮火落点似乎非常精准，有士兵报告称自己的战友被狙击手射杀，在修道院的窗户上发现望远镜闪光，以及从修道院附近传来轻武器射击声音\r。",
                                "一位新西兰将军称，修道院必须被炸毁，其他都不重要。如果在一座历史文物和我军的生命之间做出选择，那么显然后者更重要。",
                                {
                                    "type": "setCurtain",
                                    "time": 500
                                }
                            ]
                        }
                    ]
                },
                {
                    "type": "choices",
                    "text": "\t[突发事件]是否空袭炸毁圣本笃修道院？",
                    "choices": [
                        {
                            "text": "给劳资炸！",
                            "action": [
                                "空袭将修道院夷为平地。但事实证明，那里没有任何德军，只有基督教徒和平民。",
                                "盟军的行为引起了国际社会的不满，并且德军现在可以名正言顺的将那里的残垣断壁挪作炮兵观察哨和狙击手掩体。从现在起，当前区域领域类伤害增加，且每次战后会被狙击手攻击一次。",
                                {
                                    "type": "setEnemy",
                                    "id": "pak40",
                                    "name": "zone",
                                    "value": "25000",
                                    "norefresh": true
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "howitzer150",
                                    "name": "zone",
                                    "value": "15000",
                                    "norefresh": true
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "flak88",
                                    "name": "zone",
                                    "value": "30000",
                                    "norefresh": true
                                },
                                {
                                    "type": "setEnemy",
                                    "id": "gunbunker",
                                    "name": "zone",
                                    "value": "15000",
                                    "norefresh": true
                                },
                                {
                                    "type": "setValue",
                                    "name": "flag:摧毁修道院",
                                    "value": "true"
                                }
                            ]
                        },
                        {
                            "text": "继续观望",
                            "action": [
                                "无事发生"
                            ]
                        }
                    ]
                },
                {
                    "type": "setValue",
                    "name": "flag:修道院",
                    "value": "true"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,14": {
            "floorId": "MT287",
            "loc": [
                7,
                0
            ]
        },
        "8,14": {
            "floorId": "MT287",
            "loc": [
                8,
                0
            ]
        },
        "0,7": {
            "floorId": "MT291",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {
        "8,6": [
            "up",
            "left"
        ],
        "9,6": [
            "up"
        ],
        "10,6": [
            "up"
        ],
        "11,6": [
            "up"
        ],
        "12,6": [
            "up"
        ],
        "13,6": [
            "up"
        ],
        "14,6": [
            "up"
        ],
        "13,8": [
            "up"
        ],
        "12,8": [
            "up"
        ],
        "11,8": [
            "up"
        ],
        "10,8": [
            "up"
        ],
        "9,8": [
            "up"
        ],
        "8,8": [
            "up",
            "left"
        ],
        "8,9": [
            "left"
        ],
        "8,10": [
            "up",
            "left"
        ],
        "9,9": [
            "up"
        ],
        "10,9": [
            "up"
        ],
        "11,9": [
            "up"
        ],
        "12,9": [
            "up"
        ],
        "13,9": [
            "up"
        ],
        "14,9": [
            "up"
        ],
        "13,10": [
            "up"
        ],
        "12,10": [
            "up"
        ],
        "11,10": [
            "up"
        ],
        "10,10": [
            "up"
        ],
        "9,10": [
            "up"
        ],
        "8,11": [
            "left"
        ],
        "8,12": [
            "left"
        ],
        "8,13": [
            "left"
        ],
        "8,14": [
            "left"
        ]
    },
    "cannotMoveIn": {
        "8,6": [
            "up",
            "left"
        ],
        "9,6": [
            "up"
        ],
        "10,6": [
            "up"
        ],
        "11,6": [
            "up"
        ],
        "12,6": [
            "up"
        ],
        "13,6": [
            "up"
        ],
        "14,6": [
            "up"
        ],
        "13,8": [
            "up"
        ],
        "12,8": [
            "up"
        ],
        "11,8": [
            "up"
        ],
        "10,8": [
            "up"
        ],
        "9,8": [
            "up"
        ],
        "8,8": [
            "up",
            "left"
        ],
        "8,9": [
            "left"
        ],
        "8,10": [
            "up",
            "left"
        ],
        "9,9": [
            "up"
        ],
        "10,9": [
            "up"
        ],
        "11,9": [
            "up"
        ],
        "12,9": [
            "up"
        ],
        "13,9": [
            "up"
        ],
        "14,9": [
            "up"
        ],
        "13,10": [
            "up"
        ],
        "12,10": [
            "up"
        ],
        "11,10": [
            "up"
        ],
        "10,10": [
            "up"
        ],
        "9,10": [
            "up"
        ],
        "8,11": [
            "left"
        ],
        "8,12": [
            "left"
        ],
        "8,13": [
            "left"
        ],
        "8,14": [
            "left"
        ]
    },
    "map": [
    [540,50049, 22, 22,50049, 22, 22,50049,542,50049,204,50049,265,541,541],
    [540,50049, 21, 21,50049, 21, 21,50049, 11,203,542, 82, 81,50049,50049],
    [540,50049,632,50049,50049,50049,632,50049,50049, 81,50049,50049,265,540,540],
    [540,50049,244, 11,663, 11,244,50049,543,543,50049,50049,519,540, 22],
    [540, 82,50049,50049, 81,50049,50049,543,50049,203, 81, 11,50049,50049,50049],
    [227,  0, 11,50049,542,203,372,543, 11,203,50049,244,543,543,388],
    [50049,50049, 11,203,542,50049, 11,50049,  0,50049,204, 11,203,50049,204],
    [ 92,233, 81,50049,50049,543,244,  0, 81, 11,203,50049,204, 11,203],
    [50049,50049, 11,203,542,50049, 81,50049,519,203,244, 11,203,244, 81],
    [542,203, 81,50049,50049,541, 11,541, 81,  0,218, 11,605,218,543],
    [50049,50049,244,605,50049,203,50049,50049, 21, 21,265,605,266, 82, 81],
    [540,204,50049,203, 11,541, 11,372,50049,390,50049,605,50049,266,50049],
    [540,227, 82,541,50049, 81,50049,372,390,50049,50049,265,50049,50049,540],
    [540,204,50049, 11,50049,663,50049, 21, 21, 21, 82,543,50049, 82,540],
    [50049,50049,248,203,50049,248,50049, 93, 93,50049,50049,543,265,  0,50049]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,100049,100050,100050,100050,100050,100050,100050],
    [  0,  0,  0,  0,  0,  0,  0,558,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,100049,100050,100050,100050,100050,100050,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,100057,100050,100050,100050,100050,100050,100050],
    [  0,  0,  0,  0,  0,  0,  0,  0,100049,100050,100050,100050,100050,100050,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,100057,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,100057,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,100057,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,100057,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "area": "陆地"
}