main.floors.MT294=
{
    "floorId": "MT294",
    "title": "地图",
    "name": "地图",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "gaijin1.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "指挥官阁下，我们的轰炸机即将对鲁尔工业区展开轰炸。",
        {
            "type": "drawArrow",
            "x1": 32,
            "y1": 16,
            "x2": 432,
            "y2": 272,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "正如你所知道的那样，鲁尔工业区是德军军工业的核心，那里的防御体系，尤其是防空系统，十分完备。",
        "我们的轰炸机要是轰炸那里，必然会遭到德军高射炮和战斗机的强烈反扑，而那里又是德军纵深，寻常护航战斗机根本无法抵达。",
        "但这次，不会和以前一样了。",
        {
            "type": "drawArrow",
            "x1": 112,
            "y1": 80,
            "x2": 400,
            "y2": 304,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "我们的D型野马战斗机换装了英国人的劳斯莱斯梅林引擎，现在它们能飞的更远，足够为我们的轰炸机进行全程护航。",
        "并且它们的战斗力也在中国战场得到了检验，在与日军战斗机的交锋中打出了不错的战果。上级对这种新型战斗机在欧洲的表现很有信心。",
        "现在埃克将军命令你作为战斗机大队的指挥官，在本次任务中为B17轰炸机提供全程护航，确保他们能够安全抵达鲁尔并投下炸弹。",
        "如果你们能够顺利完成任务，平安归来，就代表着我们的轰炸机可以更深入德军领土，对更重要的目标开展轰炸，破坏德国人的产能，让他们的战争机器停摆。",
        {
            "type": "clearMap"
        },
        "据说，德国空军元帅戈林向希特勒打包票，说只要有一架盟军轰炸机飞到鲁尔，他就要改名。希望他能说到做到。",
        "现在去做准备，明天就把戈林那个死胖子的证件改了吧！",
        {
            "type": "changeFloor",
            "floorId": "MT295",
            "loc": [
                7,
                11
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [622,  0,622,  0,  0,  0,  0,  0,  0,  0,  0,  0,369,  0,369],
    [622,622,622,  0,633,  0,  0,  0,  0,  0,  0,  0,  0,565,  0],
    [  0,  0,  0,  0,633,  0,  0,  0,  0,  0,  0,  0,372,  0,372],
    [  0,  0,633,633,  0,  0,  0,  0,  0,  0,  0,369,  0,369,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,565,371,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,369,  0,369,  0,372,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,565,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,371,  0,371,  0,390,  0],
    [  0,  0,  0,  0,  0,  0,369,  0,369,  0,  0,390,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,565,  0,  0,  0,  0,  0,  0,390],
    [  0,  0,  0,  0,  0,  0,371,  0,371,  0,  0,  0,390,  0,  0],
    [  0,  0,  0,369,  0,369,  0,  0,  0,277,  0,277,  0,  0,  0],
    [  0,  0,  0,  0,565,  0,  0,  0,  0,  0,565,  0,  0,  0,  0],
    [  0,  0,  0,372,  0,372,  0,  0,  0,277,  0,277,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [492,565,492,492,492,492, 16, 16, 16, 16, 16,  0,  0,  0,  0],
    [492,492,492,492,492,492, 16, 16, 16, 16, 16,  0,  0,  0,  0],
    [492,492,492,565,492, 16, 16, 16, 16, 16,  0,  0,  0,  0,  0],
    [492,492,492,492, 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0],
    [492, 16, 16, 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0],
    [ 16, 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,80350,80351,  0],
    [ 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80358,80359,  0],
    [ 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "area": "陆地"
}