main.floors.MT295=
{
    "floorId": "MT295",
    "title": "英国",
    "name": "英国",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "cao6.mp3",
    "firstArrive": [
        {
            "type": "unloadEquip",
            "pos": 0
        },
        {
            "type": "unloadEquip",
            "pos": 1
        },
        {
            "type": "unloadEquip",
            "pos": 2
        },
        {
            "type": "unloadEquip",
            "pos": 3
        },
        {
            "type": "unloadEquip",
            "pos": 4
        },
        {
            "type": "unloadEquip",
            "pos": 5
        },
        {
            "type": "unloadEquip",
            "pos": 6
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showui"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]获得试用装备：P51D野马战斗机",
        {
            "type": "setValue",
            "name": "item:p51d",
            "operator": "+=",
            "value": "1"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]重置主角状态",
        {
            "type": "setValue",
            "name": "status:hpmax",
            "value": "1200000",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:hp",
            "value": "1200000",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:atk",
            "value": "10000",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:mdef",
            "value": "45000",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:mana",
            "value": "500",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:top",
            "value": "200000",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "item:tea",
            "value": "50",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "item:cola",
            "value": "5",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "item:yellowKey",
            "value": "10",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "item:blueKey",
            "value": "4"
        },
        {
            "type": "playSound",
            "name": "technology.mp3"
        },
        {
            "type": "function",
            "function": "function(){\nflags.learned[20]=true\n}"
        },
        {
            "type": "setValue",
            "name": "flag:skill20Floor",
            "value": "[]"
        },
        "\t[系统提示]习得新技能：红色尾翼",
        "\t[系统提示]\f[skill21.jpg,90,50]红色尾翼（1000指挥点）：获得第332战斗机大队的支援。无条件直接夺取当前地图制空权。主角在当前地图行动期间，友军受到的战斗伤害-80%，且对敌方空军伤害+10%。",
        "\t[历史来源]\f[skill21.jpg,90,50]美国第332战斗机大队（又名塔斯克基飞行队）是二战时期美国第一支由黑人飞行员组成的飞行队，由于他们在飞机尾部涂上了显眼的红色，故也被称为“红尾巴”(red tails)。美国的种族歧视一直以来都非常严重，在二战时期，美国人普遍认为黑人只配从事最简单最低级的体力劳动，像飞行员这种“高贵”的工作是不能胜任的。然而，罗斯福总统却顶着几乎所有人的压力，签署政策声明：黑人在美军的战斗或非战斗部队中服役的人数要与美国人口中黑人的比例相称，其中也包括了航空部队。",
        "\t[历史来源]\f[skill21.jpg,90,50]第332战斗机大队就是在这种背景下诞生的。这群黑人飞行员顶着来自战友的鄙夷和霸凌，努力提升自己，积极作战，最终用实力创下奇迹：1267次护航任务中，只有27架轰炸机被敌军击落，远远低于其他任何一支护航机队，并最终赢得了轰炸机飞行员们的认可。战争期间，他们荣获至少1枚银星奖章、8枚紫心勋章、14枚铜星奖章、96枚优异飞行十字勋章和744枚空军奖章，击落111架敌机。355名黑人飞行员有68人牺牲，32人被俘。他们用自己的努力和成绩打破了世人的偏见，用赫赫战功告诉世人：肤色从来都无关紧要，重要的是一颗锐意进取的心，是努力拼搏的汗水，是为正义而奋斗的勇气。为了纪念他们，2012年，一部名为《红色尾翼》的电影正式上映（尽管电影中有些情节被“神剧化”了）。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,11": [
            "\t[参谋,N517]长官，请下达指示！",
            "\t[系统提示]即将进入存档界面",
            {
                "type": "callSave"
            },
            {
                "type": "insert",
                "name": "选择技能"
            },
            {
                "type": "choices",
                "text": "是否立即前往战场？",
                "choices": [
                    {
                        "text": "还没准备好",
                        "action": []
                    },
                    {
                        "text": "现在出发",
                        "action": [
                            {
                                "type": "if",
                                "condition": "core.hasEquip('b17')",
                                "true": [
                                    {
                                        "type": "setCurtain",
                                        "color": [
                                            0,
                                            0,
                                            0,
                                            1
                                        ],
                                        "time": 500,
                                        "keep": true
                                    },
                                    {
                                        "type": "changeFloor",
                                        "floorId": "MT296",
                                        "loc": [
                                            7,
                                            14
                                        ],
                                        "direction": "up"
                                    }
                                ],
                                "false": [
                                    "必须装备B17轰炸机才可执行任务！"
                                ]
                            }
                        ]
                    }
                ]
            }
        ],
        "11,11": [
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]当前区域敌人特点：德国空军精锐。\n推荐携带技能：防空弹幕、空战王牌、破译、补给线、孟菲斯美女号、红色尾翼\n推荐出战装备：P51D野马、蚊式，B17必带。",
            "可以在此清空技能槽，以便于玩家重新选择技能",
            {
                "type": "confirm",
                "text": "清空技能槽？",
                "yes": [
                    {
                        "type": "function",
                        "function": "function(){\nflags.skillList=[0,0,0,0,0,0,0]\n}"
                    }
                ],
                "no": []
            }
        ],
        "5,11": [
            "\t[机场后勤,N516]长官，我方空军已就绪！",
            {
                "type": "insert",
                "name": "选择飞机"
            }
        ],
        "9,11": [
            {
                "type": "insert",
                "name": "退役武器"
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [130042,  0,150175,150176,150177,150178,  0,120594,120595,120596,120597,120598,120599,120600,120601],
    [130063,  0,150200,150201,150202,150203,150204,120638,120639,120640,120641,120642,120643,120644,120645],
    [  0,  0,150225,150226,150227,150228,150229,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,150250,150251,150252,150253,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150161,150162,150163,150164,  0,  0,150161,150162,150163,150164,  0,  0,150161,150162,150163],
    [150186,150187,150188,150189,  0,  0,150186,150187,150188,150189,  0,  0,150186,150187,150188],
    [150211,150212,150213,150214,  0,  0,150211,150212,150213,150214,  0,  0,150211,150212,150213],
    [150236,150237,150238,150239,  0,  0,150236,150237,150238,150239,  0,  0,150236,150237,150238],
    [150261,150262,150263,150264,  0,  0,150261,150262,150263,150264,  0,  0,150261,150262,150263],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,556,  0,  0,  0,556,556,556,  0,  0,  0],
    [150155,150156,150157,150158,150159,516,  0,  0,  0,599,517,10147,  0,120783,  0],
    [150180,150181,150182,150183,150184,  0,  0,  0,120682,120683,120684,120685,120686,120687,120688],
    [150205,150206,150207,150208,150209,  0,  0,  0,120726,120727,120728,120729,120730,120731,120732],
    [150230,150231,150232,150233,150234,  0,  0,  0,120770,120771,120772,120773,120774,120775,120776]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [120760,120760,120760,120760,120760,120760,120760,120760,120760,120760,120760,120760,120760,120760,120760],
    [120804,120804,120804,120804,120804,120804,120804,120804,120804,120804,120804,120804,120804,120804,120804],
    [120849,120849,120892,120892,120849,120849,120892,120892,120849,120849,120892,120892,120849,120849,120892],
    [120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892],
    [120892,120892,120849,120849,120892,120892,120849,120849,120892,120892,120849,120849,120892,120892,120849],
    [120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892],
    [120849,120849,120892,120892,120849,120849,120892,120892,120849,120849,120892,120892,120849,120849,120892],
    [120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892,120892],
    [120936,120936,120936,120936,120936,120936,120936,120936,120936,120936,120936,120936,120936,120936,120936],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,120695,120696],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,120739,120740],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,120783,120784],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,120827,120828],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "陆地"
}