main.floors.MT309=
{
    "floorId": "MT309",
    "title": "地图",
    "name": "地图",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "medaction1.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "早上好，阁下。希望你昨晚睡眠质量不错，听说许多士兵都失眠了。",
        "这也是自然，因为就算是最钝感的人，也该意识到明天将是一场血腥的大战，也就是我们的代号\r[yellow]D-day\r。",
        "现在天还没亮，距离诺曼底登陆场还有一段航程。预计半小时后，我们的战列舰就可以开炮了。趁这个时间，我们最后一次确认下明天作战的细节。",
        "整个诺曼底海滩被分成了五个区域，分别由不同的部队负责。它们分别是：",
        {
            "type": "drawArrow",
            "x1": 80,
            "y1": 80,
            "x2": 48,
            "y2": 208,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "犹他(UTAH)海滩，由美国第7军4师负责。",
        {
            "type": "drawArrow",
            "x1": 144,
            "y1": 80,
            "x2": 112,
            "y2": 304,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "奥马哈(OMAHA)海滩，美国第5军1师和29师。",
        {
            "type": "drawArrow",
            "x1": 240,
            "y1": 112,
            "x2": 208,
            "y2": 272,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "黄金(GOLD)海滩，英国30军第50师。",
        {
            "type": "drawArrow",
            "x1": 304,
            "y1": 80,
            "x2": 304,
            "y2": 304,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "朱诺(JUNO)海滩，由你指挥的加拿大第3师。",
        {
            "type": "drawArrow",
            "x1": 432,
            "y1": 80,
            "x2": 400,
            "y2": 336,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "以及宝剑(SWORD)海滩，由英国第三师负责。",
        "按照计划，我们的空降部队现在应该已经在敌军后方降落，破坏敌军后方的重要据点。",
        "登陆开始前，我们的海军和航空力量会对整个滩头进行持续轰炸，压制敌军火力，并尽可能消灭敌军有生力量。",
        "然后，在合适的时机，放下所有登陆艇，驶向滩头。",
        "当你们抵达海滩，打开舱门的同时，战列舰也会停火。但时间不可能卡的这么精准，实际肯定会有误差。",
        "剩下的，就是地面作战，拿下整片滩头阵地。这些就是上岸后你要做的事情了。",
        {
            "type": "clearMap"
        },
        "实不相瞒，一想到自己会被写进历史教科书里面，我昨晚也没睡好。",
        "来吧，让我们做好一切准备，用最好的状态迎接这场人类历史上最大的抢滩登陆战役。",
        "天将破晓，\r[yellow]霸王行动\r，马上开始！",
        {
            "type": "changeFloor",
            "floorId": "MT310",
            "loc": [
                7,
                3
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [550,550,549,  0,549,  0,592,  0,549,  0,511,549,  0,592,  0],
    [  0,584,550,549,  0,549,  0,  0,549,549,550,550,550,549,549],
    [  0,587,550,550,549,  0,591,549,550,550,550,550,550,550,550],
    [  0,585,  0,550,550,550,  0,550,550,550,  0,586,  0,  0,584],
    [624,  0,  0,586,  0,585,584,  0,587,  0,585,  0,  0,  0,  0],
    [623,203,  0,  0,499,  0,  0,  0,499,  0,  0,  0,499,  0,  0],
    [203,623,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [203,624,  0,  0,  0,  0,  0,203,  0,  0,  0,  0,  0,  0,  0],
    [228,  0,  0,  0,624,203,203,623,624,203,  0,  0,  0,  0,  0],
    [623,  0,623,203,203,623,  0,  0,270,623,203,203,  0,  0,  0],
    [  0,623,  0,  0,  0,270,  0,228,  0,  0,270,623,624,203,  0],
    [270,  0,228,  0,228,  0,  0,270,  0,228,  0,  0,  0,623,203],
    [390,  0,  0,  0,550,  0,390,  0,  0,  0,  0,390,228,  0,623],
    [  0,  0,  0,390,  0,  0,  0,  0,390,  0,  0,  0,550,270,  0],
    [550,  0,  0,  0,  0,  0,  0,  0,  0,  0,550,  0,  0,  0,228]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [  0, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [  0,  0, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [  0,  0, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [  0,  0, 16, 16, 16, 16, 16,  0, 16, 16, 16, 16, 16, 16, 16],
    [  0, 16, 16, 16,  0,  0,  0,  0,  0,  0, 16, 16, 16, 16, 16],
    [  0, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 16, 16, 16],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 16],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "area": "陆地"
}