main.floors.MT311=
{
    "floorId": "MT311",
    "title": "诺曼底",
    "name": "诺曼底",
    "width": 15,
    "height": 45,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "farthestend.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[德军士兵]报告长官，发现敌方军舰正在接近！",
        "\t[德军军官]敌人有所行动了吗？不用担心，上面推测这应该是敌人的佯攻，规模不会很大，正常防守即可。",
        "\t[德军士兵]长官，我建议你走出地堡，上去亲眼看一下。",
        "\t[德军军官]……",
        "\t[德军军官]！？！？！？！？",
        "\t[德军军官]这（德式粗口）是佯攻？",
        "\t[德军军官]快！给隆美尔元帅发电报！这不是佯攻！是总攻！快去！",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "bomber1.mp3",
            "sync": true
        },
        "\t[兰开斯特轰炸机飞行员（加莱方向）]最后一批铝箔条投放完毕，空域安全，正在返航。",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "Sonar.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "Sonar.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "Sonar.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "seaexplo.mp3"
        },
        {
            "type": "playSound",
            "name": "torpeodoexplo.wav"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[反潜舰队指挥官]不明声纳信号的深度正在增加，投放深水炸弹的水面上发现浮油和潜艇残骸，确认击沉。",
        "\t[反潜舰队指挥官]有我们在，德国佬的潜艇就别想干扰登陆行动！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[水面炮击编队副将]报告，所有战舰，主炮和副炮，均装填完毕。射击诸元计算完毕，已根据光学测距仪测距结果调整至合适仰角。甲板已确认清空。",
        "\t[水面炮击编队指挥官]很好。各炮手听令——",
        "\t[水面炮击编队指挥官]舷炮，一轮齐射，开火！",
        {
            "type": "playSound",
            "name": "shipgun.mp3"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "shipgun.mp3"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "seabattle.mp3"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "shipgun.mp3"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "seabattle.mp3"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "shipgun.mp3"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "seabattle.mp3"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "shipgun.mp3"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "shipgun.mp3"
        },
        {
            "type": "sleep",
            "time": 200
        },
        {
            "type": "playSound",
            "name": "seabattle.mp3",
            "sync": true
        },
        "\t[陆基航空大队指挥官]第二波次所有战机按序起飞。尽可能的清除上一波次未摧毁的敌军防御工事。战斗机注意搜索空域，确保制空权牢牢把握在我军手中。",
        {
            "type": "playSound",
            "name": "fighter1.mp3"
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "fighter1.mp3"
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "fighter1.mp3"
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "fighter1.mp3"
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "fighter1.mp3"
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "fighter1.mp3"
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "playSound",
            "name": "fighter.mp3"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "bomber.mp3"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "fighter.mp3"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "fighter.mp3"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "bomber.mp3"
        },
        {
            "type": "sleep",
            "time": 150
        },
        {
            "type": "playSound",
            "name": "fighter.mp3",
            "sync": true
        },
        "\t[重型轰炸机编队大队长]航向调整完毕，投弹手，接下来靠你了。",
        "\t[重型轰炸机编队投弹手]收到。正在瞄准……",
        "\t[重型轰炸机编队投弹手]清空弹舱！",
        {
            "type": "playSound",
            "name": "airstrike.mp3"
        },
        {
            "type": "sleep",
            "time": 3000
        },
        "\t[战斗机大队长]各单位注意，十二点方向，高度约3千米，发现敌军飞机。",
        "\t[战斗机大队长]来吧伙计们，我们有活干了。抛弃副油箱，跟紧我，俯冲下去，杀他们一个片甲不留！",
        {
            "type": "playSound",
            "name": "fighter.mp3"
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "fighter.mp3"
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "bomber.mp3"
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "fighter.mp3"
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "fighter2.mp3"
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "playSound",
            "name": "dogfight.mp3",
            "sync": true
        },
        "\t[空降兵（德军阵线后方）]算算时间，那边差不多也该开始了。",
        "\t[空降兵（德军阵线后方）]所以呢？我们现在要怎么办，就像现在这样跟前面的德国佬干瞪眼吗？",
        "\t[空降兵（德军阵线后方）]嘿，伙计们，看我找到了谁？",
        "\t[空降兵（德军阵线后方）]得，又有一个倒霉蛋要跟我们一块被压制在这个泥坑里了。",
        "\t[空降兵（德军阵线后方）]那可不一定。我跳下飞机之前，多带了一门巴祖卡火箭筒。",
        "\t[空降兵（德军阵线后方）]（粗口），你怎么不早点拿出来？",
        "\t[空降兵（德军阵线后方）]我才刚来啊……",
        "\t[空降兵（德军阵线后方）]行了，别管那么多了。看见那边那一坨机枪掩体了没？用你的大炮把它给我炸了。打准点，不然我又得在这破地方趴几个小时。",
        {
            "type": "playSound",
            "name": "v_jet_pass.mp3"
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "playSound",
            "name": "bomb.mp3",
            "stop": true,
            "sync": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[美国大兵（登陆艇上）]呕呕呕呕呕！",
        "\t[美国大兵（登陆艇上）]喂！你（美式粗口）看准点啊！吐我身上了！",
        "\t[美国大兵（登陆艇上）]抱歉，这登陆艇太（美式粗口）能晃了。见鬼，老子是陆军，不是（美式粗口）的海军。",
        "\t[美国大兵（登陆艇上）]你就该像我一样，昨晚就把能吐的都给吐干净。",
        "\t[美军排长（登陆艇上）]伙计们！我们距离海滩还有150码！记住我出发之前说的，打开舱门后，不要犹豫，立刻跳下去！我们当中注定有人会死，要是有谁幸运的没被子弹打中，别管旁边战友的尸体，马上下去找掩体，明白没有！",
        "\t[美国大兵（登陆艇上）]Yes, sir!",
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setViewport",
            "loc": [
                0,
                0
            ],
            "time": 5000,
            "async": true
        },
        {
            "type": "sleep",
            "time": 4000
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                1,
                5
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                6,
                4
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "bomber3.mp3"
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "aircraft2.png",
            "loc": [
                480,
                0
            ],
            "opacity": 1,
            "time": 0,
            "async": true
        },
        {
            "type": "moveImage",
            "code": 1,
            "to": [
                -195,
                0
            ],
            "time": 300,
            "async": true
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                12,
                3
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                11,
                6
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "bomber3.mp3"
        },
        {
            "type": "showImage",
            "code": 2,
            "image": "aircraft2.png",
            "loc": [
                480,
                -120
            ],
            "opacity": 1,
            "time": 0,
            "async": true
        },
        {
            "type": "moveImage",
            "code": 2,
            "to": [
                -195,
                -120
            ],
            "time": 300,
            "async": true
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                2,
                7
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                10,
                7
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                1,
                6
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "playSound",
            "name": "bomber3.mp3"
        },
        {
            "type": "showImage",
            "code": 3,
            "image": "aircraft2.png",
            "loc": [
                480,
                112
            ],
            "opacity": 1,
            "time": 0,
            "async": true
        },
        {
            "type": "moveImage",
            "code": 3,
            "to": [
                -195,
                112
            ],
            "time": 300,
            "async": true
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                10,
                4
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                5,
                1
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                7,
                7
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                2,
                1
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                14,
                1
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                3,
                3
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                9,
                5
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 100
        },
        {
            "type": "animate",
            "name": "zone",
            "loc": [
                8,
                3
            ],
            "async": true
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 0
        },
        {
            "type": "hideImage",
            "code": 3,
            "time": 0
        },
        "1944年6月6日，“霸王行动”，也就是诺曼底登陆战，正式打响。",
        "盟军一共调集了153万陆军，17万辆战车，1.3万架飞机，和5000艘舰艇。这是整个人类历史上，迄今为止规模最大的一次登陆战。",
        "满载兵员装备的登陆艇在诺曼底海滩前的海面上铺开，像密集的蚁群，劈开白色的浪花，向着海岸线驶去。",
        "德军地堡打出的炮弹也不断在海面上炸开，其中有些是专为战列舰准备的巨型舰炮。沿途不断有登陆艇被击中或触雷，连同船上的士兵一起灰飞烟灭。",
        "随着战舰的炮火逐渐沉寂，登陆艇也一艘接一艘抵达海滩。随着登陆艇的舱门被缓缓放下，不等最前排的盟军士兵们反应过来，德军机枪打出的炽热子弹便劈头盖脸的窜了过来……",
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "changeFloor",
            "floorId": "MT312",
            "loc": [
                7,
                12
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [228,  0,  0,228,  0,  0,228,  0,623,  0,623,  0,248,  0,228],
    [266,624,203,  0,623,203,  0,248,265,  0,  0,  0,266,624,  0],
    [  0,  0,  0,  0,  0,266,624,203,  0,  0,  0,  0,  0,  0,623],
    [  0,  0,  0,203,203,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [501,265,501,631,266,265,501,  0,  0,204,501,266,203,  0,203],
    [ 11,631,266,203,501,204,631,265,501,203,631,501,265,501,  0],
    [631,631,631, 11,631,  0,631,  0,631,  0, 11,631,  0,631,  0],
    [ 11,  0,631,  0,  0,631, 11,631,  0,631,  0, 11,  0,  0,  0],
    [  0,  0,  0,631, 11,  0,  0,  0,631, 11,  0,  0,  0,631,  0],
    [631,  0,  0,  0,  0,  0,631,  0,  0,  0,  0,631,  0,  0,631],
    [  0,631,  0,631,  0,  0,  0,631,631,  0,631,  0,  0,631,  0],
    [  0,  0,  0,  0,631,  0,  0,  0,631,  0,  0,631,  0,  0,631],
    [631,  0,631,  0,  0,631,  0,631,  0,631,  0,  0,631,  0,  0],
    [  0,  0,  0,631,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,360,  0,  0,  0,  0,  0,  0,360,  0,  0,360],
    [360,  0,360,  0,  0,  0,  0,360,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,360,  0,  0,360,  0,  0],
    [360,  0,  0,360,  0,  0,360,  0,  0,  0,  0,  0,360,  0,360],
    [  0,360,  0,360,  0,  0,  0,  0,360,  0,360,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,360,  0,  0,  0,  0,  0,  0,360,360,  0],
    [  0,  0,360,  0,  0,  0,360,  0,  0,360,  0,  0,  0,  0,  0],
    [360,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,360],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,498,  0,  0,498,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [498,  0,  0,  0,498,  0,498,  0,  0,  0,  0,  0,498,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,498,  0,  0,  0,  0,  0],
    [  0,498,  0,  0,498,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,498,  0,549,  0,498,  0,  0,498,  0,  0,  0,498],
    [549,  0,  0,  0,  0,  0,  0,  0,549,  0,  0,  0,498,  0,  0],
    [  0,498,  0,549,  0,  0,  0,498,  0,  0,  0,  0,  0,498,  0],
    [  0,  0,  0,  0,498,  0,  0,  0,  0,  0,498,  0,  0,  0,549],
    [  0,549,  0,  0,  0,549,  0,  0,549,  0,  0,549,498,  0,  0],
    [  0,  0,  0,498,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,499],
    [499,  0,  0,  0,  0,  0,  0,  0,  0,500,  0,  0,499,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,499,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,585,  0,  0,499,  0,  0,  0,499,  0,  0,585,  0,  0],
    [498,  0,  0,  0,  0,  0,  0,  0,500,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,585,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [584,  0,  0,  0,  0,  0,586,  0,  0,  0,  0,  0,585,  0,584],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,587,  0,  0,  0,  0,  0],
    [  0,  0,  0,510,  0,  0,  0,587,  0,  0,  0,587,  0,  0,  0],
    [  0,584,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,584],
    [  0,  0,  0,  0,  0,  0,  0,  0,586,  0,  0,  0,  0,  0,  0]
],
    "area": "浅滩",
    "bgmap": [
    [40033,40033,40033,40033,40033,40033,40033,40033,40033,40041,40041,40041,40033,40033,40033],
    [40041,40041,40041,40041,40033,40033,40033,40033,40042,40049,40049,40049,40040,40041,40033],
    [40049,40049,40049,40050,40040,40041,40041,40042,40050,40049,40049,40049,40048,40050,40040],
    [40057,40057,40057,40058,40056,40057,40057,40049,40050,40057,40057,40057,40048,40050,40048],
    [348,348,348,348,348,348,348,40056,40058,348,348,348,40056,40058,40056],
    [348,348,348,348,348,348,348,348,348,348,348,348,348,348,348],
    [348,348,348,348,348,348,348,348,348,348,348,348,348,348,145],
    [348,348,348,348,348,348,348,348,348,348,348,348,145,145,145],
    [145,348,348,348,348,145,145,145,348,348,145,145,145,154,154],
    [145,145,145,145,145,145,145,145,145,145,145,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154,154,154],
    [154,154,154,154,154,154,154,154,154,154,154,154,154,155,155],
    [155,154,154,154,155,154,154,154,155,155,155,155,154,155,155],
    [155,154,154,155,155,155,155,155,155,155,155,155,155,155,155],
    [155,155,155,155,155,155,155,155,155,155,155,155,155,155,155],
    [155,155,155,155,155,155,155,155,155,155,155,155,155,155,155],
    [155,155,155,155,155,155,155,155,155,156,156,156,156,155,155],
    [155,155,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156,156,156]
],
    "fgmap": [

]
}