main.floors.MT310=
{
    "floorId": "MT310",
    "title": "旗舰指挥室",
    "name": "旗舰指挥室",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "cao6.mp3",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showui"
        },
        {
            "type": "function",
            "function": "function(){\nflags.learned[21]=true\n}"
        },
        "\t[系统提示]习得新技能：T34谢尔曼风琴",
        "\t[系统提示]\f[skill20.jpg,90,50]T34谢尔曼风琴（600指挥点）：仅可在地面使用。呼叫火箭炮覆盖打击，打击目标为以自身为中心7×7正方形区域，其中的敌人陆军受到不同程度的损失：步兵失去70%生命值，炮兵失去50%，装甲失去20%",
        "\t[历史来源]\f[skill20.jpg,90,50]M4/T34是谢尔曼坦克各类型号中最具辨识度的存在，头顶搭载了一门火箭炮，既可以像常规坦克一样突击，也可以进行炮火支援，也叫“卡利欧波”（calliope，译为管风琴）。火箭炮有36到60支炮管，可以发射114.3毫米（4.5英寸）火箭炮，最大射程约3800米（后期采用旋转稳定式M16火箭弹时可达4800米），诺曼底登陆后广泛用于战场。此外，为避免与苏联T-34系列坦克混淆，人们一般称其为“管风琴坦克”",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]上级为你调拨了3辆丘吉尔“鳄鱼”坦克增援，请接收。",
        {
            "type": "setValue",
            "name": "item:crocodile",
            "operator": "+=",
            "value": "3"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,13": [
            {
                "type": "insert",
                "name": "退役武器"
            }
        ],
        "13,13": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]不用找装备坦克的地方了，下一关有些特殊，现在装不了坦克，得等到战斗进程到一定程度时才会给你装备。",
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]推荐现在先把该买的坦克装备都买好，到时候只有一次装备机会，要是手滑误点了返回按钮，那可就糟了。",
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]你的装备和技能需要连续使用两关，要谨慎选择哦！尤其是对称飞别忘带！"
        ],
        "3,8": [
            "\t[海军参谋,N515]长官，所有军舰待命中！",
            {
                "type": "insert",
                "name": "选择战舰"
            }
        ],
        "3,5": [
            "\t[机场后勤,N516]长官，我方空军已就绪！",
            {
                "type": "insert",
                "name": "选择飞机"
            }
        ],
        "11,8": [
            "\t[参谋,N517]长官，请下达指示！",
            "\t[系统提示]即将进入存档界面",
            {
                "type": "callSave"
            },
            {
                "type": "insert",
                "name": "选择技能"
            },
            {
                "type": "choices",
                "text": "是否立即前往战场？",
                "choices": [
                    {
                        "text": "还没准备好",
                        "action": []
                    },
                    {
                        "text": "现在出发",
                        "action": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    0,
                                    0,
                                    0,
                                    1
                                ],
                                "time": 500,
                                "keep": true
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT311",
                                "loc": [
                                    -1,
                                    45
                                ],
                                "direction": "down"
                            }
                        ]
                    }
                ]
            }
        ],
        "7,11": [
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]当前区域敌人特点：各式陆军，防御建筑多，到处是地雷。\n推荐携带技能：扫雷、破译、空中打击、补给线、C47空中列车、装甲突击、T34谢尔曼风琴\n推荐出战装备：谢尔曼萤火虫、J级驱逐舰、克利夫兰级巡洋舰、光辉级航空母舰、P51D野马、蚊式、B17G空中堡垒。推荐买扫雷坦克。",
            "可以在此清空技能槽，以便于玩家重新选择技能",
            {
                "type": "confirm",
                "text": "清空技能槽？",
                "yes": [
                    {
                        "type": "function",
                        "function": "function(){\nflags.skillList=[0,0,0,0,0,0,0]\n}"
                    }
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [30243,30576,30577,30577,30577,30577,30577,30577,30577,30577,30577,30577,30577,30578,30243],
    [30251,30584,30585,30585,30585,30585,30585,30585,30585,30585,30585,30585,30585,30586,30251],
    [30251,90673,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90250,30251],
    [30251,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90258,30251],
    [30251,  0,  0,  0,10136,10137,10137,10137,10137,10137,10138,  0,  0,  0,30251],
    [30251,  0,  0,516,10144,10145,10145,10145,10145,10145,10146,  0,  0,  0,30251],
    [30251,  0,  0,  0,10144,10145,10145,10145,10145,10145,10146,  0,  0,  0,30251],
    [30251,  0,  0,  0,10144,10145,10145,10145,10145,10145,10146,  0,  0,  0,30251],
    [30251,  0,  0,515,10144,10145,10145,10145,10145,10145,10146,517,  0,  0,30251],
    [30251,  0,  0,  0,10144,10145,10145,10145,10145,10145,10146,  0,  0,  0,30251],
    [30251,  0,  0,  0,10144,10145,10145,10145,10145,10145,10146,  0,  0,  0,30251],
    [30251,  0,  0,  0,10144,10145,10145,10145,10145,10145,10146,  0,  0,  0,30251],
    [30251,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,30251],
    [30251,599,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,601,30251],
    [30259,90673,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,90673,30259]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,90666,  0,90666,  0,90666,  0,  0,  0,  0,  0],
    [  0,  0,  0,90668,  0,90674,  0,90674,  0,90674,  0,90669,  0,  0,  0],
    [  0,  0,558,90676,  0,  0,  0,  0,  0,  0,  0,90677,  0,  0,  0],
    [  0,  0,  0,90668,  0,  0,  0,  0,  0,  0,  0,90669,  0,  0,  0],
    [  0,  0,  0,90676,  0,  0,  0,  0,  0,  0,  0,90677,  0,  0,  0],
    [  0,  0,558,90668,  0,  0,  0,  0,  0,  0,  0,90669,557,  0,  0],
    [  0,  0,  0,90676,  0,  0,  0,  0,  0,  0,  0,90677,  0,  0,  0],
    [  0,  0,  0,90668,  0,  0,  0,  0,  0,  0,  0,90669,  0,  0,  0],
    [  0,  0,  0,90676,  0,  0,  0,  0,  0,  0,  0,90677,  0,  0,  0],
    [  0,556,  0,  0,10152,10153,10153,10153,10153,10153,10154,  0,  0,556,  0],
    [  0,  0,  0,  0,  0,90667,  0,90667,  0,90667,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,559,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,90912,90913,90691,90692,30672,30673,30674,  0,90916,90917,90918,  0,  0],
    [  0,  0,90920,90921,90699,90700,30680,30681,30682,  0,90924,90925,90926,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,80621,80622,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80678,  0,80678,  0,80678,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,80620,  0,80678,  0,80678,  0,80620,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,80678,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,80678,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,80621,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "海洋"
}