main.floors.MT324=
{
    "floorId": "MT324",
    "title": "朱诺海滩人工港",
    "name": "朱诺海滩人工港",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "sand",
    "bgm": "cao6.mp3",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showui"
        },
        {
            "type": "function",
            "function": "function(){\nflags.learned[22]=true\n}"
        },
        {
            "type": "setValue",
            "name": "flag:地毯轰炸楼层",
            "value": "[]"
        },
        "\t[系统提示]习得新技能：地毯式轰炸",
        "\t[系统提示]\f[skill22.png,90,50]地毯式轰炸（3000指挥点）：仅可在陆地或浅滩使用。呼叫大规模轰炸机群展开全图轰炸，全体敌方陆军损失70%生命值，空军损失15%生命值。每张地图仅限使用1次，对boss无效。",
        "\t[历史来源]\f[skill22.png,90,50]地毯式轰炸指像在地板上铺地毯一样地使用大量炸弹覆盖轰炸某一地域，杀伤和摧毁该地域的人员、装备。当地毯式轰炸的目标为人口或工业聚集区时，意在达成打击对方的士气和战争潜力这一战略目的。二战后期，盟军凭借着绝对的制空权，使用大规模重型轰炸机群对德国和日本进行大量地毯式轰炸，彻底摧毁轴心国的战争潜能，为二战的胜利奠定基础。但地毯式轰炸通常会造成大量平民伤亡。因此，精确制导武器出现后，地毯式轰炸就被联合国禁止了。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,7": [
            {
                "type": "animate",
                "name": "zone",
                "loc": "hero"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 0,
                "keep": true
            },
            "你被地雷炸飞了出去，眨眼间没了踪影。最后下属们只找到了你的其中一只胳膊。下辈子走路的时候看着点吧！",
            {
                "type": "restart"
            }
        ],
        "14,4": [
            {
                "type": "animate",
                "name": "zone",
                "loc": "hero"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 0,
                "keep": true
            },
            "你被地雷炸飞了出去，眨眼间没了踪影。最后下属们只找到了你的其中一只胳膊。下辈子走路的时候看着点吧！",
            {
                "type": "restart"
            }
        ],
        "7,10": [
            "\t[参谋,N517]长官，请下达指示！",
            "\t[系统提示]即将进入存档界面",
            {
                "type": "callSave"
            },
            {
                "type": "insert",
                "name": "选择技能"
            },
            {
                "type": "choices",
                "text": "是否立即前往战场？",
                "choices": [
                    {
                        "text": "还没准备好",
                        "action": []
                    },
                    {
                        "text": "现在出发",
                        "action": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    0,
                                    0,
                                    0,
                                    1
                                ],
                                "time": 500,
                                "keep": true
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT325",
                                "loc": [
                                    7,
                                    0
                                ],
                                "direction": "down"
                            }
                        ]
                    }
                ]
            }
        ],
        "11,5": [
            "\t[维修人员,N514]长官，所有战车准备就绪！",
            {
                "type": "insert",
                "name": "选择坦克"
            }
        ],
        "0,3": [
            {
                "type": "insert",
                "name": "退役武器"
            }
        ],
        "8,10": [
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]当前区域敌人特点：大量陆军伴随少量空军，有重型坦克出没。\n推荐携带技能：防空弹幕、破译、T34谢尔曼风琴、空中打击、补给线、装甲突击、地毯式轰炸\n推荐出战装备：谢尔曼萤火虫、埃塞克斯级航母、P51野马、P47D雷电、B17G空中堡垒。",
            "可以在此清空技能槽，以便于玩家重新选择技能",
            {
                "type": "confirm",
                "text": "清空技能槽？",
                "yes": [
                    {
                        "type": "function",
                        "function": "function(){\nflags.skillList=[0,0,0,0,0,0,0]\n}"
                    }
                ],
                "no": []
            }
        ],
        "5,4": [
            "\t[机场后勤,N516]长官，我方空军已就绪！",
            {
                "type": "insert",
                "name": "选择飞机"
            }
        ],
        "14,8": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]新的航空母舰已经能够派出舰载机深入内陆进行攻击了，甚至还有个专辅。所以，现在是：大航母时代！让敌人感受下美利坚的骇人轰炸吧！"
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [30509,30509,30509,30509,30509,30509,  0,  0,  0,631,30509,30509,631,  0,  0],
    [631,  0,  0,631,  0,  0,631,  0,  0,  0,30509,30509,  0,  0,631],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [599,  0,631,  0,  0,631,  0,  0,  0,631,30509,30509,30509,631,  0],
    [  0,  0,  0,  0,30509,516,30509,  0,  0,  0,30509,30509,30509,  0,  0],
    [  0,631,  0,631,  0,  0,  0,  0,  0,  0,30509,514,30509,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,631,  0,  0,  0,  0,  0,631,  0],
    [631,  0,  0,  0,  0,631,  0,  0,  0,631,  0,  0,  0,  0,  0],
    [30509,30509,  0,  0,  0,  0,  0,  0,  0,  0,  0,631,  0,  0,601],
    [30509,30509,  0,631,  0,  0,  0,631,  0,  0,  0,  0,  0,  0,  0],
    [30516,30516,30509,30509,30509,  0,  0,517,129,  0,  0,  0,30516,30516,30516],
    [30516,30516,30509,30509, 17,30517,30517,30517,30517,30517, 17, 17,30516,30524,30524],
    [30524,30516, 17, 17, 17,30517,30517,30517,30517,30517, 17, 17,30524,30516,30516],
    [30516,30516, 17, 17, 17,30525,30525,30525,30525,30525, 17, 17,30516,30524,30524],
    [30524,30524, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17,30524,30516,30516]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,557,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 11],
    [  0,  0,  0,  0,  0,559,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,559,  0,  0,  0],
    [  0,  0, 11,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,558,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,556,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,558,  0,  0,  0,  0,  0,145,145,145],
    [  0,  0,  0,  0,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145,145,145]
],
    "fgmap": [

],
    "area": "浅滩"
}