main.floors.MT339=
{
    "floorId": "MT339",
    "title": "里昂",
    "name": "里昂",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "cao7.mp3",
    "firstArrive": [
        {
            "type": "playSound",
            "name": "跳跃"
        },
        {
            "type": "jump",
            "from": [
                7,
                6
            ],
            "dxy": [
                0,
                0
            ],
            "time": 50,
            "keep": true
        },
        {
            "type": "animate",
            "name": "aim",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "animate",
            "name": "vehicleexplore",
            "loc": [
                6,
                6
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    6
                ]
            ],
            "remove": true,
            "time": 500
        },
        {
            "type": "playSound",
            "name": "跳跃"
        },
        {
            "type": "jump",
            "from": [
                14,
                10
            ],
            "dxy": [
                0,
                0
            ],
            "time": 50,
            "keep": true
        },
        {
            "type": "animate",
            "name": "aim",
            "loc": [
                13,
                10
            ]
        },
        {
            "type": "animate",
            "name": "vehicleexplore",
            "loc": [
                13,
                10
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    13,
                    10
                ]
            ],
            "remove": true,
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,0": [
            {
                "type": "playSound",
                "name": "technology.mp3"
            },
            {
                "type": "function",
                "function": "function(){\nflags.learned[23]=true\n}"
            },
            {
                "type": "setValue",
                "name": "flag:铝箔条",
                "value": "0"
            },
            "\t[系统提示]习得新技能：铝箔条",
            "\t[系统提示]\f[skill23.png,90,50]铝箔条（1200指挥点）：抛洒铝箔条，干扰敌方雷达。在使用过该技能的地图中，光环类（指挥、截断等）、协同攻击类（陷阱、防空等）技能无效",
            "\t[历史来源]\f[skill23.png,90,50]二战期间，英国人发现铝箔条具有干扰雷达的功效，于是开始采用新的战术：在轰炸机群中安排少量飞机，不带炸弹，只带铝箔条，飞到目标上空抛洒下去，在气流的吹动下形成大块面积的箔条云，对敌方雷达反射波形成紊乱，达到干扰效果。铝箔条直到现代战场仍然具有很大价值，甚至已经是陆海空通用的干扰物。例如，战斗机被雷达制导导弹锁定追踪时，可以抛洒铝箔条干扰弹，使导弹失去方向。",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "14,10": [
            {
                "type": "setValue",
                "name": "flag:空降兵",
                "operator": "+=",
                "value": "1"
            },
            "\t[系统提示]空降兵已归队，获得500雷击",
            {
                "type": "setValue",
                "name": "status:top",
                "operator": "+=",
                "value": "500"
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "7,6": [
            {
                "type": "setValue",
                "name": "flag:空降兵",
                "operator": "+=",
                "value": "1"
            },
            "\t[系统提示]空降兵已归队，获得20经验",
            {
                "type": "setValue",
                "name": "status:exp",
                "operator": "+=",
                "value": "20"
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "0,7": {
            "floorId": "MT337",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [637,218,637,10015,580,10015,391,551,391,10015,643,10015,635,638,635],
    [637,632,637,10015,580,10015,  0,270,  0,10015,643,10015,636,638,636],
    [10015, 81,10015,10015,275,10015,270,  0,270,10015,663,10015,  0,228,  0],
    [608,275,  0,  0,632,10015,  0,412,  0,10015,  0,10015,10015, 82,10015],
    [10015,10015,10015,10015, 81,10015,10015, 82,10015,10015,  0, 81,265,518,518],
    [518,518,  0,275,  0,632,  0,  0,  0,  0,  0,10015,10015,10015,10015],
    [10015,10015,664,10015,632,10015,663,550,10015, 81,10015,10015,  0, 11,581],
    [ 92,  0,  0,10015,  0,10015, 81,10015,10015,  0,  0,663,  0,10015,248],
    [10015,10015,250,10015,  0,10015,  0,250,10015,215,10015, 81,10015,10015,10015],
    [518,518, 21, 81,  0,10015,10015,608,10015,390,10015,  0,10015,638,638],
    [10015,10015,10015,10015,  0,10015,  0,250,10015,  0,10015,  0,10015,218,550],
    [218,228, 82,  0,  0,10015, 81,10015,  0,  0, 11,  0, 81,227,  0],
    [  0,218,10015,10015,632,10015,580,10015,10015, 81,10015,10015,10015,10015, 82],
    [635,636,10015,643,  0,265,  0,  0,265, 21,10015,518,518,  0,228],
    [635,636,10015,636,643,10015,390,390,10015,518,10015,650,518,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}