main.floors.MT337=
{
    "floorId": "MT337",
    "title": "法国",
    "name": "法国",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "cao7.mp3",
    "firstArrive": [
        {
            "type": "playSound",
            "name": "跳跃"
        },
        {
            "type": "jump",
            "from": [
                0,
                12
            ],
            "dxy": [
                0,
                0
            ],
            "time": 50,
            "keep": true
        },
        {
            "type": "animate",
            "name": "aim",
            "loc": [
                1,
                13
            ]
        },
        {
            "type": "animate",
            "name": "shoot",
            "loc": [
                1,
                13
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    1,
                    13
                ]
            ],
            "remove": true,
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,12": [
            {
                "type": "setValue",
                "name": "flag:空降兵",
                "operator": "+=",
                "value": "1"
            },
            "\t[系统提示]空降兵已归队，获得500血限",
            {
                "type": "setValue",
                "name": "status:hpmax",
                "operator": "+=",
                "value": "500"
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "14,2": [
            {
                "type": "setValue",
                "name": "flag:空降兵",
                "operator": "+=",
                "value": "1"
            },
            "\t[系统提示]空降兵已归队，获得1可乐",
            {
                "type": "setValue",
                "name": "item:cola",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT335",
            "loc": [
                7,
                0
            ]
        },
        "14,7": {
            "floorId": "MT339",
            "loc": [
                0,
                7
            ]
        },
        "7,0": {
            "floorId": "MT338",
            "loc": [
                7,
                14
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [635,635,635,635,152,638,152, 91,152,638,152,228,218,650,650],
    [412,152,152,152,152,638,152,235,152,638,152, 82,152,152,152],
    [ 21, 21, 21,632,152,227,152,235,152,227,152,228,636,636,550],
    [ 82,152,152, 81,152,  0,152,235,152,  0,152, 82,152,152,152],
    [  0, 11,  0,  0,152,  0, 81,373, 81,  0, 11,  0,250,636,636],
    [  0,152,663,152,152, 11,152,152,152,152, 81,152,152,152,152],
    [  0,152,643,643,152,406,608,152,607,  0,250,152,218,636,636],
    [ 82,152,152, 81,152,152,152,152,663,152,643, 82,373,218, 94],
    [  0,406,  0,632,  0, 11,152,  0,607,152,  0,152,218,636,636],
    [152,152,152,152,152,  0,152,  0,152,152,270,152,152,152,152],
    [635,635,664,370, 81,265,152,265,152,389,390,389,152,580,250],
    [152,152,152,152,152,  0,152,236,152,152, 82,152,152,152, 11],
    [550,  0,632,  0,663,  0,  0,  0,  0,  0,632,  0, 81,373,370],
    [152,250,152,152,275,152,152,  0,152,152,275,152,152,152, 11],
    [638,638,152,637,637,637,152, 93,152,637,637,637,152,580,250]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}