main.floors.MT363=
{
    "floorId": "MT363",
    "title": "北冰洋",
    "name": "北冰洋",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "wots3.mp3",
    "firstArrive": [
        "\t[系统提示]如果想三星通关且清光本层，那么本层必须至少用掉一个破冰"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "14,7": [
            {
                "type": "setValue",
                "name": "flag:进水",
                "value": "false"
            },
            {
                "type": "setValue",
                "name": "flag:fire",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "item:icePickaxe",
                "value": "0"
            },
            {
                "type": "setValue",
                "name": "flag:第48关通关",
                "value": "1"
            },
            {
                "type": "unloadEquip",
                "pos": 0
            },
            {
                "type": "unloadEquip",
                "pos": 1
            },
            {
                "type": "unloadEquip",
                "pos": 2
            },
            {
                "type": "unloadEquip",
                "pos": 3
            },
            {
                "type": "unloadEquip",
                "pos": 4
            },
            {
                "type": "unloadEquip",
                "pos": 5
            },
            {
                "type": "unloadEquip",
                "pos": 6
            },
            {
                "type": "update"
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "hideui"
            },
            {
                "type": "update"
            },
            {
                "type": "sleep",
                "time": 1000
            },
            {
                "type": "playSound",
                "name": "158-Skill02.mp3"
            },
            {
                "type": "showImage",
                "code": 1,
                "image": "win.png",
                "sloc": [
                    0,
                    0,
                    null
                ],
                "loc": [
                    -60,
                    120,
                    600,
                    240
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "scaleImage",
                "code": 1,
                "center": [
                    80,
                    160
                ],
                "scale": 0.5,
                "time": 500
            },
            {
                "type": "function",
                "function": "function(){\nvar a = core.taskSystem.checkTask(0) ? 1 : 0,\n\tb = core.taskSystem.checkTask(1) ? 1 : 0,\n\tc = core.taskSystem.checkTask(2) ? 1 : 0;\ncore.setFlag('@temp@A', a + b + c);\n}"
            },
            {
                "type": "if",
                "condition": "(temp:A>=1)",
                "true": [
                    {
                        "type": "playSound",
                        "name": "xinxinbazhe.mp3"
                    },
                    {
                        "type": "showImage",
                        "code": 2,
                        "image": "star.png",
                        "sloc": [
                            0,
                            0,
                            null
                        ],
                        "loc": [
                            15,
                            50,
                            90,
                            90
                        ],
                        "opacity": 1,
                        "time": 500
                    },
                    {
                        "type": "if",
                        "condition": "(temp:A>=2)",
                        "true": [
                            {
                                "type": "playSound",
                                "name": "xinxinbazhe.mp3"
                            },
                            {
                                "type": "showImage",
                                "code": 3,
                                "image": "star.png",
                                "sloc": [
                                    0,
                                    0,
                                    null
                                ],
                                "loc": [
                                    175,
                                    50,
                                    90,
                                    90
                                ],
                                "opacity": 1,
                                "time": 500
                            },
                            {
                                "type": "if",
                                "condition": "(temp:A>=3)",
                                "true": [
                                    {
                                        "type": "playSound",
                                        "name": "xinxinbazhe.mp3"
                                    },
                                    {
                                        "type": "showImage",
                                        "code": 4,
                                        "image": "star.png",
                                        "sloc": [
                                            0,
                                            0,
                                            null
                                        ],
                                        "loc": [
                                            325,
                                            50,
                                            90,
                                            90
                                        ],
                                        "opacity": 1,
                                        "time": 500
                                    }
                                ],
                                "false": []
                            }
                        ],
                        "false": []
                    }
                ],
                "false": []
            },
            {
                "type": "showImage",
                "code": 5,
                "image": "abstract.png",
                "loc": [
                    40,
                    480
                ],
                "opacity": 1,
                "time": 0
            },
            {
                "type": "moveImage",
                "code": 5,
                "to": [
                    40,
                    20
                ],
                "time": 500
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "drawTextContent",
                "text": "   本次任务十分惊险，商船差点就被\n那些反舰导弹击沉了，幸好有指挥官阁\n下及时击落了那些操控导弹的轰炸机！\n   我们在这些导弹上吃亏也不是一次两\n次了，还好舰队里面跟着小型护航航母，\n多亏她们的战斗机让我们化险为夷。为\n防范敌人的导弹袭击，今后舰队出航一\n定要有空中掩护才行。",
                "left": 60,
                "top": 100,
                "align": "left",
                "fontSize": 20,
                "color": [
                    0,
                    0,
                    0,
                    1
                ]
            },
            {
                "type": "wait"
            },
            {
                "type": "clearMap"
            },
            {
                "type": "submitTask"
            },
            {
                "type": "moveImage",
                "code": 5,
                "to": [
                    40,
                    480
                ],
                "time": 500
            },
            {
                "type": "hideImage",
                "code": 5,
                "time": 0
            },
            {
                "type": "sleep",
                "time": 2000
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "hideImage",
                "code": 1,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 2,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 3,
                "time": 0
            },
            {
                "type": "hideImage",
                "code": 4,
                "time": 0
            },
            {
                "type": "setHeroOpacity",
                "opacity": 0
            },
            {
                "type": "setValue",
                "name": "flag:escort",
                "value": "false"
            },
            {
                "type": "setValue",
                "name": "flag:stage",
                "value": "50"
            },
            {
                "type": "confirm",
                "text": "跳过剧情吗？",
                "yes": [
                    {
                        "type": "changeFloor",
                        "floorId": "MT365",
                        "loc": [
                            3,
                            7
                        ],
                        "direction": "right"
                    }
                ],
                "no": [
                    "1943年9月，萨勒诺登陆战役期间，弗里茨X导弹首次登台亮相。一发导弹命中美国“大草原”号轻巡洋舰，导致近200名水手丧命，该舰也不得不返回船厂修了一整年。",
                    "不久后，英国“厌战”号战列舰也遭遇导弹袭击，一枚导弹精准穿透战列舰的6层甲板，于舰体内部爆炸。另有2枚导弹近失，于战舰舷侧的水下爆炸。“厌战”号的防雷带和一个锅炉舱被毁，5000吨海水涌入。“厌战”号被迫返回马耳他大修9个月。",
                    "另一艘战列舰则没这么幸运。9月9日，意大利宣布退出轴心国的第二天，意大利“罗马”号战列舰正准备向盟军投降。12架携带“弗里茨X”导弹的德军轰炸机突然出现，并发起攻击。",
                    "2枚导弹直接命中战舰的后侧装甲板和二号炮塔，导致战舰发动机停摆，炮塔燃起大火。20分钟后，无法控制的火势蔓延到主炮弹药库，引发剧烈殉爆。很快，这艘战舰带着包括伯冈明尼上将在内的1600余名官兵，一起沉入地中海。",
                    "比起常规轰炸机的炸弹和鱼雷攻击，人为操控的“弗里茨X”显然更加精准，更加致命。导弹的速度远远快过任何一架盟军战斗机，无法拦截。",
                    "起初，它让盟军非常头疼。但很快，盟军就发现了应对之法：战斗机虽然拦不住那些速度超过1000km/h的导弹，但可以轻松对付发射导弹的母机。",
                    "与现代“射后不管”的雷达制导导弹以及能看到“导弹视角”的电视制导炸弹不同，“弗里茨X”能否精准命中，全看轰炸机里的操作手。他们必须全程紧绷神经，死盯着逐渐变成一个小黑点的导弹，同时操纵它飞往正确的方向。稍有不慎，就可能打偏。笨重迟缓，又缺乏护航力量的德军轰炸机显然不能给予操作手一个安然无忧的环境。",
                    "盟军战斗机的一次短点射就可以轻松要了德军轰炸机所有乘员的性命。失去控制的“弗里茨X”很快就会四处乱飞，然后掉进海里。",
                    "总产量2500枚的“弗里茨X”导弹，仅有100枚被用于实战，1944年后就逐步退出战场。德军实在拿不出足够的战斗机为导弹载体保驾护航了，轰炸机飞行员的每一次出击都是通向死亡的“单程票”，不仅无法命中盟军舰船，就连能不能保住小命也得看运气——首先得活着跳伞，其次得活着撑到盟军飞机和舰船路过，最后祈祷对方大发善心，而不是当场送他一颗子弹。",
                    "如果“弗里茨X”是美军的武器，那么它或许可以在太平洋战争剩下的日子里大放异彩。但可惜它出生在日暮途穷的德国，它的命运只有被放在仓库里落满灰尘，等待战争结束后移交给昔日的敌人用于研究。",
                    {
                        "type": "sleep",
                        "time": 500
                    },
                    "回到欧洲战场，盟军几乎解放了法国全境，很快就能踏入德国的领地。",
                    "然而，德军虽然数量处于劣势，兵员战斗素质也越来越差，但架不住虎豹坦克和“铁拳”火箭筒威胁太大，盟军的推进速度仍然达不到高层的预期。",
                    "同时，东边的苏联军队正高歌猛进。“巴格拉基昂”行动过后，德国中央集团军群主力被消灭殆尽，残余力量和临时拼凑的“国民冲锋队”完全无法抵挡苏军的钢铁洪流。英美等西方国家不能接受苏军比自己抢先一步攻入柏林。",
                    "蒙哥马利元帅开始想办法提高推进速度。他集结了数千架飞机和盟军几乎所有的空降力量，打算直接深入敌后，从德军阵线的后方抢夺关键据点。",
                    "他将这个计划命名为：市场花园行动。",
                    {
                        "type": "changeFloor",
                        "floorId": "MT364",
                        "loc": [
                            -1,
                            -1
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "0,7": {
            "floorId": "MT362",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,396, 81,  0,  6,519,590,519,  3,638,638,398,518,360, 21],
    [608,580,  3,360,  3,  0,255,  0,  3,  6,  3,  3,360,  3, 21],
    [384,608,  6,396,  3,  3, 81,  6,  3,374,  0,  0,396,  3,384],
    [  3,  3,  3,  0,  0,670,  0,  0,  0, 81,  3,  3,  6,  3,  3],
    [638,638,373, 81, 21,  3,643,  3,374,  0,360,255,643,643,398],
    [  3,  6,  3,  0,  3,  6,  3,  3, 81,  3,  3,  6,  3,  3,  3],
    [  0, 21,  3,  0,  0,  3,  0,  0,670,  3,636,590,636,  6,  3],
    [ 92,255, 81,373,383, 81,396,  0,  0, 82,255,582,360,384, 89],
    [  0, 21,  3,  0,  3,  3,  3,385,  0,  3,636,590,636,  3,  3],
    [  3,  3,  6,670,643,  6,643,  0,385,  3,  3,  6,  3,  3,524],
    [255,  0,  0,635,  3,  3, 81,  3,  3,  3,  0,  0,398,  3, 22],
    [385, 81,  0,360,  0,  0,396,  0,  3,  0,383,  0,  0,  6, 22],
    [635,  3,  3,  3,  3, 81,  3,  0,  3,360,  3,  3,374,  3, 22],
    [635,  3,637,637,  6,255,  3,  0,  3,  0,  0,  6,  0,  3,580],
    [635,  6,637,637,385,  0,  3,  0, 81,374,  0,  3,  0,383,255]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}