main.floors.MT365=
{
    "floorId": "MT365",
    "title": "布鲁塞尔-前线指挥部",
    "name": "布鲁塞尔-前线指挥部",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "cao6.mp3",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showui"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]如果你对这段历史并不怎么了解，那么在此给你一些温馨提示：请不要选择空降部队！虽然我这么说了以后你大概率会选一下试试，总之别忘存档就行。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "11,7": [
            "\t[参谋,N517]长官，请下达指示！",
            "\t[系统提示]即将进入存档界面",
            {
                "type": "callSave"
            },
            {
                "type": "insert",
                "name": "选择技能"
            },
            {
                "type": "choices",
                "text": "是否立即前往战场？",
                "choices": [
                    {
                        "text": "还没准备好",
                        "action": []
                    },
                    {
                        "text": "现在出发",
                        "action": [
                            {
                                "type": "choices",
                                "text": "请选择你要指挥的部队",
                                "choices": [
                                    {
                                        "text": "空降部队（卸掉所有装备，用轻型单兵武器与敌人对抗）",
                                        "color": [
                                            255,
                                            0,
                                            0,
                                            1
                                        ],
                                        "action": [
                                            {
                                                "type": "unloadEquip",
                                                "pos": 0
                                            },
                                            {
                                                "type": "unloadEquip",
                                                "pos": 1
                                            },
                                            {
                                                "type": "unloadEquip",
                                                "pos": 2
                                            },
                                            {
                                                "type": "unloadEquip",
                                                "pos": 3
                                            },
                                            {
                                                "type": "unloadEquip",
                                                "pos": 4
                                            },
                                            {
                                                "type": "unloadEquip",
                                                "pos": 5
                                            },
                                            {
                                                "type": "unloadEquip",
                                                "pos": 6
                                            },
                                            {
                                                "type": "pauseBgm"
                                            },
                                            {
                                                "type": "setCurtain",
                                                "color": [
                                                    0,
                                                    0,
                                                    0,
                                                    1
                                                ],
                                                "time": 500,
                                                "keep": true
                                            },
                                            {
                                                "type": "changeFloor",
                                                "floorId": "MT366",
                                                "loc": [
                                                    7,
                                                    7
                                                ],
                                                "direction": "down"
                                            }
                                        ]
                                    },
                                    {
                                        "text": "装甲部队（常规作战，与敌人正面较量）",
                                        "action": [
                                            {
                                                "type": "setCurtain",
                                                "color": [
                                                    0,
                                                    0,
                                                    0,
                                                    1
                                                ],
                                                "time": 500,
                                                "keep": true
                                            },
                                            {
                                                "type": "changeFloor",
                                                "floorId": "MT367",
                                                "loc": [
                                                    7,
                                                    14
                                                ],
                                                "direction": "down"
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ],
        "7,4": [
            "\t[维修人员,N514]长官，所有战车准备就绪！",
            {
                "type": "insert",
                "name": "选择坦克"
            }
        ],
        "7,10": [
            "\t[机场后勤,N516]长官，我方空军已就绪！",
            {
                "type": "insert",
                "name": "选择飞机"
            }
        ],
        "4,7": [
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]当前区域敌人特点：大量强力地面部队，存在未知敌人。\n推荐携带技能：破译、补给线、C47空中列车、T34谢尔曼风琴、地毯式轰炸、铝箔条、翼尖挑衅\n推荐出战装备：谢尔曼萤火虫、巴尔的摩号重巡、埃塞克斯级航母、P51野马、P47D雷电、B17空中堡垒。",
            "可以在此清空技能槽，以便于玩家重新选择技能",
            {
                "type": "confirm",
                "text": "清空技能槽？",
                "yes": [
                    {
                        "type": "function",
                        "function": "function(){\nflags.skillList=[0,0,0,0,0,0,0]\n}"
                    }
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  2,  2,  2,  2,  2,  2,  2,  0,  2,  2,  2,  2,  2,  2,  2],
    [  2,30500,30500,  0,  0,  0,  0,  0,  0,  0,  0,  0,30500,30500,  2],
    [  2,30508,30508,  0,  0,  0,  0,  0,  0,  0,  0,  0,30508,30508,  2],
    [  2,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  2],
    [  2,  0,  0,  0,  0,  0,  0,514,  0,  0,  0,  0,  0,  0,  2],
    [  2,  0,  0,  0,10136,10137,10137,10137,10137,10137,10138,  0,  0,  0,  2],
    [  2,  0,  0,  0,10144,10145,10145,10145,10145,10145,10146,  0,  0,  0,  2],
    [  2,  0,  0,  0,10144,10145,10145,10145,10145,10145,10146,517,  0,  0,  2],
    [  2,  0,  0,  0,10144,10145,10145,10145,10145,10145,10146,  0,  0,  0,  2],
    [  2,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  2],
    [  2,90274,90275,  0,  0,  0,  0,516,  0,  0,  0,  0,90274,90275,  2],
    [  2,90282,90283,  0,  0,  0,  0,  0,  0,  0,  0,  0,90282,90283,  2],
    [  2,90290,90291,  0,  0,  0,  0,  0,  0,  0,  0,  0,90290,90291,  2],
    [  2,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  2],
    [  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,556,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,90433,  0,90433,  0,90433,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,90441,  0,90441,  0,90441,  0,  0,  0,  0,  0],
    [  0,  0,  0,90435,  0,  0,  0,  0,  0,  0,  0,90436,  0,  0,  0],
    [  0,  0,558,90443,  0,  0,  0,  0,  0,  0,  0,90444,557,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,10152,10153,10153,10153,10153,10153,10154,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,90434,  0,90434,  0,90434,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,559,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80678,  0,  0,80678,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,80620,  0,  0,80626,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80678,  0,  0,80678,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "陆地"
}