main.floors.MT387=
{
    "floorId": "MT387",
    "title": "前线防御阵地",
    "name": "前线防御阵地",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "snow",
    "bgm": "cao6.mp3",
    "firstArrive": [
        {
            "type": "unloadEquip",
            "pos": 0
        },
        {
            "type": "unloadEquip",
            "pos": 1
        },
        {
            "type": "unloadEquip",
            "pos": 2
        },
        {
            "type": "unloadEquip",
            "pos": 3
        },
        {
            "type": "unloadEquip",
            "pos": 4
        },
        {
            "type": "unloadEquip",
            "pos": 5
        },
        {
            "type": "unloadEquip",
            "pos": 6
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showui"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,13": [
            {
                "type": "animate",
                "name": "zone",
                "loc": "hero"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 0,
                "keep": true
            },
            "闲的没事跑出来踩这些地雷干啥？下辈子注意哦！",
            {
                "type": "restart"
            }
        ],
        "2,14": [
            {
                "type": "animate",
                "name": "zone",
                "loc": "hero"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 0,
                "keep": true
            },
            "闲的没事跑出来踩这些地雷干啥？下辈子注意哦！",
            {
                "type": "restart"
            }
        ],
        "5,14": [
            {
                "type": "animate",
                "name": "zone",
                "loc": "hero"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 0,
                "keep": true
            },
            "闲的没事跑出来踩这些地雷干啥？下辈子注意哦！",
            {
                "type": "restart"
            }
        ],
        "11,14": [
            {
                "type": "animate",
                "name": "zone",
                "loc": "hero"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 0,
                "keep": true
            },
            "闲的没事跑出来踩这些地雷干啥？下辈子注意哦！",
            {
                "type": "restart"
            }
        ],
        "13,14": [
            {
                "type": "animate",
                "name": "zone",
                "loc": "hero"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 0,
                "keep": true
            },
            "闲的没事跑出来踩这些地雷干啥？下辈子注意哦！",
            {
                "type": "restart"
            }
        ],
        "14,12": [
            {
                "type": "animate",
                "name": "zone",
                "loc": "hero"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 0,
                "keep": true
            },
            "闲的没事跑出来踩这些地雷干啥？下辈子注意哦！",
            {
                "type": "restart"
            }
        ],
        "0,1": [
            {
                "type": "insert",
                "name": "退役武器"
            }
        ],
        "4,6": [
            "\t[维修人员,N514]长官，所有战车准备就绪！",
            {
                "type": "insert",
                "name": "选择坦克"
            }
        ],
        "10,6": [
            "\t[机场后勤,N516]长官，我方空军已就绪！",
            {
                "type": "insert",
                "name": "选择飞机"
            }
        ],
        "7,2": [
            "\t[参谋,N517]长官，请下达指示！",
            "\t[系统提示]即将进入存档界面",
            {
                "type": "callSave"
            },
            {
                "type": "insert",
                "name": "选择技能"
            },
            {
                "type": "choices",
                "text": "是否立即前往战场？",
                "choices": [
                    {
                        "text": "还没准备好",
                        "action": []
                    },
                    {
                        "text": "现在出发",
                        "action": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    0,
                                    0,
                                    0,
                                    1
                                ],
                                "time": 500,
                                "keep": true
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT388",
                                "loc": [
                                    7,
                                    0
                                ],
                                "direction": "down"
                            }
                        ]
                    }
                ]
            }
        ],
        "8,2": [
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]当前区域敌人特点：大量强力地面部队，有导弹。\n推荐携带技能：破译、补给线、装甲突击、空中打击、地毯式轰炸、铝箔条、翼尖挑衅\n推荐出战装备：谢尔曼萤火虫、巴尔的摩号重巡、埃塞克斯级航母、P51野马、P47D雷电、B17G空中堡垒。",
            "可以在此清空技能槽，以便于玩家重新选择技能",
            {
                "type": "confirm",
                "text": "清空技能槽？",
                "yes": [
                    {
                        "type": "function",
                        "function": "function(){\nflags.skillList=[0,0,0,0,0,0,0]\n}"
                    }
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,110018,  0,  0,  0,  0,  0,110018,  0,  0,110018,  0,  0],
    [599,  0,  0,  0,  0,  0,  0,110018,  0,  0,  0,  0,  0,  0,110018],
    [  0,110018,  0,  0,  0,  0,  0,517,129,  0,110018,  0,  0,  0,  0],
    [  0,  0,  0,110018,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,110018],
    [110018,  0,  0,  0,  0,  0,  0,110018,  0,  0,  0,  0,110018,  0,  0],
    [  0,  0,110018,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [30509,30509,30509,30509,514,  0,  0,  0,  0,  0,516,30509,30509,30509,30509],
    [30509,30509,30509,30509,30509,30509,  0,  0,  0,30509,30509,30509,30509,30509,30509],
    [  0,  0,  0,  0,30509,30509,30509,  0,30509,30509,30509,30509,  0,  0,  0],
    [30509,30509,30509,  0,  0,30509,30509,  0,30509,30509,  0,  0,  0,30509,30509],
    [160,30509,30509,30509,  0,  0,  0,  0,  0,  0,  0,30509,30509,30509,30509],
    [160,160,30509,30509,30509,30509,30509,  0,30509,30509,30509,30509,30509,160,160],
    [130016,160,160,160,160,30509,30509,  0,30509,160,160,160,160,160,  0],
    [  0,130016,  0,  0,160,160,160,  0,160,160,130016,  0,130016,  0,130016],
    [130016,  0,  0,130016,  0,  0,  0,130016,  0,130016,  0,  0,130016,  0,  0]
],
    "bgmap": [
    [172,  0,  0,  0,  0,  0,172,172,172,  0,  0,  0,  0,  0,  0],
    [172,557,  0,  0,  0,171,172,172,172,  0,  0,  0,  0,  0,  0],
    [172,  0,  0,  0,171,171,  0,172,172,  0,  0,  0,171,  0,  0],
    [  0,  0,  0,171,171,171,  0,559,559,171,171,171,171,171,  0],
    [  0,  0,  0,171,171,  0,  0,  0,  0,  0,171,171,171,171,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,557,  0,  0,  0,558,  0,  0,  0,  0,  0],
    [172,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [172,172,172,172,  0,  0,  0,172,  0,  0,  0,  0,172,172,172],
    [  0,  0,172,172,172,172,  0,172,  0,172,172,172,172,172,  0],
    [  0,  0,  0,  0,172,172,172,172,172,172,172,172,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,172,172,172,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,172,172,172,  0,  0,  0,  0,  0, 11],
    [  0,  0, 11,  0,  0,  0,  0,172,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0, 11,  0,  0, 11,  0,  0,  0,  0,  0, 11,  0, 11,  0]
],
    "fgmap": [

],
    "area": "陆地"
}