main.floors.MT402=
{
    "floorId": "MT402",
    "title": "鲁尔",
    "name": "鲁尔",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "cao6.mp3",
    "firstArrive": [
        {
            "type": "unloadEquip",
            "pos": 0
        },
        {
            "type": "unloadEquip",
            "pos": 1
        },
        {
            "type": "unloadEquip",
            "pos": 2
        },
        {
            "type": "unloadEquip",
            "pos": 3
        },
        {
            "type": "unloadEquip",
            "pos": 4
        },
        {
            "type": "unloadEquip",
            "pos": 5
        },
        {
            "type": "unloadEquip",
            "pos": 6
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showui"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "13,6": [
            "\t[机场后勤,N516]长官，我方空军已就绪！",
            {
                "type": "insert",
                "name": "选择飞机"
            }
        ],
        "7,1": [
            "\t[参谋,N517]长官，请下达指示！",
            "\t[系统提示]即将进入存档界面",
            {
                "type": "callSave"
            },
            {
                "type": "insert",
                "name": "选择技能"
            },
            {
                "type": "choices",
                "text": "是否立即前往战场？",
                "choices": [
                    {
                        "text": "还没准备好",
                        "action": []
                    },
                    {
                        "text": "现在出发",
                        "action": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    0,
                                    0,
                                    0,
                                    1
                                ],
                                "time": 500,
                                "keep": true
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT403",
                                "loc": [
                                    7,
                                    0
                                ],
                                "direction": "down"
                            }
                        ]
                    }
                ]
            }
        ],
        "8,1": [
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]当前区域敌人特点：地面部队配少量空军。\n推荐携带技能：空战王牌、破译、补给线、空中打击、装甲突击、T34谢尔曼风琴、铝箔条\n推荐出战装备：谢尔曼萤火虫、巴尔的摩号重巡、埃塞克斯级航母、P51野马、P47D雷电、B17G空中堡垒",
            "可以在此清空技能槽，以便于玩家重新选择技能",
            {
                "type": "confirm",
                "text": "清空技能槽？",
                "yes": [
                    {
                        "type": "function",
                        "function": "function(){\nflags.skillList=[0,0,0,0,0,0,0]\n}"
                    }
                ],
                "no": []
            }
        ],
        "1,6": [
            "\t[维修人员,N514]长官，所有战车准备就绪！",
            {
                "type": "insert",
                "name": "选择坦克"
            }
        ],
        "8,6": [
            {
                "type": "insert",
                "name": "退役武器"
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [10015,10015,10015,10015,10015,10015,10015,10015,10015,10015,10015,10015,10015,10015,10015],
    [10015,  0,  0,  0,  0,10015,  0,517,129,10015,  0,  0,  0,  0,10015],
    [10015,  0,  0,  0,  0,10015,  0,  0,  0,10015,  0,  0,  0,  0,10015],
    [10015,  0,  0,  0,  0,10015,10015,  0,10015,10015,  0,  0,  0,  0,10015],
    [10015,10015,10015,10015,  0,  0,  0,  0,  0,  0,  0,10015,10015,10015,10015],
    [10015,  0,  0,10015,  0,10015,10015,10015,10015,10015,  0,10015,  0,  0,10015],
    [10015,514,  0,  0,  0,10015,  0,  0,599,10015,  0,  0,  0,516,10015],
    [10015,  0,  0,10015,  0,10015,  0,  0,  0,10015,  0,10015,  0,  0,10015],
    [10015,10015,10015,10015,  0,10015,  0,  0,  0,10015,  0,10015,10015,10015,10015],
    [10015,10015,10015,10015,  0,10015,10015,  0,10015,10015,  0,10015,10015,10015,10015],
    [10015,10015,10015,10015,  0,  0,  0,  0,  0,  0,  0,10015,10015,10015,10015],
    [10015,10015,10015,10015,  0,  0,  0,  0,  0,  0,  0,10015,10015,10015,10015],
    [10015,10015,10015,10015,  0,  0,  0,  0,  0,  0,  0,10015,10015,10015,10015],
    [10015,10015,10015,10015,10015,10015,10015,  0,10015,10015,10015,10015,10015,10015,10015],
    [10015,10015,10015,10015,10015,10015,10015,  0,10015,10015,10015,10015,10015,10015,10015]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,559,559,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,557,  0,  0,  0,  0,  0,  0,  0,  0,  0,558,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,559,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "area": "陆地"
}