main.floors.MT415=
{
    "floorId": "MT415",
    "title": "地图",
    "name": "地图",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "wots1.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "指挥官阁下，尽管我们的核武器给日本造成了巨大伤害，但这些疯子仍然拒绝投降。总统已经亲自批准了对日登陆行动，也就是“没落行动”。",
        "日本人的反抗十分激烈，在他们的本土上作战可能使我们付出几十万伤亡。如有可能，我们不会采取行动，但情报表明，苏联人已经在筹划登陆行动了，这个战果不能分给他们。",
        "准备工作已经开始，在登陆之前，我们必须先夺取制空权。",
        {
            "type": "strokeEllipse",
            "x": 80,
            "y": 400,
            "a": 32,
            "b": 32,
            "angle": 0,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "strokeEllipse",
            "x": 240,
            "y": 400,
            "a": 32,
            "b": 32,
            "angle": 0,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "strokeEllipse",
            "x": 272,
            "y": 304,
            "a": 32,
            "b": 32,
            "angle": 0,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "strokeEllipse",
            "x": 432,
            "y": 304,
            "a": 32,
            "b": 32,
            "angle": 0,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "strokeEllipse",
            "x": 400,
            "y": 240,
            "a": 32,
            "b": 32,
            "angle": 0,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "strokeEllipse",
            "x": 432,
            "y": 80,
            "a": 32,
            "b": 32,
            "angle": 0,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "你的任务是，带领你的空军大队，扫荡本州岛南部、九州和四国岛上的所有机场，确保他们没有空中力量可用。",
        "这对我们的登陆行动至关重要，那些该死的神风特攻队会给我们造成相当大的麻烦。",
        "还有一些未经证实的情报表明，日本人似乎在生产一些试验型号的飞机。如果情报属实，就把他们也摧毁。就这些，祝好运。",
        {
            "type": "clearMap"
        },
        {
            "type": "changeFloor",
            "floorId": "MT416",
            "loc": [
                7,
                3
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [490,490,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [490,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,547],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,565,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,697,  0,697],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,547,  0,697,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,697,565,697,  0],
    [  0,  0,  0,  0,  0,  0,  0,697,  0,697,  0,  0,697,  0,697],
    [  0,  0,  0,  0,  0,  0,  0,  0,565,547,  0,  0,  0,565,547],
    [  0,  0,  0,  0,  0,  0,  0,697,  0,697,  0,  0,697,  0,697],
    [  0,697,547,697,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,565,  0,  0,  0,697,547,697,  0,  0,  0,  0,  0,  0],
    [  0,697,  0,697,  0,  0,  0,697,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,491,491],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,491,491],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,491,491,491],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,491,491,491],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,491,491,491,491],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,491,491,491,491,491],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,491,491,491,491,491],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,491,491,491,491,491],
    [ 16, 16, 16, 16, 16, 16, 16,491,491,491,491,491,491,491,491],
    [ 16, 16, 16, 16, 16,491,491,491,491,491,491,491,491,491,491],
    [ 16, 16, 16,491,491,491,491,491,491,491,491,491,491,491,491],
    [ 16,491,491,491, 16, 16, 16, 16, 16, 16, 16,491,491,491,491],
    [ 16,491,491,491, 16, 16,491,491,491, 16,491,491,491, 16, 16],
    [ 16,491,491,491, 16, 16,491,491,491, 16,491,491,491, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "陆地"
}