main.floors.MT425=
{
    "floorId": "MT425",
    "title": "日本海",
    "name": "日本海",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "medaction1.mp3",
    "firstArrive": [
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]出现新敌人：“樱花”特攻机。实际上是一个导弹，只不过是真·人工智能制导。",
        "\t[系统提示]“樱花”具有“追踪”属性，并且无法以任何形式规避，只能在它撞上你之前将其击落。在攻击力足够之前还是躲着点走吧！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,12": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]小鬼子是真的喜欢鱼雷，你甚至可以看到带了40个鱼雷管的巡洋舰！恐怖如斯。"
        ],
        "6,12": [
            "\f[sakura.png,90,50]二战末期，日本为了挽回败局，最高军事当局曾诱骗和逼迫飞行员坐上“人肉炸弹”——樱花式有人驾驶自杀飞机，与美军舰艇同归于尽。樱花弹的机头部分是一枚1.2吨的TNT弹头，凭借火箭发动机推进，在俯冲时甚至可以达到1040km/h的速度。驾驶员舱门无法从里面打开，更没有起落架，这意味着飞行员不管有没有完成任务，都绝对无法活着回来。",
            "\f[sakura.png,90,50]不过樱花弹航程很短，只有36公里，投放之前必须由一式陆上攻击机载着它飞行，美军只要派战斗机在樱花进入航程之前把轰炸机击落就行了，所以樱花弹实际战果只有击沉1艘驱逐舰。此外，樱花弹速度过快，飞行员在高速俯冲过程中很容易出现黑视甚至昏厥情况，而这一缺陷直到日本投降以后才被美国技术人员发现——因为根本没有飞行员能活着回来报告这一缺陷。也不枉美军给它起的外号——“八嘎弹”"
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT424",
            "loc": [
                7,
                0
            ]
        },
        "7,0": {
            "floorId": "MT426",
            "loc": [
                7,
                14
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [647,646,519,722,671,703,  3, 91,  3,671,519,647,647,  3,646],
    [647,646,519,  3,  3, 82,  3,725,  3, 82,  3,  3,  3,  3,646],
    [  3,  3,  3,  3,  0,712,  3,724,  3,712,  0,717,  0,  3,  0],
    [580,  0,696,717,649,609,696,697,696,609,649,  3,  0,  3,718],
    [  3,  3, 81,  3,  3,  3, 81,  3, 81,  3,  3,  3,518, 81,705],
    [524,519,524,  3,645,645,706, 82,706,645,645,  3,  3,  3,  0],
    [718,  3,  3,  3,711,  3,  3,  3,  3,  3,711,  3,518, 81,705],
    [518,696,  0,  3,648,648,706, 82,706,648,648,  3,  0,  3,518],
    [649,  3,  0,  3,  3,  3, 81,  3, 81,  3,  3,  3,697,  3,518],
    [649,  3,697,  0,  3,713,609,  3,609,  3,713,  3,696,  3,  0],
    [  3,  3,  3,  0,719,  0,695,  0,695,  0,  0,718,  0, 81,721],
    [  0,723, 81,716,  3,  3,  3, 81,  3,  3,716,  3, 81,  3,  3],
    [518,  0,  3,  0,  0,  3,129,716,601,  3,711,  3,721,518,518],
    [695,  3,  3,  3,711,  3,  3,  0,  3,  3,  0,  3,  3,  3,695],
    [ 22,580,  3,518,518,518,  3, 93,  3, 21, 22, 21,  3,580, 22]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}