main.floors.MT448=
{
    "floorId": "MT448",
    "title": "东京",
    "name": "东京",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "bgm4.mp3",
    "firstArrive": [
        {
            "type": "text",
            "text": "\t[朱可夫]\f[zhukov.png,0,310]一位潜伏多年的日共地下组织的同志与我们取得了联系，说有另一位手握日军731部队证据的同志正遭到军国主义狂热分子的追杀。立刻分兵前去营救！",
            "pos": [
                100,
                300,
                380
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,0": {
            "floorId": "MT447",
            "loc": [
                7,
                14
            ]
        },
        "14,7": {
            "floorId": "MT449",
            "loc": [
                0,
                7
            ]
        },
        "7,14": {
            "floorId": "MT450",
            "loc": [
                7,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 21, 21,  2,518,518,518,  2, 91,  2,647,647,648,648,  2, 22],
    [748,  2,  2,  2,690,  2,  2,  0,  2,  2,  2,  2,702,  2,646],
    [  0,646,  2,524,  0,  2, 21,684, 21,  2,  0,684,  0,688,646],
    [646,  0,  2,  0,524,  2, 21,750, 21,  2,750,  2,  2,  2,  2],
    [691,  0,  2,705,  2,  2,  2, 81,  2,  2,  0, 81,690,  2, 21],
    [ 81,  2,  2,687,  0,  2,685,686,685,  2,  0,  2,  0,687, 21],
    [  0,700, 81,  0,  0,690,  0,750,  0,690,684,  2,  2,  2,  2],
    [518,  0,  2,690,  2,  2,  2,  2,  2,  2,  0,  0,691,688, 94],
    [  2,  2,  2,  0,  2,518,518,  2, 22,  2,  2, 81,  2,  2,  2],
    [647,645,  2,749,  2,687,  2,  2,747,  2,  0,688,  0,  2,524],
    [691,  2,  2,687,  2,  0,688,748,  0,747,  0,  2,  0,  2,524],
    [692, 82,  0,684,  2,  0,  2, 82,  2,  0,518,  2,749, 81,700],
    [691,  2,688,  0, 81,747,  2,702,  2,  2,  2,  2,  2,  2,684],
    [647,  2, 81,  2,  2,  2,  2,694,  2,645,648,  0,  2,518,  0],
    [645,  2,705,524,524, 22,  2, 93,  2,645,648,692, 82,  0,518]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}