main.floors.MT451=
{
    "floorId": "MT451",
    "title": "陵园",
    "name": "陵园",
    "width": 15,
    "height": 45,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "down:1"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "left:0"
            ]
        },
        "亚历山大·卡拉法斯\n英国皇家诺森伯兰燧发枪团 中尉\n在敦刻尔克撤退行动中，为掩护大部队撤离，率领连队死守防线。在德军坦克和步兵的反复冲击下，屡次身先士卒发起反冲锋。1940年5月29日，当他像往常一样，又一次的带头冲锋时，被德军机枪击中身亡。他的下属继承了他的遗志，持续作战，为撤退争取了宝贵的时间。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "right:0"
            ]
        },
        "阿奇·麦凯勒\n英国皇家空军第605中队飞行员 中士\n苏格兰人。驾驶机型为“飓风”式战斗机。在1940年8-11月的不列颠空战中，击落至少21架敌机（其中一次单日内就击落5架），成为击落数量最高的“飓风”战斗机飞行员。即便“飓风”在性能上不是德国ME109的对手，他依然多次在己方数量呈劣势的情况下主动迎敌。11月1日，他在拦截轰炸机编队时，单独冲入敌阵击落2架敌机后，被德军战斗机击落，在肯特郡机毁人亡。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "down:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "left:0"
            ]
        },
        "弗雷德里克·巴洛\n英国皇家海军“哈迪”号驱逐舰 轮机舱高级士官\n1940年4月10日，在挪威纳尔维克海战中，所在战舰遭受德军围攻，重创起火。他在轮机舱被淹，浓烟弥漫的绝境中，仍然坚守岗位20分钟，确保引擎动力输出，使驱逐舰完成了关键机动，发射鱼雷击伤敌军。最后舰长下令全舰弃船时，他命令自己的部下先行撤离，自己却因体力不支，被困舱内，与战舰一起沉入大海。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "right:0"
            ]
        },
        "约翰尼·沃克\n英国皇家海军第2护航大队指挥官 上校\n发明“沃克绞杀”战术，被称为反潜战术天才。1941-1944年，指挥护航舰队击沉至少20艘U型潜艇，保护了大西洋生命线。他经常亲临一线指挥每一场战斗，长期高强度工作，甚至晕倒后仍拒绝离岗。1944年7月，他在极度的疲惫中合上了双眼，再也没有醒过来。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "down:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "left:0"
            ]
        },
        "罗伯特·亨利·奎恩\n澳大利亚第9步兵师第2/17步兵营 下士\n1942年7月，阿拉曼战役前期，泰尔艾萨岭战役中，其阵地遭德军猛攻，所在的排死伤殆尽。他独自一人操作一挺机枪，穿梭于沙丘之间，阻挡德军连级进攻数个小时。弹药耗尽后，用刺刀和手榴弹发起最后的冲锋，在炸毁一辆半履带车后英勇牺牲，为援军争取了时间。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "right:0"
            ]
        },
        "帕特里克·梅恩\n英国SAS特种空勤团创始人之一兼指挥官 上校\n北非战役期间，率领SAS小队深入敌后数百公里，破坏德意联军的空军基地和补给线，曾徒手击毙哨兵并摧毁数十架飞机。在一次行动中，为战友的牺牲而愤怒，单枪匹马夜袭德军机场，炸毁22架飞机并全身而退。这位猛士活过了战争，却在战后死于车祸。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "down:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "left:0"
            ]
        },
        "查尔斯·库尔茨\n美国陆军第36步兵师第143步兵团 下士\n意大利卡西诺山战役期间，强度拉皮多河时，美军在德军火力打击下死伤惨重。库尔茨多次往返冰冷的河水，冒着炮火架设浮桥、排除地雷。桥梁被毁后，自愿泅渡运送缆绳，重建桥梁，期间不幸被子弹击中，倒在了河里，用生命为后续部队铺开了道路。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "right:0"
            ]
        },
        "托马斯·德瑞克\n澳大利亚第9步兵师第2/48步兵营 二等兵\n维多利亚十字勋章获得者。1945年5月1日，在意大利塔拉蒂山脊的战斗中，独自攀爬陡坡，用手榴弹清除了5个碉堡，几乎凭一己之力夺取了关键高地。次日清理残敌时，遭狙击手伏击重伤。他拒绝了战友的救援，完成简报后牺牲。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "down:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "left:0"
            ]
        },
        "约瑟夫·拜尔勒\n美国陆军第101空降师506伞兵团F连 列兵\n1944年6月6日（D-Day），在诺曼底跳伞后偏离预定目标，被挂在一座教堂的塔尖上，伪装成尸体躲避了德军的搜索。1944年9月，市场花园行动中，被德军俘虏，数次奇迹般侥幸逃脱，并被苏军救下。随后坚持与苏军并肩作战。1945年4月，不幸踩中地雷牺牲，此时距战争结束仅剩几周。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "right:0"
            ]
        },
        "卡尔·帕克\n美国陆军第299工兵战斗营 一等兵\n1944年6月6日（D-Day），在诺曼底奥马哈海滩，与战友一同顶着密集火力，连续破坏多个障碍物。当他发现战友被困后，不顾自身安危，冲回危险区域营救，在此过程中被机枪击中。弥留之际，他留下的遗言是：“告诉我的父亲，我尽了最大努力。”",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "down:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "left:0"
            ]
        },
        "罗伯特·M·麦克唐纳\n美国陆航第406战斗机大队第513战斗机中队飞行员 少尉\n驾驶机型为P-47“雷电”。1945年3月，在德国执行对地攻击任务期间，飞机被高射炮击伤，发动机起火。当他正要跳伞时，发现飞机正失控冲向一个德国村庄，于是放弃跳伞机会，用最后的力气将飞机路径偏离村庄。最后，这个村庄得救了，罗伯特本人却与战机一同坠毁在村庄边缘的田野中。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "right:0"
            ]
        },
        "奥迪·墨菲\n美国陆军第3步兵师第15步兵团排长 中尉\n1945年1月，阿登战役期间，率部防守关键林地，遭遇6辆德军坦克和2个步兵连。他命令伤兵撤退，自己跳上一辆正在燃烧的M10坦克歼击车，用车顶的12.7mm机枪压制敌军步兵近一个小时，以及呼叫火炮支援摧毁坦克。最终他独自一人击退了整波进攻，身负重伤，但是幸存了下来。据说“美国队长”的原型就是他。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "down:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "left:0"
            ]
        },
        "维尔纳·兰普雷希特\n德国非洲军团第21装甲师参谋 上尉\n1943年5月，突尼斯战役末期，德军已经崩溃。面对阿尼姆的“焦土政策”命令，他拒绝执行，并私下通知民众保护水源和设施，将未销毁的补给点位置透露给英军，保护了当地民众生命以及沙漠中宝贵的资源。后被盟军俘虏，战后获释。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "right:0"
            ]
        },
        "汉斯·绍尔&苏菲·绍尔\n“白玫瑰”学生抵抗运动成员（德国）\n慕尼黑大学的学生，兄妹关系。拒绝与纳粹同流合污，也不愿沉默。与朋友一同组成“白玫瑰”组织，撰写、印刷、发布反纳粹传单，号召德国人民觉醒，传递人道主义思想。1943年2月被捕后遭到处决。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "down:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "left:0"
            ]
        },
        "约瑟夫·“塞普”·甘格尔\n德国国防军第136山地步兵师指挥官 少校\n1945年5月，德国投降前5天，主动联络附近的美军，请求支援以保护“伊特城堡”中关押的法国政要和战俘免受党卫军的屠杀。于是两支“敌对势力”组成了联军，共同抵抗党卫军攻击，甚至战俘们也自发加入战斗。作战期间，为保护法国前总理保罗·雷诺，用自己的身体挡住了狙击手的子弹。断气之前，他说道：“这次是为正义而战”。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 0,
            "steps": [
                "right:0"
            ]
        },
        "迪特里希·冯·肖尔蒂茨及其下属预备役军官们\n德军驻巴黎城防部队\n1944年巴黎解放前夕，希特勒下令将巴黎“变成一片废墟”，作为城防司令的肖尔蒂茨对此犹豫不决，其下属一些预备役军官也积极劝说其违抗这条命令。最终，他们下定决心，故意拖延执行命令，销毁和篡改文件，与法国抵抗组织秘密接触，传递信息，寻求避免大规模破坏的途径。他们的行为在战后被认为是保护巴黎的关键。最终这些人多数幸存了下来。",
        {
            "type": "animate",
            "name": "silence",
            "loc": "hero"
        },
        {
            "type": "moveHero",
            "time": 1000,
            "steps": [
                "down:1"
            ]
        },
        {
            "type": "setViewport",
            "loc": [
                0,
                30
            ],
            "time": 5000,
            "async": true
        },
        {
            "type": "sleep",
            "time": 3000
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true,
            "async": true
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "setViewport",
            "loc": [
                0,
                0
            ]
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "black.png",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 0
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "第二次世界大战，共有61个国家参战，约20亿人口被卷入战争。\n占世界总人口80%以上。",
            "loc": [
                100,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "从1931年9月18日开始，直至1945年9月2日。\n这场战争夺去了7000万人的生命，1.3亿人受伤。",
            "loc": [
                150,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "与第一次世界大战不同\n士兵们不是为了政客的利益而战\n而是为了保护自己的家园、亲人和朋友",
            "loc": [
                200,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "没有人能够保证自己一定能活着回家\n也没几个人知道这场战争能不能打赢\n但同盟国的战士们仍然义无反顾地争相奔赴战场\n哪怕自己接到的是一个必死的任务",
            "loc": [
                200,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "无论国家，无论民族\n无关肤色，无关性别\n为了从法西斯的暴政中挽救自己的家园\n他们用各自的方式不停战斗着",
            "loc": [
                200,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "他们当中\n有的人不惧死亡\n有的人战力高强\n还有的人听见枪声就会抱头蹲防\n但他们每个人都在贡献着自己的力量",
            "loc": [
                200,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "他们在前线奋战\n他们在后方忙碌\n他们在民间抵抗\n他们在敌营潜伏",
            "loc": [
                200,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "直到自己的身体逐渐冰冷\n直到敌人被消灭殆尽\n直到家园恢复昔日的宁静\n直到人们可以自由行走在阳光下",
            "loc": [
                150,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "也许他们没有一骑当千的实力\n也许他们没有读档重来的机会\n也许他们看不见对手的属性值\n也许他们没能看到明天的太阳\n也许他们甚至不知道\n自己的所作所为有没有意义",
            "loc": [
                150,
                150
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "但这恰恰表明了\n他们才是",
            "loc": [
                200,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "setText",
            "position": "down",
            "offset": 10,
            "bold": false,
            "text": [
                255,
                0,
                0,
                1
            ],
            "background": "15.png",
            "textfont": 50,
            "time": 40
        },
        {
            "type": "showTextImage",
            "code": 2,
            "text": "真正的勇者",
            "loc": [
                150,
                200
            ],
            "lineHeight": 1.4,
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 5000
        },
        {
            "type": "hideImage",
            "code": 2,
            "time": 500
        },
        {
            "type": "setText",
            "position": "down",
            "offset": 10,
            "bold": false,
            "text": [
                255,
                255,
                255,
                1
            ],
            "background": "15.png",
            "time": 40
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "showImage",
            "code": 2,
            "image": "end11.jpg",
            "sloc": [
                0,
                0,
                null
            ],
            "loc": [
                0,
                0,
                null
            ],
            "opacity": 1,
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [100009,100010,100010,100010,100010,100010,  0,  0,  0,100010,100010,100010,100010,100010,100011],
    [100017,10199,10199,10199,10199,10199,10199,  0,10199,10199,10199,10199,10199,10199,100019],
    [100017,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100019],
    [100017,10199,10199,10199,10199,10199,10199,  0,10199,10199,10199,10199,10199,10199,100019],
    [100017,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100019],
    [100017,10199,10199,10199,10199,10199,10199,  0,10199,10199,10199,10199,10199,10199,100019],
    [100017,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100019],
    [100017,10199,10199,10199,10199,10199,10199,  0,10199,10199,10199,10199,10199,10199,100019],
    [100017,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100019],
    [100017,10199,10199,10199,10199,10199,10199,  0,10199,10199,10199,10199,10199,10199,100019],
    [100017,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100019],
    [100017,10199,10199,10199,10199,10199,10199,  0,10199,10199,10199,10199,10199,10199,100019],
    [100017,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100019],
    [100017,10199,10199,10199,10199,10199,10199,  0,10199,10199,10199,10199,10199,10199,100019],
    [100017,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100019],
    [100017,10199,10199,10199,10199,10199,10199,  0,10199,10199,10199,10199,10199,10199,100019],
    [100017,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100017,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,10199,100019],
    [100025,100026,100026,100026,100026,100026,100026,100026,100026,100026,100026,100026,100026,100026,100027]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地",
    "bgm": "pearlharbor.mp3",
    "weather": [
        "sun",
        8
    ]
}