main.floors.MT63=
{
    "floorId": "MT63",
    "title": "爱尔兰西部海域",
    "name": "爱尔兰西部海域",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "wots1.mp3",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:escort",
            "value": "true"
        },
        {
            "type": "setValue",
            "name": "flag:友军血量",
            "value": "300000"
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\r[yellow]Mission 10 保卫船队",
        "\t[盟军指挥官,hero]已完成任务交接，所有舰船保持队形，注意搜索敌人。",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]进入新章节，本章主要内容是海战，地图大多都是海洋地图。",
        "\t[系统提示]你的主要敌人是德国和意大利海军。其中，德国海军以潜艇为主，意大利以水面舰艇为主。",
        "\t[系统提示]德国没有多少水面战舰，但他们的每一艘战舰都是以质取胜的“精英怪”，而意大利军舰主要是扮演数量相对较多但战力较弱的“杂兵”。",
        "\t[系统提示]敌舰大多是“攻低血厚”的类型，增加攻击力以减少回合数有时减伤效果并不理想，可以尝试一些百分比减伤手段，或是使用暴击型伤害（例如鱼雷、反潜深水炸弹、大口径主炮等）瞬间减少大量敌军生命值。",
        "\t[系统提示]此外，海军是一种“能在几小时内输光几十年家底”的兵种，可能上述两个国家的所有海军加起来都不够一个区域的怪物总量。因此，本游戏设定：玩家击败的海军类普通敌人，绝大多数是“暂时受伤退出战场”而非直接沉没。偶尔会出现“设定上已经被击沉的军舰重新出现在战斗地图中”的情况，也是为了游戏性考虑。玩过碧蓝航线的玩家可以当作是量产型战舰一类的设定。",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]敌人战力重置中",
        {
            "type": "setEnemy",
            "id": "u7",
            "name": "hp",
            "value": "1000",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "u7",
            "name": "top",
            "value": "2500"
        },
        "\t[系统提示]敌人战力重置完成",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "setValue",
            "name": "flag:第十关通关",
            "value": "0"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐通过当前区域\n⭐友军剩余血量大于15w\n⭐击退至少1艘敌军重型巡洋舰",
        {
            "type": "callBook"
        },
        {
            "type": "setTask",
            "name": "第十关任务1",
            "n": 1,
            "text": "通过当前区域",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "第十关通关",
                    "operator": "=",
                    "text": "抵达终点",
                    "count": "1"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第十关任务2",
            "n": 1,
            "text": "友军剩余血量大于15w",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "友军血量",
                    "operator": ">=",
                    "text": "友军血量剩余",
                    "count": "150000"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第十关任务3",
            "n": 1,
            "text": "击退至少1艘重巡",
            "info": [
                {
                    "type": "killType",
                    "killType": "重巡",
                    "floorId": [
                        "MT63",
                        "MT64",
                        "MT65",
                        "MT66",
                        "MT67"
                    ],
                    "operator": ">=",
                    "text": "已击退的重巡洋舰",
                    "count": 1
                }
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "teach9.png",
            "sloc": [
                0,
                0,
                null
            ],
            "loc": [
                20,
                102,
                440,
                275
            ],
            "opacity": 1,
            "time": 500
        },
        {
            "type": "wait"
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 500
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,9": [
            {
                "type": "text",
                "text": "\t[伊吹萃香]\f[specialnpc.jpg,0,280,100,200]对付以鱼雷攻击为主要攻击方式的敌人时，“Z字规避”是个相当值的技能，只不过花费有点高，要把技能用在刀刃上！例如那些讨厌的潜艇……",
                "pos": [
                    100,
                    280,
                    380
                ]
            }
        ]
    },
    "changeFloor": {
        "14,7": {
            "floorId": "MT64",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [567,  3,  0,210,  0,  3,566,566,  3,527,  3,529,529,  3,530],
    [  0,385,  0,  3, 21,  3,  3,210,  3,527,211,  0,  0,  3,532],
    [216,  3,  3,  3,  0,385,  0,  0, 81,385,  0,  3,216,  0,  0],
    [518,518,  3,566,566, 81,  3, 21,  0,  3, 21,  3,  3, 81,  3],
    [ 22, 22, 81,  0,  3,  0,  3,  3,234,  3,  3,526,  0,385,525],
    [  3,  3,  3,  3,  3,  0,216, 21, 21,216,  0,  3, 81,  3,  3],
    [567,567,567,  3,210,  0,  3,211,  3,  3,  0,385, 21,216,  0],
    [  0,  0,  0, 86,  0,  3,  3,527,  3,  0,385,  3, 21, 81, 94],
    [567,567,567,  3,  0,566, 81,527,  3,566,  3,  3, 81,  3,  3],
    [601,  3,  3,  3,211,  3,  3, 81,  3, 81,  3,526,  0,216,  3],
    [525,  3, 21,  3,  0,385,  0,  0,210,  0,210,526,  3,  0,528],
    [528,210,210, 81, 21,  3, 81,  3,  3, 81,  3,  3,  3, 81,  3],
    [525,  3, 21,  3,  0,  3,210, 21,  3, 81,  3,529,529,  0, 21],
    [  3,  3, 82,  3,  3,525,525,  3,  0,234,528,  3,  3,210,  3],
    [567,567,567,  3,525,525,  3,  3, 21,  3,528,528,  3,525,525]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [  3, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}