main.floors.MT70=
{
    "floorId": "MT70",
    "title": "地中海",
    "name": "地中海",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "hitman.mp3",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "function",
            "async": true,
            "function": "function(){\ncore.ui.mission.mis('MISSION 11', '奇袭塔兰托', core.doAction);\n}"
        },
        {
            "type": "text",
            "text": "\t[坎宁安]\f[cunningham.jpg,0,310]指挥官阁下，我的战列舰编队会在侧翼为你提供掩护，你只要专心解决正面的敌人即可。",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[坎宁安]\f[cunningham.jpg,0,310]尽可能消灭敌人的有生力量，我们需要保证奇袭的突然性，不能让敌人有通风报信的机会。",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]敌人战力重置中",
        {
            "type": "setEnemy",
            "id": "italydd1",
            "name": "hp",
            "value": "9000",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italydd1",
            "name": "atk",
            "value": "100",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italydd2",
            "name": "hp",
            "value": "10000",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italydd2",
            "name": "atk",
            "value": "120",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italydd2",
            "name": "top",
            "value": "2500",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italydd3",
            "name": "hp",
            "value": "10000",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italydd3",
            "name": "atk",
            "value": "140",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italydd3",
            "name": "top",
            "value": "3000",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italycl1",
            "name": "hp",
            "value": "25000",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italycl1",
            "name": "atk",
            "value": "240",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italycl1",
            "name": "top",
            "value": "1500",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italyca1",
            "name": "hp",
            "value": "60000",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italyca1",
            "name": "atk",
            "value": "550",
            "norefresh": true
        },
        {
            "type": "setEnemy",
            "id": "italyca1",
            "name": "top",
            "value": "1500"
        },
        "\t[系统提示]敌人战力重置完成",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "setValue",
            "name": "flag:第11关通关",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "flag:装备光辉号",
            "value": "0"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐成功袭击塔兰托港\n⭐击败所有拦路之敌\n⭐光辉号航空母舰全程参与战斗",
        {
            "type": "callBook"
        },
        {
            "type": "setTask",
            "name": "第11关任务1",
            "n": 1,
            "text": "成功袭击塔兰托港",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "第11关通关",
                    "operator": "=",
                    "text": "空袭结束",
                    "count": "1"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第11关任务2",
            "n": 1,
            "text": "击败所有拦路之敌",
            "info": [
                {
                    "type": "killAll",
                    "floorId": [
                        "MT70",
                        "MT71",
                        "MT72",
                        "MT73"
                    ],
                    "text": "剩余的拦路之敌"
                }
            ]
        },
        {
            "type": "setTask",
            "name": "第11关任务3",
            "n": 1,
            "text": "光辉号航空母舰全程参与战斗",
            "info": [
                {
                    "type": "checkFlag",
                    "checkFlag": "装备光辉号",
                    "operator": "=",
                    "text": "装备光辉号完成战斗",
                    "count": "1"
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,8": [
            "\f[cr42.jpg,90,50]菲亚特CR.42“猎鹰”战斗机是二战时期意大利空军最好的双翼战斗机。研发时，意大利空军的思想仍停留在一战，认为转弯能力优秀的双翼机比高速的单翼战斗机更重要。在双翼飞机中，CR.42确实优秀，但二战已经是单翼战斗机的主场，在北非作战的CR.42在与英国“飓风”等单翼战斗机作战时明显处于下风。最终在1942年停产。"
        ]
    },
    "changeFloor": {
        "14,7": {
            "floorId": "MT71",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [526,526,360,526,526,212,528,528,  3,518,  3,566,566,  3,580],
    [  3,  3, 82,  3,  3, 81,  3,  3,  3,518,  3,  0,  0,211,  0],
    [527,  3,  0,529,  3,  0,  3,529,  3,518,234, 81,  3,  3,360],
    [527,211,525,  0,210,  0,210,  0,529,  3,  3,  0,  3,518,518],
    [527,  3,  3,  3,  3,  0,  3,576,  3,  3,525,  0,  3,  3,  3],
    [527,  3,567,567,  3,  0,  3,  0,  0,  3,  3,576, 81,526,526],
    [  3,  3,567,567,  3,210,  3,  3,210, 81,525,  0,210,  3,  3],
    [  0,  0,  0,  0, 86,360, 81,529,529,  3,  3,  3,  0, 81, 94],
    [  3,  3,567,567,  3,210,  3,  3,210,  0,  3,  0,210,  3,  3],
    [ 21,  3,567,567,  3,  0,  3,526,  3,529,234,576, 81,526,526],
    [ 21,  3,  3,  3,  3,  0,234,  0, 81,  0,  3, 81,  3,  3,  3],
    [ 21, 81,  0,  0,211,  0,  3,576,  3,  3,  3,234, 82,572,572],
    [  3,526,  0,  3,526,  3, 22,  0, 82,566,566,360,  3,572,572],
    [  3,  3,211,  3, 81,  3,  3,210,  3,  3, 81,  3,  3,  3,  3],
    [527,527,528,527,527,  3,529,529,529,  3,212,525,525,525,525]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,10163,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "海洋"
}