main.floors.MT89=
{
    "floorId": "MT89",
    "title": "大西洋",
    "name": "大西洋",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "hiaction6.mp3",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "forbidSave"
        },
        "\r[yellow]Mission 14 追击俾斯麦",
        "\t[盟军指挥官,hero]失去胡德号对我们而言是个沉痛的打击，但我们必须迅速振作起来。",
        "\t[盟军指挥官,hero]总部已经得知这个噩耗，相信他们很快便会派遣增援来为胡德号复仇。",
        "\t[盟军指挥官,hero]在那之前，我们必须紧跟俾斯麦号，将其行踪持续上报给总部。",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐跟踪俾斯麦号战列舰\n⭐通关时至少持有30个下午茶\n⭐通关时至少持有10把蓝钥匙",
        {
            "type": "callBook"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "14,5": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]是不是感觉潜艇的伤害降低了些？因为大型战舰难以躲避鱼雷，当你装备着大型战舰的时候，受到潜艇的雷击伤害就会大幅提升。而现在失去了胡德号，你剩下的小型舰艇就更容易躲开鱼雷，所以潜艇的伤害就没那么恐怖了。",
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]但凡事借有利弊。失去大型战舰的强大火力，其他敌舰的伤害反而被大幅提升。所以说，以后可不能因为害怕潜艇，就干脆不装备大型军舰了，因噎废食的事可别干。"
        ]
    },
    "changeFloor": {
        "0,7": {
            "floorId": "MT90",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 22, 22,  3,567,567,360,  3,  3,566,210,  0,528,360,  0,  0],
    [360,  3,  3,  3,  3,527,527,  3,566,  3,528,  0,  3,  3, 81],
    [  0,  0,216,  3,  0,397,  3,525,216,  0,216,  3,  3,528,240],
    [  3,  3, 81,  3,  3, 81,  3,  3, 81,  3, 81,  3,529,360,  3],
    [526,566,211,  0,  3,  0,567,567,  0,  3,  0,  0,  3,526,526],
    [526,526,  3,  0,360,210,  3,  3,  3,528,360,  3,  3,  3,601],
    [  3,  3,  3,210,  3,  0,211,527,  3,  3,216,  0,  3,526,526],
    [ 92,255, 81,  0,  3,  3,  3,527,  3,529,  3,  0, 86,  0,  0],
    [  3,  3,  0,  3,527,527, 82,527, 81,529,  3,210,  3,526,526],
    [526,360,  0,360,234,527,  3,  3, 81,211,360,  0,  3,  3,  3],
    [  3,  3,211,  3,529,  3,  0,567,212,  3,  0,528,  3,572,572],
    [525,  3,  0,529, 82,529,234,567,  0,  3,  3, 81,  3,211,  0],
    [525,  3,  0,  3,529,  3, 81,  3, 81,216,  3,240, 82,255,211],
    [525,  3,216,  3,525,  3,216,  3,  3,234,  3,518,  3,211,  0],
    [240, 81,  0,360,525,  3, 21, 21, 21, 21,  3,518,  3,572,572]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,  3],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}