main.floors.MT93=
{
    "floorId": "MT93",
    "title": "大西洋",
    "name": "大西洋",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "hiaction6.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "resumeBgm"
        },
        {
            "type": "moveHero",
            "time": 500,
            "steps": [
                "left:2"
            ]
        },
        {
            "type": "setCurtain",
            "color": [
                255,
                255,
                255,
                1
            ],
            "time": 200,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    7
                ]
            ],
            "remove": true
        },
        {
            "type": "setCurtain",
            "time": 200
        },
        {
            "type": "animate",
            "name": "wonder",
            "loc": "hero",
            "async": true
        },
        {
            "type": "jumpHero",
            "time": 50
        },
        {
            "type": "moveHero",
            "steps": [
                "up:0"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "steps": [
                "down:0"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "steps": [
                "left:0"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "steps": [
                "right:0"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "steps": [
                "left:0"
            ]
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "胡德号沉没的消息迅速传遍了英国。这艘参与过一战的功勋舰是英国皇家海军的骄傲，更是他们的象征。",
        "早有人指出胡德号的关键部位缺少装甲防护，因此，英国皇家海军本打算在胡德号执行这次任务回来时就给她升级装甲，没想到，这竟成了她的临终flag。",
        "丘吉尔直接下令，不惜一切代价击沉俾斯麦号。很快，附近海域所有能用的军舰，无论正在执行什么任务，全部立即终止，加入围剿俾斯麦号的大军里。",
        "6艘战列舰，2艘航空母舰，13艘巡洋舰，21艘驱逐舰和其他辅助舰艇，从四面八方扑向俾斯麦号的方位。这是皇家舰队近半数的实力，他们誓要将俾斯麦号从海面上彻底抹除。",
        "此时的俾斯麦号在先前的战斗中被命中了几次，雷达受损，一座锅炉损毁，泄露的燃油在海面上留下一道痕迹，给身后的追兵提供了机会。",
        "次日清晨，来自“胜利”号航空母舰的鱼雷机向俾斯麦号发起鱼雷袭击，命中一枚鱼雷。俾斯麦号已经承受了较多损伤，继续执行任务风险太大，必须返航。",
        "于是，俾斯麦号与欧根亲王号分开，前往法国布雷斯特港口。在那之后，俾斯麦号利用英舰雷达盲区，一个转身摆脱了追击，彻底从英军的视线下消失。",
        "跟丢俾斯麦号使整个皇家海军陷入焦虑当中，军舰和侦察机发了疯一样的寻找俾斯麦号的踪影，情报部门也紧张地监听着一切可能来自俾斯麦号的无线电讯息。",
        "终于，5月26日上午10点，一架美制卡特琳娜式侦察机发现了俾斯麦号，此时俾斯麦号已经快要进入德国空军的航程，只要到达那个地方，英军的追击将彻底失败。",
        "没有任何一艘英国战舰能及时追上俾斯麦号——但航母的舰载机可以。俾斯麦号此时正好在英国“皇家方舟”号航母的射程之内。这艘本是过来凑数的航母立刻转变成为战场的焦点。",
        {
            "type": "showImage",
            "code": 1,
            "image": "attackbismark.jpg",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 0
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        "818中队操纵着老旧的剑鱼式鱼雷机从航母甲板上滑翔而出，顶着猛烈的炮火飞向俾斯麦号。他们是拦住俾斯麦号最后的微薄希望。",
        "然而，奇迹再次降临。虽然15枚鱼雷中只有2枚击中俾斯麦号，但其中一枚正好命中了舰尾的位置，将舵机卡死，无法修复。",
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 500,
            "keep": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 0
        },
        "舵机受损的俾斯麦号只能原地转圈，绝望地看着近在咫尺的安全区离自己越来越远。冈瑟·吕特晏斯上将清楚地意识到，俾斯麦号已然无力回天，唯一的选择，便是死战到底。",
        {
            "type": "changeFloor",
            "floorId": "MT94",
            "loc": [
                7,
                3
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,333,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}