main.floors.prepare1=
{
    "floorId": "prepare1",
    "title": "法国边境-营地",
    "name": "法国边境-营地",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground4",
    "bgm": "cao6.mp3",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:cri",
            "value": "true"
        },
        {
            "type": "setValue",
            "name": "item:I600",
            "operator": "+=",
            "value": "1"
        },
        {
            "type": "setValue",
            "name": "flag:hitice",
            "value": "true"
        },
        {
            "type": "setValue",
            "name": "flag:lighton",
            "value": "true"
        },
        {
            "type": "setValue",
            "name": "item:I335",
            "operator": "+=",
            "value": "1"
        },
        {
            "type": "setValue",
            "name": "item:I746",
            "operator": "+=",
            "value": "1"
        },
        {
            "type": "setValue",
            "name": "status:hp",
            "value": "1000",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:hpmax",
            "value": "2000",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:mana",
            "value": "0",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:atk",
            "value": "10",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:arm",
            "value": "0",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:top",
            "value": "100",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:tpn",
            "value": "0",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:dod",
            "value": "0",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:mdef",
            "value": "0",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0",
            "norefresh": true
        },
        {
            "type": "setValue",
            "name": "status:exp",
            "value": "0"
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showui"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]现在是战前准备阶段。你可以在此选择本区域作战的出场装备和技能。战斗开始后，将无法回到此地。后面的区域也都会有这样的准备阶段。",
        "\t[系统提示]绿色箭头指向的NPC们可以帮助你装上装备，或是选择出战的技能。准备完成后，可以在参谋\\i[N517]处正式开始游戏。",
        {
            "type": "function",
            "function": "function(){\ndebugger\nflags.learned[1] = true\n}"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]\r[aqua]经费不足，某些地图画出来的效果可能非常不理想，还请谅解下，凑合玩吧。\r",
        {
            "type": "if",
            "condition": "(flag:难度===1)",
            "true": [
                {
                    "type": "playSound",
                    "name": "xinxinmagic.mp3"
                },
                "\t[系统提示]检测到当前难度为神剧，请查收您的神剧难度福利！",
                {
                    "type": "setValue",
                    "name": "item:hard1",
                    "operator": "+=",
                    "value": "1"
                },
                {
                    "type": "setValue",
                    "name": "item:coin",
                    "operator": "+=",
                    "value": "1"
                }
            ],
            "false": [
                {
                    "type": "if",
                    "condition": "(flag:难度===2)",
                    "true": [
                        {
                            "type": "playSound",
                            "name": "xinxinmagic.mp3"
                        },
                        "\t[系统提示]检测到当前难度为街机，请查收您的街机难度福利！",
                        {
                            "type": "setValue",
                            "name": "item:hard2",
                            "operator": "+=",
                            "value": "1"
                        },
                        {
                            "type": "setValue",
                            "name": "item:coin",
                            "operator": "+=",
                            "value": "1"
                        }
                    ]
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,7": [
            "\t[机场地勤,N516]抱歉长官，您尚未解锁任何可用空军单位。"
        ],
        "12,2": [
            "\t[维修人员,N514]抱歉长官，您现在还没有指挥装甲部队的权利。"
        ],
        "12,9": [
            "\t[参谋,N517]长官，请下达指示！",
            "\t[系统提示]即将进入存档界面",
            {
                "type": "callSave"
            },
            {
                "type": "insert",
                "name": "选择技能"
            },
            {
                "type": "choices",
                "text": "是否立即前往战场？",
                "choices": [
                    {
                        "text": "还没准备好",
                        "action": []
                    },
                    {
                        "text": "现在出发",
                        "action": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    0,
                                    0,
                                    0,
                                    1
                                ],
                                "time": 500,
                                "keep": true
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT1",
                                "loc": [
                                    0,
                                    7
                                ]
                            }
                        ]
                    }
                ]
            }
        ],
        "14,9": [
            "\t[系统提示]这个牌子是为帮助玩家选择接下来的战斗中要使用的技能，每一个像这样的准备楼层，系统都会在这个牌子上提供部分关于当前区域的敌人信息，以及推荐选用的技能、装备等，供玩家参考。",
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]当前区域敌人特点：步兵居多，伴随少量轻型火炮、轻型坦克和飞机。\n推荐携带技能：战壕\n推荐出战装备：无"
        ],
        "11,2": [
            "坦克车间\n（选择出战的坦克类装备）"
        ],
        "4,6": [
            "机场\n（选择出战的空军类装备）"
        ],
        "11,8": [
            "盟军作战指挥室\n（选择技能以及开始游戏）"
        ],
        "7,11": [
            "前方为跳关系统。由于本塔流程较长，为减轻玩家负担，可以使用该系统直接跳转至您想要开始游玩的章节。跳转至对应章节后，系统将按照官方存档（即作者本人在历史难度下抵达该章节时的状态）重置玩家的属性值和道具（难度福利不会消失）。",
            "需注意：跳关系统仅可在此处使用，不会跳转至附加章节。且跳转章节后，前面的关卡视为任务均未完成，不计入分数。"
        ],
        "8,14": [
            {
                "type": "insert",
                "name": "跳关系统"
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [120054,120055,  0,  0,  0,80650,80651,80650,80651,140085,140086,140087,140088,  0,140085],
    [120098,120099,120100,  0,  0,80658,80659,80658,80659,140102,140103,140104,140105,  0,140102],
    [120142,120143,120144,120145,  0,  0,  0,  0,  0,  0,  0,10289,514,130063,  0],
    [120186,120187,120188,120189,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,130063,  0,  0,  0,  0,  0,  0,  0,  0,  0,130016],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,120870,120871,120872,120873,  0,  0],
    [  0,  0,  0,  0,10289,  0,  0,  0,120913,120914,120915,120916,120917,  0,  0],
    [  0,  0,  0,  0,516,  0,  0,  0,120957,120958,120959,120960,120961,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10289,  0,130063,  0],
    [  0,  0,  0,  0,  0,130016,  0,  0,  0,311,311,311,517,311,311],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,311,10110,  0,  0,10161,10162],
    [  0,  0,  0,  0,  0,  0,  0,129,  0,311,  0,  0,517,  0,  0],
    [  0,  0,  0,  0,30509,30509,30509,30509,  0,311,  0,10136,10137,10138,  0],
    [  0,  0,  0,  0,30509,30509,30509,30509,  0,311,517,10144,10145,10146,517],
    [  0,  0,  0,  0,30509,30509,30509,30509, 89,311,  0,10152,10153,10154,  0]
],
    "bgmap": [
    [120707,120399,120707,120708,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [120707,120399,120707,120708,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [120707,120707,120707,120708,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [120707,120399,120707,120708,  0,  0,100040,  0,  0,  0,100040,  0,559,  0,  0],
    [120707,120399,120707,120708,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [120707,120707,120707,120708,  0,  0,  0,  0,  0,100040,  0,  0,  0,100040,  0],
    [120707,120399,120707,120708,  0,  0,100040,  0,  0,  0,  0,  0,  0,  0,  0],
    [120707,120399,120707,120708,  0,557,  0,  0,  0,  0,  0,  0,  0,  0,100040],
    [120707,120707,120707,120708,  0,  0,  0,100040,  0,  0,  0,  0,556,  0,556],
    [120707,120399,120707,120708,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [120707,120399,120707,120708,  0,  0,  0,  0,  0,  0,359,359,359,359,359],
    [120707,120707,120707,120708,  0,100040,  0,  0,  0,  0,359,359,359,359,359],
    [120707,120399,120707,120708,  0,  0,  0,  0,  0,  0,359,359,359,359,359],
    [120707,120399,120707,120708,  0,  0,  0,  0,556,  0,359,359,359,359,359],
    [120707,120707,120707,120708,  0,  0,  0,  0,  0,  0,359,359,359,359,359]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,130042,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,130042,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,130042,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10163],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10160,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10140,  0,10140,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "陆地"
}