main.floors.train1=
{
    "floorId": "train1",
    "title": "训练场",
    "name": "训练场",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        {
            "type": "confirm",
            "text": "是否跳过教程关？（初次游玩不建议跳过）",
            "yes": [
                {
                    "type": "pauseBgm"
                },
                {
                    "type": "confirm",
                    "text": "跳过开头剧情吗？",
                    "yes": [
                        {
                            "type": "changeFloor",
                            "floorId": "prepare1",
                            "loc": [
                                7,
                                7
                            ]
                        }
                    ],
                    "no": [
                        {
                            "type": "setHeroOpacity",
                            "opacity": 0
                        },
                        {
                            "type": "changeFloor",
                            "floorId": "MT0",
                            "loc": [
                                -1,
                                -1
                            ]
                        }
                    ]
                }
            ],
            "no": [
                {
                    "type": "setValue",
                    "name": "status:hp",
                    "value": "500"
                },
                {
                    "type": "showStatusBar"
                },
                {
                    "type": "setCurtain",
                    "time": 500
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "提示：本游戏机制较多，部分玩家可能难以理解。如果觉得教程没看明白，可以直接跳过，游戏过程中会有相应的教程提示。",
                {
                    "type": "text",
                    "text": "\t[奥金莱克]\f[auchinleck.png,0,310]指挥官阁下，很高兴你有参军的志向。但如果你想要顺利毕业，就得跟着我们学会用兵打仗的方法。",
                    "pos": [
                        100,
                        300,
                        380
                    ]
                },
                {
                    "type": "text",
                    "text": "\t[奥金莱克]\f[auchinleck.png,0,310]陆军作战的知识将由我来传授给你。",
                    "pos": [
                        100,
                        300,
                        380
                    ]
                },
                {
                    "type": "text",
                    "text": "\t[奥金莱克]\f[auchinleck.png,0,310]本游戏的操作方式与常规魔塔游戏相同，但或许你已经发现了，右侧的状态栏里有很多以前不认识的名词。",
                    "pos": [
                        100,
                        300,
                        380
                    ]
                },
                {
                    "type": "text",
                    "text": "\t[奥金莱克]\f[auchinleck.png,0,310]血量、血限和攻击力的用途想必你已经知道了，这里不再过多赘述。但是，这个游戏里是没有“防御力”一说的。这就意味着敌我双方进行的都是“魔攻”。",
                    "pos": [
                        100,
                        300,
                        380
                    ]
                },
                {
                    "type": "text",
                    "text": "\t[奥金莱克]\f[auchinleck.png,0,310]不过并不是完全没有减伤手段。状态栏中的“穿甲”和“装甲”在陆战中有着举足轻重的地位。",
                    "pos": [
                        100,
                        300,
                        380
                    ]
                },
                {
                    "type": "text",
                    "text": "\t[奥金莱克]\f[auchinleck.png,0,310]不过这些我们稍后再说，我先看看你的底子如何。",
                    "pos": [
                        100,
                        300,
                        380
                    ]
                },
                {
                    "type": "text",
                    "text": "\t[奥金莱克]\f[auchinleck.png,0,310]你的任务就是选择合适的路线，击败\\i[commandos]这个敌人。规则与传统魔塔相同，捡拾血瓶\\i[redPotion]增加生命值但不超过生命上限。黄宝石\\i[yellowGem]提升血限和相同数值的血量。红宝石\\i[redGem]提升攻击力。对应颜色的钥匙\\i[yellowKey]开对应颜色的门\\i[yellowDoor]。",
                    "pos": [
                        100,
                        300,
                        380
                    ]
                },
                {
                    "type": "text",
                    "text": "\t[奥金莱克]\f[auchinleck.png,0,310]绿宝石\\i[greenGem]加后勤值，与魔塔里的魔防（护盾）相同，且可以使伤害为负。蓝宝石\\i[blueGem]在这里加的不是防御力，而是指挥点数。这个数值有什么用，稍后会解释。以及，按X键可以查看敌人属性\\i[book]。",
                    "pos": [
                        100,
                        300,
                        380
                    ]
                }
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,2": {
            "floorId": "train2",
            "loc": [
                7,
                0
            ],
            "direction": "down"
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "12,8": [
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]打得不错。不过，这两个数值只有地面部队之间的战斗才能用到，对海军和空军来说是无效的属性。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]最后一个拦路之敌的战斗力更加强大。但打仗并不是只靠武力就能解决的，灵活运用战术（技能）也是制胜关键。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]技能的使用需要消耗一定量的“指挥点数”（魔力）。指挥点数没有上限，可以通过捡拾蓝宝石\\i[blueGem]获取。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]技能分为两种：\r[yellow]“战略技能”和“战术技能”\r。“战略技能”通常情况下只要你指挥点数充足就可以随便放。而“战术技能”同时只能开启一个，并且在下一场战斗中自动触发。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]本游戏的技能系统与其他魔塔不同。你在每次进入新的区域时，只能携带至多7个技能以在当前区域的战斗中使用，快捷键分别为数字键1-7。中途无法更换，如果选错了就只能读档重选。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            "\t[系统提示]这样做的原因其实就是技能太多了，找起来过于麻烦，所以要求只能选几个合适的技能带进去。要不然你们应该不希望键盘上所有按键都被设置成某个技能的快捷键吧？",
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]现在你有一次选择技能的机会，然后击败最后一个敌人吧。如果在战斗期间忘记了技能的效果，可以按T键在背包\\i[toolbox]里查看当前所携带的技能效果。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            "\t[系统提示]新版本对技能快捷键设定阶段做了优化。并且，使用技能时也可以直接点击状态栏上的对应按键，手机玩家再也不需要打开虚拟键盘了！",
            "\t[系统提示]指挥点数已增加",
            {
                "type": "setValue",
                "name": "status:mana",
                "value": "30"
            },
            "\t[系统提示]即将进入存档页面",
            {
                "type": "callSave"
            },
            {
                "type": "function",
                "function": "function(){\nflags.learned[1]=true\n}"
            },
            {
                "type": "insert",
                "name": "选择技能"
            }
        ],
        "9,10": [
            {
                "type": "openDoor",
                "loc": [
                    12,
                    9
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]做的不错。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]但是下一个敌人比较强，你现在的实力打不过他。这种情况下，除了吃宝石提升自身实力外，还有一种方法，那就是你的装备。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]本塔的装备种类有7种，但其中，只有“坦克”这项与我们当前的陆军教学有关，所以我只讲“坦克”，其他6种会有其他人来跟你解释。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]坦克类装备直接决定了你的“穿甲”和“装甲”值。这两个数值在战斗中的作用如下：",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]在陆战中，如果你的“穿甲”高于敌方的“装甲”，那么将视为你能够“击穿”敌人。反之，如果你的“穿甲”小于敌方“装甲”，则视为“未击穿”。需要注意，敌方陆军也有这两个属性，效果是相同的。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]当你“击穿”敌人但敌人“未击穿”你时，你将会获得5个回合的先手攻击，并且之后的战斗中可以额外获得20%的战斗减伤。但上述条件若是反过来，敌方就会获得相同的先攻次数和战斗减伤了。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]如果双方彼此“击穿”或彼此“未击穿”，则无事发生，双方进入正常战斗。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            "\t[系统提示]简单来说就是：跟敌人比大小，赢的一方可以先攻5回合并获得比例减伤，平手无事发生。",
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]每一辆坦克都自带“穿甲”和“装甲”两个值，除此之外没有其他任何获取途径。所以，坦克部队的重要性也就不言而喻了。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]与前两部作品一样，在这个游戏中，敌人的属性是会根据战斗的进程而随时变化的，但同种敌人的穿甲和装甲值不会变动。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]\r[yellow]特别注意，本作是禁止在战斗中自由切换装备的\r，所以每个区域开始都会有一个准备阶段，你可以在准备阶段选择自己的出战装备。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "setValue",
                "name": "item:h35",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "loadEquip",
                "id": "h35"
            },
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]这次我已经替你装备好了，现在去击败前方的敌人吧。按q键查看装备系统，但本作中你只能查看，不能切装备。",
                "pos": [
                    100,
                    300,
                    380
                ]
            }
        ],
        "12,3": [
            {
                "type": "text",
                "text": "\t[奥金莱克]\f[auchinleck.png,0,310]不错，你已经初步掌握了地面战斗相关的技巧。现在你可以去下个地方报道，去学习空战相关的技巧吧。",
                "pos": [
                    100,
                    300,
                    380
                ]
            },
            {
                "type": "function",
                "function": "function(){\nflags.learned[1]=false\n}"
            },
            {
                "type": "unloadEquip",
                "pos": 0
            },
            {
                "type": "setValue",
                "name": "item:h35",
                "operator": "-=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {
        "10,13": [
            "\t[系统提示]似乎选择了错误的路线呢，读档重试吧！"
        ],
        "4,13": [
            "\t[系统提示]似乎选择了错误的路线呢，读档重试吧！"
        ],
        "10,6": [
            "\t[系统提示]似乎选择了错误的路线呢，读档重试吧！"
        ],
        "2,6": [
            "\t[系统提示]似乎选择了错误的路线呢，读档重试吧！"
        ],
        "2,8": [
            "\t[系统提示]似乎选择了错误的路线呢，读档重试吧！"
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 89, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20,226, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 27, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 34, 20, 20],
    [ 20, 20, 30, 30,  0, 82,  0, 82,  0,  0, 31, 20, 27, 20, 20],
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 34, 20, 20],
    [ 20, 20, 29, 29, 29, 82,  0, 82, 27, 27, 27, 20,224, 20, 20],
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 85, 20, 20],
    [ 20, 20, 20, 20, 20, 20,  0,201,  0,203,  0, 33,  0, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20, 81, 20, 20, 20, 20, 20, 20, 20],
    [ 20, 20, 33, 33, 33, 20, 21, 31, 22, 20, 27, 27, 27, 20, 20],
    [ 20, 20, 33, 33, 33, 81,  0,  0,  0, 81, 27, 27, 27, 20, 20],
    [ 20, 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 20, 20]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "ConquestofParadise.mp3",
    "area": "陆地"
}